{
    "id": "bitcointranscripts+magicalcryptoconference+2019+bitcoin-satellite-network",
    "title": "Bitcoin Satellite Network",
    "body_formatted": "{\"type\":\"heading\",\"text\":\"Bitcoin in Spaaace!\"}, {\"type\":\"paragraph\",\"text\":\"I am going to be talking about the bitcoin satellite service that Blockstream has been offering for a few years now. I am going to talk about what it does and why that's interesting to users.\"}, {\"type\":\"heading\",\"text\":\"Satellite infrastructure\"}, {\"type\":\"paragraph\",\"text\":\"There are 4 satellites, 2 uplinks with base stations sending data up to the satellites, and then 5 transponders. It's covering both Asia and Australia with one satellite with two transponders. Telstar 18v was launched by SpaceX late last year. It uses a 9m (30 ft) uplink dish. Blockstream is leasing fractional bandwidth on commercial satellites. You can negotiate with them to lease bandwidth, and that's what we did, at least enough bandwidth to provide the satellite service.\"}, {\"type\":\"paragraph\",\"text\":\"The uplinks are operated by Blockstream. We have two uplink sites. The picture on the right is the 9m dish which is the uplink for the pacific region.\"}, {\"type\":\"heading\",\"text\":\"User equipment\"}, {\"type\":\"paragraph\",\"text\":\"The whole design is setup to minimize user equipment costs. On the left you can see the satellite dish setup using a 45cm dish, and a software-defined radio card. The picture on the right is of a ... so it's a 64-bit ARM CPU processor. That's the minimal specification it takes to run the software. It costs about $40 to buy that equipment.\"}, {\"type\":\"heading\",\"text\":\"How it works\"}, {\"type\":\"paragraph\",\"text\":\"It might sound high-tech. But satellites are actually relatively dumb. We leased bandwidth on 4 satellites with 5 coverage zones. We have two dedicated Blockstream owned uplink sites. Satellites are dumb and all the intelligence is on the ground. We use a bitcoin node at the uplink, with low latency FIBRE network. We use forward error correction, and 4x block retransmit per 24 hour period. We use an SDR that does analog-to-digital conversion, and signal procesing is in arm64 processors.\"}, {\"type\":\"heading\",\"text\":\"What do you use this satellite service for?\"}, {\"type\":\"paragraph\",\"text\":\"It has an interesting number of use cases. This is cheap privacy- it's passive broadcast, nobody knows you're using it. You can receive information and nobody knows that you were the one that were interested in that data. It saves bandwidth, it's about 10 gigabytes/month. IP addresses are often translatable. It also enables more global bitcoin access, and provides network split resilience. A bitcoin full node uses more than 10 gigabytes per month, and with satellite you can .... it also emerges cost in emerging markets. It also enables bitcoin mining.\"}, {\"type\":\"paragraph\",\"text\":\"Also, the internet itself can suffer from political disruptions and also other network disruptions. So having a satellite downlink can provide some more resiliency for users around the world. This helps protect against network partition events. You might otherwise continue operating thinking that your transactions have finality when in reality you were operating in a network split, and you were accepting unconfirmed bitcoin payments.\"}, {\"type\":\"paragraph\",\"text\":\"The satellites use multiple uplinks, we have two uplinks. If there was a network obstruction in one place, it can receive information from the other location. This provides cross-satellite resiliency. This is useful in situations where merchants might have a problem with having outages, and they could use this service to have extra resilience.\"}, {\"type\":\"heading\",\"text\":\"Satellite API\"}, {\"type\":\"paragraph\",\"text\":\"We are offering access to the satellite broadcast using our satellite API. You can send short messages, paid with lightning through an API. You can broadcast data to the satellite nodes. This is useful for applications and could be used for price information, app info, blogging, news, Satoshi's Treasure, things like that. It's an internet-connected HTTP REST API. You pay for it with lightning.\"}, {\"type\":\"paragraph\",\"text\":\"I think there's someone operating a news site. There's all kinds of use cases.\"}, {\"type\":\"heading\",\"text\":\"How do you send?\"}, {\"type\":\"paragraph\",\"text\":\"If you are receiving bitcoin transactions from the satellite, how are you sending data? Transactions are small, like 250 bytes. Even at $10/megabyte, which you might be charged if you had a fancy satellite internet connection, transactions could still be sent in a few seconds. So you can use Iridium MIfi, or a hughes bi-directional satellite data device. Or Povol Rusnak's bitcoin SMS gateway, or meshnets like gotenna + muletools.\"}, {\"type\":\"heading\",\"text\":\"What's next?\"}, {\"type\":\"paragraph\",\"text\":\"We want bigger re-transmit windows, so that you can have more downtime and get caught up with blocks. There's a small coverage gap in Eastern Europe right now that we want to fix. We want to lower the equipment cost, and put things together in kits. We also want this thing to be easier to use, and we want more third-party developers to build out use cases in emerging markets and other applications.\"}",
    "body": "\n# Bitcoin in Spaaace!\n\nI am going to be talking about the bitcoin satellite service that Blockstream has been offering for a few years now. I am going to talk about what it does and why that's interesting to users.\n\n# Satellite infrastructure\n\nThere are 4 satellites, 2 uplinks with base stations sending data up to the satellites, and then 5 transponders. It's covering both Asia and Australia with one satellite with two transponders. Telstar 18v was launched by SpaceX late last year. It uses a 9m (30 ft) uplink dish. Blockstream is leasing fractional bandwidth on commercial satellites. You can negotiate with them to lease bandwidth, and that's what we did, at least enough bandwidth to provide the satellite service.\n\nThe uplinks are operated by Blockstream. We have two uplink sites. The picture on the right is the 9m dish which is the uplink for the pacific region.\n\n# User equipment\n\nThe whole design is setup to minimize user equipment costs. On the left you can see the satellite dish setup using a 45cm dish, and a software-defined radio card. The picture on the right is of a ... so it's a 64-bit ARM CPU processor. That's the minimal specification it takes to run the software. It costs about $40 to buy that equipment.\n\n# How it works\n\nIt might sound high-tech. But satellites are actually relatively dumb. We leased bandwidth on 4 satellites with 5 coverage zones. We have two dedicated Blockstream owned uplink sites. Satellites are dumb and all the intelligence is on the ground. We use a bitcoin node at the uplink, with low latency FIBRE network. We use forward error correction, and 4x block retransmit per 24 hour period. We use an SDR that does analog-to-digital conversion, and signal procesing is in arm64 processors.\n\n# What do you use this satellite service for?\n\nIt has an interesting number of use cases. This is cheap privacy- it's passive broadcast, nobody knows you're using it. You can receive information and nobody knows that you were the one that were interested in that data. It saves bandwidth, it's about 10 gigabytes/month. IP addresses are often translatable. It also enables more global bitcoin access, and provides network split resilience. A bitcoin full node uses more than 10 gigabytes per month, and with satellite you can .... it also emerges cost in emerging markets. It also enables bitcoin mining.\n\nAlso, the internet itself can suffer from political disruptions and also other network disruptions. So having a satellite downlink can provide some more resiliency for users around the world. This helps protect against network partition events. You might otherwise continue operating thinking that your transactions have finality when in reality you were operating in a network split, and you were accepting unconfirmed bitcoin payments.\n\nThe satellites use multiple uplinks, we have two uplinks. If there was a network obstruction in one place, it can receive information from the other location. This provides cross-satellite resiliency. This is useful in situations where merchants might have a problem with having outages, and they could use this service to have extra resilience.\n\n# Satellite API\n\nWe are offering access to the satellite broadcast using our satellite API. You can send short messages, paid with lightning through an API. You can broadcast data to the satellite nodes. This is useful for applications and could be used for price information, app info, blogging, news, Satoshi's Treasure, things like that. It's an internet-connected HTTP REST API. You pay for it with lightning.\n\nI think there's someone operating a news site. There's all kinds of use cases.\n\n# How do you send?\n\nIf you are receiving bitcoin transactions from the satellite, how are you sending data? Transactions are small, like 250 bytes. Even at $10/megabyte, which you might be charged if you had a fancy satellite internet connection, transactions could still be sent in a few seconds. So you can use Iridium MIfi, or a hughes bi-directional satellite data device. Or Povol Rusnak's bitcoin SMS gateway, or meshnets like gotenna + muletools.\n\n# What's next?\n\nWe want bigger re-transmit windows, so that you can have more downtime and get caught up with blocks. There's a small coverage gap in Eastern Europe right now that we want to fix. We want to lower the equipment cost, and put things together in kits. We also want this thing to be easier to use, and we want more third-party developers to build out use cases in emerging markets and other applications.\n\n",
    "body_type": "markdown",
    "created_at": "2019-05-11T00:00:00.000Z",
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/magicalcryptoconference/2019/bitcoin-satellite-network",
    "categories": [
        "conference"
    ],
    "media": "https://youtu.be/tJOI2i6h3HM",
    "authors": [
        "Adam Back"
    ],
    "indexed_at": "2024-03-21T16:33:36.803Z",
    "transcript_by": "Bryan Bishop",
    "summary": "Blockstream, under the leadership of Adam Back, has taken a significant leap in enhancing Bitcoin's accessibility and reliability through its innovative satellite service. This initiative aims to minimize dependence on traditional internet infrastructure, providing a unique solution for users worldwide. The service, powered by four satellites with coverage zones encompassing Asia, Australia, and beyond, represents a major advancement in blockchain technology dissemination.\n\nAt the core of Blockstream’s satellite service is a sophisticated infrastructure comprising two uplink sites and a network of leased bandwidth on commercial satellites. This setup ensures comprehensive global coverage and continuous data broadcasting. The Telstar 18v, a notable satellite launched by SpaceX, exemplifies the high-tech assets utilized in this endeavor. Users benefit from minimized equipment costs, requiring only a modest setup including a small dish and a software-defined radio card, making the technology accessible even in low-resource settings.\n\nThe operational philosophy behind this satellite service prioritizes simplicity and efficiency. Despite the complex satellite technology involved, the intelligence of the system resides on the ground through dedicated Blockstream-owned uplinks. These uplinks, equipped with bitcoin nodes and advanced error correction capabilities, facilitate the seamless transmission of data across vast distances. The use of arm64 processors for signal processing underscores the technical sophistication that makes this service possible.\n\nAdam Back highlighted several compelling use cases for the satellite service, underscoring its versatility and value. From enhancing privacy through passive broadcast systems to reducing bandwidth costs and enabling more widespread access to Bitcoin, the service addresses critical challenges facing the cryptocurrency ecosystem. Particularly noteworthy is its role in providing resilience against network splits and political disruptions, ensuring that transactions remain secure and uninterrupted across different geopolitical landscapes.\n\nFurthermore, the introduction of a Satellite API opens new avenues for data broadcasting, allowing users to send messages via the Lightning Network. This feature has the potential to revolutionize how information is shared globally, supporting a wide range of applications from financial data dissemination to blogging and news distribution.\n\nAs Blockstream looks to the future, ambitions include expanding coverage, reducing equipment costs, and fostering a vibrant ecosystem of third-party developers. By addressing current limitations and encouraging innovation, Adam Back and his team are poised to reinforce Bitcoin's position as a resilient, universally accessible currency. The commitment to lowering barriers and enhancing the user experience signals a promising direction for the satellite service, with implications reaching far beyond the immediate Bitcoin community."
}