{
    "id": "bitcointranscripts+magicalcryptoconference+2019+htc",
    "title": "Htc",
    "body_formatted": "{\"type\":\"paragraph\",\"text\":\"HTC / Exodus\"}, {\"type\":\"heading\",\"text\":\"Introduction\"}, {\"type\":\"paragraph\",\"text\":\"SM: This conversation started a couple months ago in Hong Kong with Phil Chen and Adam Back were sitting in a bar talking about the bitcoin industry and what would move it forward. Without further adue, please welcome Phil Chen.\"}, {\"type\":\"heading\",\"text\":\"Special announcement from HTC Exodus\"}, {\"type\":\"paragraph\",\"text\":\"Hi. I am Phil Chen from HTC. As you may know, we  built the first Android phone in 2008. The reason why we did that was because we believe in open-source. We believe in the promise of the internet. As we all know in this room, the whole open-source movement is incredibly important. In 2018, HTC launched the Exodus phone. The key was, how do we empower users to keep their own keys?\"}, {\"type\":\"paragraph\",\"text\":\"We wanted to build something on top of bitcoin. If you don't own your keys, then you don't have your assets. We built on top of this to let users control their keys.  We wanted a phone that can also support identity.\"}, {\"type\":\"heading\",\"text\":\"Exodus\"}, {\"type\":\"paragraph\",\"text\":\"So we focused first on holding your own keys. We also implemented social key recovery. We built something on top of Shamir secret sharing. You can share your keys with your friends so that if you lose your phone you can recover it. One of the most important things for the whole industry is key management. One of the features we have is, we're going to open-source our code and our social key recovery mechanism.\"}, {\"type\":\"heading\",\"text\":\"Social security\"}, {\"type\":\"paragraph\",\"text\":\"We have found a lot of supports including Vitalik Buterin who was excited about social key recovery in our phone. Charlie Lee was also an advisor for Exodus.\"}, {\"type\":\"heading\",\"text\":\"Key management\"}, {\"type\":\"paragraph\",\"text\":\"Key management is one of the most important things in this industry. How do we manage wallets and keys? We have a secure element in our phone. It's kept in a hardware element. This is a trusted execution environment where you can sign with your keys. We're calling this the zion vault.\"}, {\"type\":\"paragraph\",\"text\":\"<ttps://github.com/htczion/ZionVaultSDK>\"}, {\"type\":\"paragraph\",\"text\":\"I want to show a video of something we did with the Opera browser, built in with crypto wallets. You can sign in with your private keys, and you can use your wallet attached with it to do micropayments. There's no audio, but it has a trusted execution environment.\"}, {\"type\":\"heading\",\"text\":\"Securing the network\"}, {\"type\":\"paragraph\",\"text\":\"We want to figure out how we can help secure the network even more. Exodus 1S will be running a full bitcoin node. We validate transactions and blocks, we relay transactions and blocks to other nodes. We want to help app developers make better wallets. This will be coming to Exodus 1 and Exodus 1S in Q3 2019.\"}, {\"type\":\"paragraph\",\"text\":\"https://www.htcxodus.com/\"}, {\"type\":\"paragraph\",\"text\":\"twitter: philchen913\"}",
    "body": "\nHTC / Exodus\n\n# Introduction\n\nSM: This conversation started a couple months ago in Hong Kong with Phil Chen and Adam Back were sitting in a bar talking about the bitcoin industry and what would move it forward. Without further adue, please welcome Phil Chen.\n\n# Special announcement from HTC Exodus\n\nHi. I am Phil Chen from HTC. As you may know, we  built the first Android phone in 2008. The reason why we did that was because we believe in open-source. We believe in the promise of the internet. As we all know in this room, the whole open-source movement is incredibly important. In 2018, HTC launched the Exodus phone. The key was, how do we empower users to keep their own keys?\n\nWe wanted to build something on top of bitcoin. If you don't own your keys, then you don't have your assets. We built on top of this to let users control their keys.  We wanted a phone that can also support identity.\n\n# Exodus\n\nSo we focused first on holding your own keys. We also implemented social key recovery. We built something on top of Shamir secret sharing. You can share your keys with your friends so that if you lose your phone you can recover it. One of the most important things for the whole industry is key management. One of the features we have is, we're going to open-source our code and our social key recovery mechanism.\n\n# Social security\n\nWe have found a lot of supports including Vitalik Buterin who was excited about social key recovery in our phone. Charlie Lee was also an advisor for Exodus.\n\n# Key management\n\nKey management is one of the most important things in this industry. How do we manage wallets and keys? We have a secure element in our phone. It's kept in a hardware element. This is a trusted execution environment where you can sign with your keys. We're calling this the zion vault.\n\n<ttps://github.com/htczion/ZionVaultSDK>\n\nI want to show a video of something we did with the Opera browser, built in with crypto wallets. You can sign in with your private keys, and you can use your wallet attached with it to do micropayments. There's no audio, but it has a trusted execution environment.\n\n# Securing the network\n\nWe want to figure out how we can help secure the network even more. Exodus 1S will be running a full bitcoin node. We validate transactions and blocks, we relay transactions and blocks to other nodes. We want to help app developers make better wallets. This will be coming to Exodus 1 and Exodus 1S in Q3 2019.\n\nhttps://www.htcxodus.com/\n\ntwitter: philchen913\n\n",
    "body_type": "markdown",
    "created_at": "2019-05-11T00:00:00.000Z",
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/magicalcryptoconference/2019/htc",
    "categories": [
        "conference"
    ],
    "media": "https://youtu.be/CyieujRFk3g?t=8077",
    "authors": [
        "Phil Chen"
    ],
    "indexed_at": "2024-03-21T16:33:36.807Z",
    "transcript_by": "Bryan Bishop",
    "summary": "In an engaging discussion that began in a Hong Kong bar between Phil Chen and Adam Back, the conversation soon turned to the future of the bitcoin industry and the innovative steps necessary to propel it forward. Phil Chen, representing HTC, introduced a groundbreaking development from the company known for creating the first Android phone in 2008. HTC's commitment to open-source and the promise of the internet has been a driving force behind their technological advancements. In 2018, HTC unveiled the Exodus phone, a device designed with a fundamental focus on user empowerment through ownership of digital keys, reflecting a deeper philosophy that true asset ownership is intertwined with key management.\n\nThe Exodus phone emerged from HTC's ambition to build upon the bitcoin framework, emphasizing the importance of users maintaining control over their keys—and by extension, their digital identities and assets. Recognizing the challenges associated with key management, HTC innovated a solution centered around social key recovery. This feature, based on Shamir's Secret Sharing, allows users to distribute parts of their keys among trusted friends, enabling asset recovery if the device is lost. Such an approach not only enhances security but also democratizes the responsibility of key management within one's social circle.\n\nPhil Chen highlighted the enthusiastic support from notable figures in the cryptocurrency community, including Vitalik Buterin and Charlie Lee, who have both recognized the potential impact of social key recovery on enhancing user security. Further emphasizing the critical role of key management, HTC introduced the Zion Vault—a secure element within the phone that provides a trusted execution environment for signing with private keys. This initiative demonstrates HTC's commitment to bolstering security and privacy for its users.\n\nMoreover, HTC's collaboration with the Opera browser introduces an integrated experience where users can securely sign in with their private keys for micropayments, showcasing the practical applications of the Zion Vault. Looking ahead, HTC aims to contribute to the security of the broader network. The announcement that the Exodus 1S will run a full bitcoin node highlights HTC's dedication to validating transactions and supporting app developers in creating more secure wallets. Slated for release in Q3 2019 for both Exodus 1 and Exodus 1S models, this feature marks a significant step towards decentralizing and securing the blockchain ecosystem.\n\nPhil Chen's discussion encapsulates HTC's visionary approach to integrating blockchain technology with mobile devices. By focusing on key management, social key recovery, and network security, HTC is not just creating a phone but fostering an ecosystem where users have total control and security over their digital lives. With these innovations, HTC positions itself at the forefront of merging blockchain technology with mobile communications, promising a future where digital asset management is accessible, secure, and user-centric."
}