{
    "id": "bitcointranscripts+magicalcryptoconference+2019+intro",
    "title": "Intro",
    "body_formatted": "{\"type\":\"paragraph\",\"text\":\"Intro\"}, {\"type\":\"paragraph\",\"text\":\"Whalepanda\"}, {\"type\":\"paragraph\",\"text\":\"Hello? Ladies and gentlemen, please take your seats and we're going to start now. Good afternoon everyone. I'm a self-proclaimed VP of operations and swag for this crypto conference. I'm also a friend of the Magical Crypto Friends. I'm very happy to see the turnout for this conference. I see people who are clearly passionate based on the way they dress. Thank you all for coming. I am going to ask a question. What's your favorite thing about this conference so far? Nothing about ICOs. I like that answer. I like your shirt also. My shirt says \\\"Satoshi is Black\\\" ((applause)). \\\"He's a woman, too\\\". Looks like we're ready now. Without further adue, here are the crypto friends to come on stage.\"}, {\"type\":\"heading\",\"text\":\"Introduction\"}, {\"type\":\"paragraph\",\"text\":\"This is the real Riccardo. Remotely. \\\"Hello people\\\".\"}, {\"type\":\"paragraph\",\"text\":\"WP: Welcome everyone to the first and last Magical Crypto Conference in New York. I will start with some practical information. If you take pictures, we encourage it, but please ask permission if other people are in it. Also tag us, it's MCC2019. Use the right hashtag.\"}, {\"type\":\"paragraph\",\"text\":\"CL: We have a a harassment policy. Don't shill ICOs to other people. It's not worth it. If you have issues, we have purple kraken sponsor t-shirts that say \\\"FRIEND\\\" on it.\"}, {\"type\":\"paragraph\",\"text\":\"SM: It's the \\\"Magical Crypto Friends friend\\\" t-shirt. It's the most awkward we could make it. We also have wifi. The ssid is \\\"Infinite Fleet\\\" and the password is \\\"tether2themoon\\\". That was your idea. We had wifi for 500 people. I think we're over 500 people. If there are issues, we will deal with it. Tweet at me, and then we'll see.\"}, {\"type\":\"paragraph\",\"text\":\"CL: You shouldn't use wifi anyway, because spooks.\"}, {\"type\":\"paragraph\",\"text\":\"WP: Please, this evening there will be a party and everyone here likes a party, but please don't lose your badge. If you lose your badge, then you won't be able to get in tomorrow. You'll have to buy a new ticket. Outside there are two food trucks. Tomorrow there will be three. IT's free for speakers and VIPs.\"}, {\"type\":\"paragraph\",\"text\":\"SM: If you see a VIP person, please let them cut in front of you in line. We're serious. And in the bathroom. Everyone should have their swag bag. Every bag has a random doll or coin. I think the coins are in sequence. We have a booth in the back corner, staffed by Cindy and a few different people. They are selling Magical Crypto Friends t-shirts and some other gear. We ask that if you don't want a doll, then don't try to come to our booth and try to exchange it for a different one. You're welcome to use our magical crypto DEX where you can p2p trade with other people.\"}, {\"type\":\"paragraph\",\"text\":\"CL: After the conference, we have a sponsored party. It's at 630 at One Oak. Since tomorrow starts at 10am, please feel free to party as long as it takes. Come back refreshed tomorrow.\"}, {\"type\":\"paragraph\",\"text\":\"WP: If you lose your badge, then just buy a new ticket.\"}, {\"type\":\"paragraph\",\"text\":\"SM: For the speakers, you get miced up over there. Please be on time. If you go over the time limit, one of our magical crypto friends friend will tackle you on stage. So don't go over time.\"}, {\"type\":\"paragraph\",\"text\":\"WP: We will record a live MCF show at 530pm. Everything is live, except for one talk which will not be livestreamed where the speaker has asked to not livehand. The MCF episode will be about an hour and it will have Q&A. All the other talks do not have Q&A.\"}, {\"type\":\"paragraph\",\"text\":\"CL: You can take the stairs in the back next to the bull to get to the second floor with the other talks. There are 300 seats there. So how cool is the bull? Now we know why the price is going up. It's the MCC bullrun.\"}, {\"type\":\"paragraph\",\"text\":\"SM: We also have a special contest to announce. Allen, are you there? Can you share the pictures of the lambos? We're giving away six lambos. There are four colored lambos, one color for each of us. These will be given out for random attendees, and two others for a contest.\"}, {\"type\":\"paragraph\",\"text\":\"WP: Whoever can take the best most original picture of the cutouts. Or whoever can take the coolest picture of the bull. Don't mess with the bull. It's at your own risk. It's a MCC lambo, if you take that with the picture, we will decide which is the best one tomorrow and you will get a free lambo.\"}, {\"type\":\"paragraph\",\"text\":\"SM: We will draw it in a coffee break.\"}, {\"type\":\"paragraph\",\"text\":\"CL: These lambos are sponsored by our gold sponsors. They don't know it yet. Surprise.\"}, {\"type\":\"paragraph\",\"text\":\"WP: Pulling this out was quite an underatken. Thank you to our gold sponsors, bitstamp and others. Thank you to the secondary sponsors, and the bronze sponsors.\"}, {\"type\":\"paragraph\",\"text\":\"SM: This includes Litecoin Foundation, slushpool, bitfury, and Blockstream....\"}, {\"type\":\"paragraph\",\"text\":\"CL: Trail of Bits too. Thanks a lot.\"}, {\"type\":\"paragraph\",\"text\":\"WP: For btc.se, they organized the party this evening. Thanks mex and for the coffee cups. Intoro for the lanyards. Kraken for the t-shirts. Pixelmatic for wifi.\"}, {\"type\":\"paragraph\",\"text\":\"SM: Scan the back of your card, there's bitcoin there.\"}, {\"type\":\"paragraph\",\"text\":\"CL: Make sure your badges are forward or else nobody will know who you are.\"}, {\"type\":\"paragraph\",\"text\":\"SM: We will air the first ever live animated MCF short. Should we cut the lights?\"}",
    "body": "\nIntro\n\nWhalepanda\n\nHello? Ladies and gentlemen, please take your seats and we're going to start now. Good afternoon everyone. I'm a self-proclaimed VP of operations and swag for this crypto conference. I'm also a friend of the Magical Crypto Friends. I'm very happy to see the turnout for this conference. I see people who are clearly passionate based on the way they dress. Thank you all for coming. I am going to ask a question. What's your favorite thing about this conference so far? Nothing about ICOs. I like that answer. I like your shirt also. My shirt says \"Satoshi is Black\" ((applause)). \"He's a woman, too\". Looks like we're ready now. Without further adue, here are the crypto friends to come on stage.\n\n# Introduction\n\nThis is the real Riccardo. Remotely. \"Hello people\".\n\nWP: Welcome everyone to the first and last Magical Crypto Conference in New York. I will start with some practical information. If you take pictures, we encourage it, but please ask permission if other people are in it. Also tag us, it's MCC2019. Use the right hashtag.\n\nCL: We have a a harassment policy. Don't shill ICOs to other people. It's not worth it. If you have issues, we have purple kraken sponsor t-shirts that say \"FRIEND\" on it.\n\nSM: It's the \"Magical Crypto Friends friend\" t-shirt. It's the most awkward we could make it. We also have wifi. The ssid is \"Infinite Fleet\" and the password is \"tether2themoon\". That was your idea. We had wifi for 500 people. I think we're over 500 people. If there are issues, we will deal with it. Tweet at me, and then we'll see.\n\nCL: You shouldn't use wifi anyway, because spooks.\n\nWP: Please, this evening there will be a party and everyone here likes a party, but please don't lose your badge. If you lose your badge, then you won't be able to get in tomorrow. You'll have to buy a new ticket. Outside there are two food trucks. Tomorrow there will be three. IT's free for speakers and VIPs.\n\nSM: If you see a VIP person, please let them cut in front of you in line. We're serious. And in the bathroom. Everyone should have their swag bag. Every bag has a random doll or coin. I think the coins are in sequence. We have a booth in the back corner, staffed by Cindy and a few different people. They are selling Magical Crypto Friends t-shirts and some other gear. We ask that if you don't want a doll, then don't try to come to our booth and try to exchange it for a different one. You're welcome to use our magical crypto DEX where you can p2p trade with other people.\n\nCL: After the conference, we have a sponsored party. It's at 630 at One Oak. Since tomorrow starts at 10am, please feel free to party as long as it takes. Come back refreshed tomorrow.\n\nWP: If you lose your badge, then just buy a new ticket.\n\nSM: For the speakers, you get miced up over there. Please be on time. If you go over the time limit, one of our magical crypto friends friend will tackle you on stage. So don't go over time.\n\nWP: We will record a live MCF show at 530pm. Everything is live, except for one talk which will not be livestreamed where the speaker has asked to not livehand. The MCF episode will be about an hour and it will have Q&A. All the other talks do not have Q&A.\n\nCL: You can take the stairs in the back next to the bull to get to the second floor with the other talks. There are 300 seats there. So how cool is the bull? Now we know why the price is going up. It's the MCC bullrun.\n\nSM: We also have a special contest to announce. Allen, are you there? Can you share the pictures of the lambos? We're giving away six lambos. There are four colored lambos, one color for each of us. These will be given out for random attendees, and two others for a contest.\n\nWP: Whoever can take the best most original picture of the cutouts. Or whoever can take the coolest picture of the bull. Don't mess with the bull. It's at your own risk. It's a MCC lambo, if you take that with the picture, we will decide which is the best one tomorrow and you will get a free lambo.\n\nSM: We will draw it in a coffee break.\n\nCL: These lambos are sponsored by our gold sponsors. They don't know it yet. Surprise.\n\nWP: Pulling this out was quite an underatken. Thank you to our gold sponsors, bitstamp and others. Thank you to the secondary sponsors, and the bronze sponsors.\n\nSM: This includes Litecoin Foundation, slushpool, bitfury, and Blockstream....\n\nCL: Trail of Bits too. Thanks a lot.\n\nWP: For btc.se, they organized the party this evening. Thanks mex and for the coffee cups. Intoro for the lanyards. Kraken for the t-shirts. Pixelmatic for wifi.\n\nSM: Scan the back of your card, there's bitcoin there.\n\nCL: Make sure your badges are forward or else nobody will know who you are.\n\nSM: We will air the first ever live animated MCF short. Should we cut the lights?\n\n\n\n\n\n\n\n\n\n",
    "body_type": "markdown",
    "created_at": "2019-05-11T00:00:00.000Z",
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/magicalcryptoconference/2019/intro",
    "categories": [
        "conference"
    ],
    "media": "https://youtu.be/CyieujRFk3g",
    "indexed_at": "2024-03-21T16:33:36.808Z",
    "transcript_by": "Bryan Bishop",
    "summary": "The Magical Crypto Conference, a unique gathering signifying the convergence of cryptocurrency enthusiasts and experts, recently commenced with an atmosphere filled with anticipation and excitement. The conference was kick-started by WhalePanda, a self-proclaimed VP of operations and swag, who extended a warm welcome to attendees, appreciating their passion for the cryptosphere as evident from their spirited attire and engagement. WhalePanda's playful remark about Satoshi Nakamoto set a light-hearted tone for the event, highlighting the community's inclusive spirit.\n\nIn an era where digital interaction predominates, the conference's emphasis on real-world connections and respectful engagement was palpable. Riccardo Spagni remotely greeted the audience, signaling the start of what promised to be an insightful assembly. Practical information shared by WhalePanda underscored the organizers' commitment to fostering a comfortable and respectful environment. This included encouragement to share moments from the conference on social media with the appropriate hashtag, while also respecting privacy through seeking permission before capturing photos of attendees.\n\nThe conference laid down clear guidelines to ensure a harassment-free environment, illustrating the seriousness with which the organizers approached participant welfare. From discouraging ICO promotions to setting up a dedicated team identifiable in \"FRIEND\" t-shirts for any assistance, every detail was meticulously planned. The provision of WiFi, despite security cautions, and arrangements for a post-conference party were testament to the organizers’ endeavor to balance professional discourse with leisure, enhancing the overall experience.\n\nThe announcement of food arrangements, special privileges for VIPs, and the intriguing introduction of a magical crypto DEX for trading collectibles fostered a sense of community among participants. Furthermore, the conference boasted a lineup of engaging activities including a live recording of the Magical Crypto Friends show and exclusive talks. Notably, the inclusion of a contest with lamborghinis as prizes added an element of fun, encouraging creative participation from the audience.\n\nAcknowledgment of sponsors such as Bitstamp, the Litecoin Foundation, and several others underlined the collaborative effort behind the conference’s realization. The organizers did not shy away from expressing gratitude towards these entities, recognizing their pivotal role in facilitating the event. In addition, the innovative use of technology, as hinted by the bitcoin-loaded conference badges, and the promise of the first live animated MCF short showcased the conference's blending of entertainment with informative content.\n\nIn conclusion, the Magical Crypto Conference emerged as a beacon for the cryptocurrency community, offering a platform for knowledge exchange, networking, and celebration of the digital currency revolution. Through its thoughtful organization, emphasis on inclusivity and respect, and a diverse range of activities, the conference set a new standard for crypto gatherings, promising an enriching experience for all attendees."
}