{
    "id": "bitcointranscripts+magicalcryptoconference+2019+taxonomy-of-ln-nodes",
    "title": "Taxonomy Of Ln Nodes",
    "body_formatted": "{\"type\":\"heading\",\"text\":\"Introduction\"}, {\"type\":\"paragraph\",\"text\":\"Hello. I work at Blockstream on c-lightning. I am here today to talk to you about a taxonomy of nodes about who's who on the lightning network. I wnat ot go through the tools that have been built, looking through the perspectives of what different nodes are trying to accomplish.\"}, {\"type\":\"heading\",\"text\":\"LN map\"}, {\"type\":\"paragraph\",\"text\":\"There's a bunch of nodes on the network. Let's look at some stats. There's a little over 8,317 nodes. There are two categories so far. On the LN statistics site, it will say about 3374 public nodes, 490 nodes running over tor.... Those are publicly addressable nodes where you can go and create a channel with them because you know how to reach them. There's about 4453 nodes that aren't publicly accessible.\"}, {\"type\":\"heading\",\"text\":\"Categories\"}, {\"type\":\"paragraph\",\"text\":\"I am going to further divide the nodes into three different categories.\"}, {\"type\":\"paragraph\",\"text\":\"Consumer: One is the consumer category, people who want to make payments over the lightning network.\"}, {\"type\":\"paragraph\",\"text\":\"Vendors: These are individuals who want to sell things on the lightning network, like stores that sell stickers.\"}, {\"type\":\"paragraph\",\"text\":\"Liquidity providers\"}, {\"type\":\"paragraph\",\"text\":\"To get a better understanding of what these different perspectives have, I am going to walk you through quickly how payments owrk on lightning network.\"}, {\"type\":\"heading\",\"text\":\"Lightning payments\"}, {\"type\":\"paragraph\",\"text\":\"Open a channel, fund a channel, create a balance of payments in the channel. One of the nodes opened the channel so it will have a balance. There's a network of these nodes with open channels. Also, you can send money through the network and there's hops on the network. Based on the topology, you might not be able to route a payment because there's not enough liquidity pointing in the right direction to get that payment completed.\"}, {\"type\":\"paragraph\",\"text\":\"That's how payment flows have directionality. When we're talking about routing, it's not just the channel topology but also the balances in the channels.\"}, {\"type\":\"heading\",\"text\":\"More categorization\"}, {\"type\":\"paragraph\",\"text\":\"If you take a step back for a second, you can also classify based on the types of payment flows you're going to see. You can see that funds flow into a node, and we call that a vendor.\"}, {\"type\":\"paragraph\",\"text\":\"On the other hand, if it's largely making outflows, that's a consumer.\"}, {\"type\":\"paragraph\",\"text\":\"So you can make a generalization that there's consumers and vendors and the net flow of payments is from consumers to vendor. It would be bad to assume that every consumer would directly connect to vendors to send payments. But in general, consumers use liquidity providers to get to vendors.\"}, {\"type\":\"heading\",\"text\":\"Existing infrastructure\"}, {\"type\":\"paragraph\",\"text\":\"You can already classify some infrastructure. Some of the tools fit multiple categories, but I've divided them based on 3 things to see how these existing projects can fit into these silos.\"}, {\"type\":\"paragraph\",\"text\":\"We can start with consumers, projects that help consumers achieve their goal on the network. The first one is autopilot.\"}, {\"type\":\"heading\",\"text\":\"Autopilot\"}, {\"type\":\"paragraph\",\"text\":\"Autopilot is an automated service that runs on your LN node. It looks at the network and it decides which nodes are good to connect to, such that you have the ability to route payments. It runs automatically so the name is autopilot. There's a plugin for c-lightning called autopilot, and lnd has autopilot but I think it starts automatically without user opt-in but I'm not sure.\"}, {\"type\":\"heading\",\"text\":\"Wallets\"}, {\"type\":\"paragraph\",\"text\":\"Another technology for the consumers is wallets. There's a lightning wallet from Lightning Labs. They don't list your IP address or your node ID anywhere on it. It also doesn't talk about channels, it just has a balance. It abstracts this away. It's a unified interface. If you want to make a payment, nevermind how, this is how much money you have. So you only really care about your balance not the technical details.\"}, {\"type\":\"heading\",\"text\":\"Node proxies\"}, {\"type\":\"paragraph\",\"text\":\"These assume that you already have a separate node and you just want to be able to access it to send payments from a desktop or a mobile app. You can see this in chrome extensions, like Kiilowatt for c-lightning, and Joule... and then there's things like Spark Wallet for c-lightning which is the set of projects and that's... desktop client and mobile client. You can use a proxy to talk to your node.\"}, {\"type\":\"heading\",\"text\":\"Infrastructure for vendors\"}, {\"type\":\"paragraph\",\"text\":\"If you want to sell things on the lightning network, what kind of tools have been created to accept payments?\"}, {\"type\":\"heading\",\"text\":\"Payment plugins\"}, {\"type\":\"paragraph\",\"text\":\"The plugin I am most familiar with is a Woocommerce plugin for Wordpress. There's also one for PrestaShop. I'm sure there are more.\"}, {\"type\":\"heading\",\"text\":\"All-in-one solutions\"}, {\"type\":\"paragraph\",\"text\":\"This is a superset of the payment plugins. It takes everything you need and puts it in a box. An example of this is btcpay, and another one is LN store-in-a-box which is a collection of wordpress, lightning node, bitcoind and woocommerce plugin all in one so that you can put this on a server and setup and run it. So you go to lightninginabox.com and it has a bunch of software on it already.\"}, {\"type\":\"heading\",\"text\":\"Third-party proxies\"}, {\"type\":\"paragraph\",\"text\":\"One example is opennode. It's a semi-custodial thing that runs the node for you and you can proxy through them.\"}, {\"type\":\"heading\",\"text\":\"Infrastructure for liquidity providers\"}, {\"type\":\"paragraph\",\"text\":\"So what are the tools that help with liquidity providers? There's tools to help move money on and off the lightning network. Then there's rebalancers, where if you have a bunch of channels open and you want to move funds between them, there's a plugi nfor c-lightning called the rebalancer. And then finally there's some services you can do that you can go and get liquidity from. And then there's one called Thor, and someone wrote a form that will send you liquidity when you need it.\"}, {\"type\":\"heading\",\"text\":\"Future infrastructure\"}, {\"type\":\"paragraph\",\"text\":\"I want to talk about some new projects in the pipeline and how they fit into these three categories.\"}, {\"type\":\"heading\",\"text\":\"Trampoline payments\"}, {\"type\":\"paragraph\",\"text\":\"I think the trampoline payments proposal was sent out in late March or early April on the lightning-dev network. It was pierre and cdecker who came up with it. Instead of the client needing-- the consumer needing to know the exact route, instead they delegate some of the pathfinding responsibility to a larger liquidity provider and to help them get to the final destination.\"}, {\"type\":\"heading\",\"text\":\"Neutrino wallets\"}, {\"type\":\"paragraph\",\"text\":\"This is basically the latest version of SPV that is supposed to help make better mobile clients and do self-custody more effectively.\"}, {\"type\":\"heading\",\"text\":\"Dual-funded channels\"}, {\"type\":\"paragraph\",\"text\":\"I have a proposal for dual-funded channels that helps with liquidity. So people will be able to start with more balanced channels. Right now when opening a LN channel, only one person can contribute funds.\"}, {\"type\":\"heading\",\"text\":\"Splicing\"}, {\"type\":\"paragraph\",\"text\":\"Splicing is where you take loop-in and loop-out, which is what the Lightning Labs people did, and moving it into the spec so that anyone would be able to fund on and off chain on their own.\"}, {\"type\":\"heading\",\"text\":\"Liquidity advertisement\"}, {\"type\":\"paragraph\",\"text\":\"Nodes have liquidity and they will be able to advertise their liquidity so that if people needed it, they could find an easier way to go and get that liquidity.\"}, {\"type\":\"heading\",\"text\":\"Future stuff\"}, {\"type\":\"paragraph\",\"text\":\"I've been running a niftynei twitch channel where I livestream my dual-funded channel work. If you want to see what it's like to work on c-lightning, check out my channel. It's on twitch.\"}",
    "body": "\n# Introduction\n\nHello. I work at Blockstream on c-lightning. I am here today to talk to you about a taxonomy of nodes about who's who on the lightning network. I wnat ot go through the tools that have been built, looking through the perspectives of what different nodes are trying to accomplish.\n\n# LN map\n\nThere's a bunch of nodes on the network. Let's look at some stats. There's a little over 8,317 nodes. There are two categories so far. On the LN statistics site, it will say about 3374 public nodes, 490 nodes running over tor.... Those are publicly addressable nodes where you can go and create a channel with them because you know how to reach them. There's about 4453 nodes that aren't publicly accessible.\n\n# Categories\n\nI am going to further divide the nodes into three different categories.\n\nConsumer: One is the consumer category, people who want to make payments over the lightning network.\n\nVendors: These are individuals who want to sell things on the lightning network, like stores that sell stickers.\n\nLiquidity providers\n\nTo get a better understanding of what these different perspectives have, I am going to walk you through quickly how payments owrk on lightning network.\n\n# Lightning payments\n\nOpen a channel, fund a channel, create a balance of payments in the channel. One of the nodes opened the channel so it will have a balance. There's a network of these nodes with open channels. Also, you can send money through the network and there's hops on the network. Based on the topology, you might not be able to route a payment because there's not enough liquidity pointing in the right direction to get that payment completed.\n\nThat's how payment flows have directionality. When we're talking about routing, it's not just the channel topology but also the balances in the channels.\n\n# More categorization\n\nIf you take a step back for a second, you can also classify based on the types of payment flows you're going to see. You can see that funds flow into a node, and we call that a vendor.\n\nOn the other hand, if it's largely making outflows, that's a consumer.\n\nSo you can make a generalization that there's consumers and vendors and the net flow of payments is from consumers to vendor. It would be bad to assume that every consumer would directly connect to vendors to send payments. But in general, consumers use liquidity providers to get to vendors.\n\n# Existing infrastructure\n\nYou can already classify some infrastructure. Some of the tools fit multiple categories, but I've divided them based on 3 things to see how these existing projects can fit into these silos.\n\nWe can start with consumers, projects that help consumers achieve their goal on the network. The first one is autopilot.\n\n# Autopilot\n\nAutopilot is an automated service that runs on your LN node. It looks at the network and it decides which nodes are good to connect to, such that you have the ability to route payments. It runs automatically so the name is autopilot. There's a plugin for c-lightning called autopilot, and lnd has autopilot but I think it starts automatically without user opt-in but I'm not sure.\n\n# Wallets\n\nAnother technology for the consumers is wallets. There's a lightning wallet from Lightning Labs. They don't list your IP address or your node ID anywhere on it. It also doesn't talk about channels, it just has a balance. It abstracts this away. It's a unified interface. If you want to make a payment, nevermind how, this is how much money you have. So you only really care about your balance not the technical details.\n\n# Node proxies\n\nThese assume that you already have a separate node and you just want to be able to access it to send payments from a desktop or a mobile app. You can see this in chrome extensions, like Kiilowatt for c-lightning, and Joule... and then there's things like Spark Wallet for c-lightning which is the set of projects and that's... desktop client and mobile client. You can use a proxy to talk to your node.\n\n# Infrastructure for vendors\n\nIf you want to sell things on the lightning network, what kind of tools have been created to accept payments?\n\n# Payment plugins\n\nThe plugin I am most familiar with is a Woocommerce plugin for Wordpress. There's also one for PrestaShop. I'm sure there are more.\n\n# All-in-one solutions\n\nThis is a superset of the payment plugins. It takes everything you need and puts it in a box. An example of this is btcpay, and another one is LN store-in-a-box which is a collection of wordpress, lightning node, bitcoind and woocommerce plugin all in one so that you can put this on a server and setup and run it. So you go to lightninginabox.com and it has a bunch of software on it already.\n\n# Third-party proxies\n\nOne example is opennode. It's a semi-custodial thing that runs the node for you and you can proxy through them.\n\n# Infrastructure for liquidity providers\n\nSo what are the tools that help with liquidity providers? There's tools to help move money on and off the lightning network. Then there's rebalancers, where if you have a bunch of channels open and you want to move funds between them, there's a plugi nfor c-lightning called the rebalancer. And then finally there's some services you can do that you can go and get liquidity from. And then there's one called Thor, and someone wrote a form that will send you liquidity when you need it.\n\n# Future infrastructure\n\nI want to talk about some new projects in the pipeline and how they fit into these three categories.\n\n# Trampoline payments\n\nI think the trampoline payments proposal was sent out in late March or early April on the lightning-dev network. It was pierre and cdecker who came up with it. Instead of the client needing-- the consumer needing to know the exact route, instead they delegate some of the pathfinding responsibility to a larger liquidity provider and to help them get to the final destination.\n\n# Neutrino wallets\n\nThis is basically the latest version of SPV that is supposed to help make better mobile clients and do self-custody more effectively.\n\n# Dual-funded channels\n\nI have a proposal for dual-funded channels that helps with liquidity. So people will be able to start with more balanced channels. Right now when opening a LN channel, only one person can contribute funds.\n\n# Splicing\n\nSplicing is where you take loop-in and loop-out, which is what the Lightning Labs people did, and moving it into the spec so that anyone would be able to fund on and off chain on their own.\n\n# Liquidity advertisement\n\nNodes have liquidity and they will be able to advertise their liquidity so that if people needed it, they could find an easier way to go and get that liquidity.\n\n# Future stuff\n\nI've been running a niftynei twitch channel where I livestream my dual-funded channel work. If you want to see what it's like to work on c-lightning, check out my channel. It's on twitch.\n\n",
    "body_type": "markdown",
    "created_at": "2019-05-11T00:00:00.000Z",
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/magicalcryptoconference/2019/taxonomy-of-ln-nodes",
    "categories": [
        "conference"
    ],
    "tags": [
        "lightning",
        "c-lightning"
    ],
    "media": "https://youtu.be/A4i5cEI1jnc",
    "authors": [
        "Lisa Neigut"
    ],
    "indexed_at": "2024-03-21T16:33:36.813Z",
    "transcript_by": "Bryan Bishop",
    "summary": "In a recent exploration of the evolving landscape of the Lightning Network, Lisa Neigut from Blockstream delved into the intricate categorization of nodes operating within this complex ecosystem. With over 8,317 nodes identified, Neigut highlighted the division between public nodes, accessible for channel creation, and those that remain private, thus shaping the network's operational dynamics. This distinction is critical in understanding how different entities interact on the Lightning Network, which is further elaborated through the introduction of three primary categories: consumers, vendors, and liquidity providers.\n\nConsumers and vendors represent the two ends of the transaction spectrum, with consumers seeking to make payments and vendors looking to sell goods or services. Liquidity providers, however, play a pivotal role in ensuring the seamless flow of payments across the network by addressing directional liquidity challenges. The concept of payment directionality becomes essential in comprehending how transactions navigate through the network, dependent not just on the topology of channels but also on the distribution of funds within them.\n\nNeigut’s discussion extends into the realm of infrastructure, identifying tools and projects tailored to each category's unique needs. For consumers, autopilot functionalities and wallets simplify the process of connecting to the network and executing transactions without delving into the underlying technical complexities. These solutions prioritize ease of use, focusing on the end balance available for transactions. Similarly, node proxies offer an additional layer of accessibility, allowing users to manage payments through more user-friendly interfaces like desktop or mobile applications.\n\nOn the vendor side, the development of payment plugins and all-in-one solutions, such as the WooCommerce plugin for WordPress and LN store-in-a-box, demonstrates an initiative to streamline the acceptance of Lightning payments. These tools encapsulate the necessary components for vendors to effortlessly integrate Lightning payments into their operations. Furthermore, third-party proxies like opennode introduce semi-custodial services, offering vendors an alternative approach to handling Lightning transactions.\n\nLiquidity providers are supported by a suite of tools designed to facilitate the efficient management and movement of funds within the network. Among these, rebalancers stand out as a mechanism to optimize the distribution of funds across multiple channels, ensuring liquidity providers can effectively serve their crucial function. Additionally, initiatives like Thor present innovative solutions for acquiring liquidity on demand, signifying the ongoing evolution of support infrastructure for liquidity providers.\n\nLooking ahead, Neigut shared insights into emerging projects poised to redefine interactions within the Lightning Network. Trampoline payments emerge as a novel concept aimed at simplifying routing for consumers by leveraging larger liquidity providers for pathfinding assistance. The advent of Neutrino wallets promises enhancements in mobile client functionality and self-custody, while proposals for dual-funded channels and splicing seek to address foundational aspects of channel funding and liquidity management. Moreover, the prospect of liquidity advertisement suggests a future where nodes can more efficiently signal their capacity to provide liquidity, facilitating smoother transactions across the network.\n\nAs the Lightning Network continues to mature, Neigut's work on c-lightning and her engagement with the community through platforms like Twitch offer valuable glimpses into the ongoing development efforts. These endeavors not only contribute to the network's technical evolution but also foster a deeper understanding among participants, ultimately driving towards a more robust and accessible Lightning Network."
}