{
    "id": "bitcointranscripts+advancing-bitcoin+2020+2020-02-06-antoine-riard-taproot-lightning",
    "title": "A Schnorr-Taproot’ed Lightning",
    "body_formatted": "{\"type\":\"paragraph\",\"text\":\"Slides: https://www.dropbox.com/s/9vs54e9bqf317u0/Schnorr-Taproot%27ed-LN.pdf\"}, {\"type\":\"heading\",\"text\":\"Intro\"}, {\"type\":\"paragraph\",\"text\":\"Today Schnorr and Taproot for Lightning, it is a really exciting topic.\"}, {\"type\":\"heading\",\"text\":\"Lightning architecture\"}, {\"type\":\"paragraph\",\"text\":\"The Lightning architecture for those who are not familiar with it. You have the blockchain as the underlying layer. On top of it you are going to build a channel, you have a HTLC and people are going to spend onions to you. If you want to be paid you are going to send an invoice to the sender.\"}, {\"type\":\"heading\",\"text\":\"What should we design Lightning for?\"}, {\"type\":\"paragraph\",\"text\":\"What should we design Lightning for? When we are doing Lightning design spec, we are pouring a lot of brainpower into it and everyone has a different view of what Lightning should be. Should Lightning be a fast, payment transaction system? Should Lightning be optimized for microtransactions? Is Lightning really cool because you get instant finality of your transactions? Is privacy the reason we are doing Lightning? Lightning may have better privacy properties. When we are talking about privacy for Lightning it would be better to have the privacy of the base layer in mind. On the base layer you are going to broadcast transactions. There is an amount, it is not encrypted. There is an address, it is not encrypted. You are going to link inputs and outputs in the UTXO graph.\"}, {\"type\":\"heading\",\"text\":\"What’s the privacy on the base layer?\"}, {\"type\":\"paragraph\",\"text\":\"Privacy for the base layer is not that great that today. Lightning may be a way to solve privacy.\"}, {\"type\":\"heading\",\"text\":\"What’s the privacy on Lightning?\"}, {\"type\":\"paragraph\",\"text\":\"But on Lightning there is a payment path. Lightning nodes have pubkeys tied to them and that is an identity vector. With HTLCs you may reuse a hash, there are a lot of different privacy vectors. Privacy is I think really important if you want censorship resistant money.\"}, {\"type\":\"heading\",\"text\":\"Why should we focus on privacy?\"}, {\"type\":\"paragraph\",\"text\":\"“Cryptography rearranges power, it configures who can do what, from what” [The Moral Character of Cryptographic Work](https://web.cs.ucdavis.edu/~rogaway/papers/moral-fn.pdf) (Rogaway)\"}, {\"type\":\"paragraph\",\"text\":\"If you don’t have privacy I can bribe or blackmail you because I know how you are using this tech. That is a huge vector of attack. There is this awesome paper by Philip Rogaway. I encourage everyone to read it.\"}, {\"type\":\"heading\",\"text\":\"EC-Schnorr: efficient signature scheme\"}, {\"type\":\"paragraph\",\"text\":\"`Keypair = (x,P) with P= xG and ephemeral keypair (k,R) with R = kG`\"}, {\"type\":\"paragraph\",\"text\":\"`Message hash = e = hash(R | m) and Signature = (R,s) with s = k + ex`\"}, {\"type\":\"paragraph\",\"text\":\"`Verification = sG = R + eP`\"}, {\"type\":\"paragraph\",\"text\":\"You can see Schnorr and Taproot as a privacy boost. The reason to modify the consensus base layer which is a lot of work, there are a lot of people involved, there has to be a good motivation for doing this. Schnorr is a replacement for ECDSA. Originally Satoshi didn’t get Schnorr into Bitcoin because there were some patent issues. Schnorr is really awesome because there is linearity in the verification equation of Schnorr. Linearity means it is easy to sum up components. It is easy to sum up signatures, it is easy to sum up pubkeys and it is easy to sum up nonces between different parties.\"}, {\"type\":\"heading\",\"text\":\"Taproot: privacy preserving Script Tree\"}, {\"type\":\"paragraph\",\"text\":\"`Taproot pubkey: Q = P + tG with Q and P curve points`\"}, {\"type\":\"paragraph\",\"text\":\"`t is the root of a Merkle tree where each leaf is a hash of a script`\"}, {\"type\":\"paragraph\",\"text\":\"`Spending witness provides Merkle proof and script`\"}, {\"type\":\"paragraph\",\"text\":\"The other big new consensus upgrade proposal, nothing has yet been adopted by the network, Taproot is the idea of building a Merkle tree of every leaf of the Merkle tree is going to be a script. You are going to commit the root of the Merkle tree inside the pubkey. That is cool. Now when you are going to spend a Taproot output you have two options. The first option is to use a keypath spend. The other option is to reveal one of the scripts plus a Merkle proof. This Merkle proof lets the network verify that this script has been committed with the initial commitment of the scriptPubKey, the pubkey of the transaction spend.\"}, {\"type\":\"heading\",\"text\":\"New consensus properties\"}, {\"type\":\"paragraph\",\"text\":\"What are the new consensus properties of this upgrade? Linearity is the one we are going to use for this talk. With Taproot we have cheap complex scripts. Another advantage is under the Taproot assumption, if everyone agrees, you don’t have a disagreement, they can spend a Taproot output in a cooperative way so the script isn’t seen by any external observer.\"}, {\"type\":\"heading\",\"text\":\"More Schnorr-Taproot resources\"}, {\"type\":\"paragraph\",\"text\":\"There are BIP numbers for [Schnorr](https://github.com/bitcoin/bips/blob/master/bip-0340.mediawiki), [Taproot](https://github.com/bitcoin/bips/blob/master/bip-0341.mediawiki) and [Tapscript](https://github.com/bitcoin/bips/blob/master/bip-0342.mediawiki). I encourage you to read the BIPs. There are also more resources on AJ Town’s GitHub [repo](https://github.com/ajtowns/taproot-review).\"}, {\"type\":\"heading\",\"text\":\"Channel: “Plaintext” closing\"}, {\"type\":\"paragraph\",\"text\":\"`P2WSH output: 0 <32-byte-hash>`\"}, {\"type\":\"paragraph\",\"text\":\"`Witness script: 2 <pubkey1> <pubkey2> 2 OP_CHECKMULTISIG`\"}, {\"type\":\"paragraph\",\"text\":\"Right now you are going to broadcast a funding transaction onchain. This funding transaction is going to be a pay-to-witness-script-hash (P2WSH). When you close the channel every peer of the network is going to see that was a 2-of-2. By revealing the script you are going to leak that you were using Lightning. How can we solve this?\"}, {\"type\":\"heading\",\"text\":\"Schnorr Taproot -Channel: “Discreet” closing\"}, {\"type\":\"paragraph\",\"text\":\"`Taproot output: 1 <32-byte-pubkey>`\"}, {\"type\":\"paragraph\",\"text\":\"`Witness script: <MuSig-sig>`\"}, {\"type\":\"paragraph\",\"text\":\"We can embed the script in a Taproot output. This way if both parties agree to do a mutual closing you are not going to be able to disassociate this Lightning funding Taproot output from another Taproot output.\"}, {\"type\":\"heading\",\"text\":\"Channel: Worst-case closing\"}, {\"type\":\"paragraph\",\"text\":\"Going further, even if we disagree ideally we would like the channel to not be seen by any party. The blockchain cares about faithful execution of the contract but ideally you shouldn’t learn about the amounts because amounts are part of the contract.\"}, {\"type\":\"heading\",\"text\":\"Schnorr Taproot -Channel: Pooled Commitment\"}, {\"type\":\"paragraph\",\"text\":\"I think you can go further with this idea. You can encode the commitment transaction in its own Taptree and every Tapscript would be a HTLC. This Tapscript would spend to a 2nd stage transaction. This 2nd stage transaction would have two outputs. One output paying to the HTLC and the other one paying back to the Taptree minus the Tapscript spend. I think maybe SIGHASH_NOINPUT would be a better fit for this construction but there is a way to make the channel discreet. The blockchain shouldn’t learn about you doing some kind of offchain construction.\"}, {\"type\":\"heading\",\"text\":\"HTLC: Payment hash correlation\"}, {\"type\":\"paragraph\",\"text\":\"Every HTLC part of the payment path reuse the same Script hashlock ie\"}, {\"type\":\"paragraph\",\"text\":\"`OP_HASH160  <RIPEMD160(payment_hash)>  OP_EQUALVERIFY`\"}, {\"type\":\"paragraph\",\"text\":\"Going further right now we are using a payment hash. Any HTLC part of the payment path is reusing the same hash. If you are a Chainalysis company and you are running spy nodes on the network or you are running big processing nodes and these nodes are part of the same payment path they are going to be able to guess “graph nearness” of the sender and receiver. That is really bad because right now payment paths are quite short given the current topology. Ideally we would like to use a different hashlock for every hop.\"}, {\"type\":\"heading\",\"text\":\"Schnorr-Taproot: Point Time Locked Contract\"}, {\"type\":\"paragraph\",\"text\":\"`partial_sig = sG = R + H(P | R | m)P`\"}, {\"type\":\"paragraph\",\"text\":\"`adaptor_sig = s’G = T + R + H(P | R | m)P with the T the nonce tweak`\"}, {\"type\":\"paragraph\",\"text\":\"`secret t = adaptor_sig - partial_sig`\"}, {\"type\":\"paragraph\",\"text\":\"There is this cool idea of scriptless scripts by Andrew Poelstra who was speaking earlier today. With a scriptless script you are going to tweak the nonce pubkey with a secret. When one of the parties is ready to claim the secret she has to reveal it to unlock the output.\"}, {\"type\":\"heading\",\"text\":\"PTLC protocol: setup phase\"}, {\"type\":\"paragraph\",\"text\":\"(See diagram in slides)\"}, {\"type\":\"paragraph\",\"text\":\"The protocol works like this. You are going to build an aggregated pubkey of 2-of-2. One of the parties is going to submit a modified nonce pubkey. Alice is going to send a partial sig to Bob. Bob is going to send his partial sig… When Bob is ready to claim the output he has to reveal the secret. That is a way to atomically exchange funds against a secret. You can reuse this primitive to build a world like Lightning payment paths. PTLC, point timelocked contracts, should be the replacement for HTLC. There will be three phases. The first phase, setup, you send a curve point to every part of the payment path.\"}, {\"type\":\"heading\",\"text\":\"PTLC protocol: update phase\"}, {\"type\":\"paragraph\",\"text\":\"(See diagram in slides)\"}, {\"type\":\"paragraph\",\"text\":\"The second phase is the update phase. You are going to exchange \\tpartial sigs between every hop of the payment path.\"}, {\"type\":\"heading\",\"text\":\"PTLC protocol: settlement phase\"}, {\"type\":\"paragraph\",\"text\":\"(See diagram in slides)\"}, {\"type\":\"paragraph\",\"text\":\"The last phase is the settlement one. Dave is going to reveal the secret that lets Carol learn about her own secret which is going to let Bob learn about his own secret. Bob is going to claim the PTLC from Alice. Alice is going to learn the final secret. This final secret can be reused to solve other issues.\"}, {\"type\":\"heading\",\"text\":\"Invoices: proof-of-payment\"}, {\"type\":\"paragraph\",\"text\":\"Right now when you are going to succeed a payment on the network you are going to learn the preimage. The preimage can be used as a proof of payment. But it doesn’t tell you who is the original sender. Every hop of the payment path can claim in front of a judge “I was the guy who made the payment. I have the preimage.” If you are able to also submit the invoice you can’t associate between parts of the payment path.\"}, {\"type\":\"heading\",\"text\":\"Schnorr Taproot Invoices: proof-of-payer\"}, {\"type\":\"paragraph\",\"text\":\"Reusing the z value (zG has been signed by the receiver) of the PTLC protocol, you will be able to have this unique secret value. This unique secret value is only going to be learned by the original sender. This could be cool because you could use this to trigger a second stage contract or some kind of consumer protection escrow, something like this.\"}, {\"type\":\"heading\",\"text\":\"Onion-packet: simple payment or MPP\"}, {\"type\":\"paragraph\",\"text\":\"MPP has been presented by Joost. Right now MPP is cool to solve liquidity issues but it may be a weakness for privacy because you may be able to do payment paths intersection between the different MPP used if a spying node of part of all MPP payment paths. Ideally you want to use a different value for this payment path.\"}, {\"type\":\"heading\",\"text\":\"Schnorr Taproot onion packet: Discreet Log AMP\"}, {\"type\":\"paragraph\",\"text\":\"There is the idea of using the same cryptography trick of Schnorr linearity. Before to set the payment path Alice the sender will offset the curve point received from Dave, the last hop of the payment path, by her own secret. You are going to send shards of the secret through every onion part of the atomic multipayment path. Only when all of them are locked at the last hop, is it going to be possible to combine the shard secrets and claim the payment.\"}, {\"type\":\"heading\",\"text\":\"HTLC: stuck payments\"}, {\"type\":\"paragraph\",\"text\":\"There is another issue right now which is being discussed on the [mailing list](https://lists.linuxfoundation.org/pipermail/lightning-dev/2019-June/002029.html). You send a payment, one of the hops on the payment path is going to be offline or not available. To cancel the payment and wait to send another one you have to first wait until the HTLC timelock expires to get the funds back to the original sender. Ideally you want a way so that the sender can cancel the payment without waiting.\"}, {\"type\":\"heading\",\"text\":\"Schnorr Taproot HTLC: cancellable payments\"}, {\"type\":\"paragraph\",\"text\":\"You can do this again thanks to the PTLC construction. The last secret is only going to be revealed by Alice when Dave, the receiver of the funds, is going to acknowledge that he received every payment packet. If you do this this is really cool because it may allow you to build higher level protocols, some kind of forward error correction. The idea is you are going to send more packets than needed to fulfill the payment. Thanks to this it is going to better UX because if one of the packets fails you still have more packets to pay the payee.\"}, {\"type\":\"heading\",\"text\":\"HTLC: simple hash-time-locked-contract\"}, {\"type\":\"paragraph\",\"text\":\"The last thing that we can also build thanks to Schnorr… Right now HTLCs are pretty cool but they are pretty simple. There is only one timelock, there is only one hash. Maybe people are interested to have different hashes. One of the hashes is submitted by an escrow. It may be an arbiter in any contract. I am Alice, I am interested to get a shipment of some goods. I am funding a payment today but I never received my goods. You may be able to insert an escrow into your HTLC. By doing this it would mean every hop part of the payment path has to support the advanced HTLC. Worse it is going to learn the semantics of the contract.\"}, {\"type\":\"heading\",\"text\":\"Schnorr Taproot: end-to-end payment point contracts\"}, {\"type\":\"paragraph\",\"text\":\"What you can do is instead of this is have payment point constructions. The idea is you still use scriptless scripts but you add other primitives thanks to key aggregation or ECDH. You can also do DLCs which is just a curve point. We may be able to build a wider class of HTLC packets or conditional payment packets. I foresee in a few years people doing futures or options on top of Lightning. This class of payments is going to be confidential. Only the endpoints are going to learn about this.\"}, {\"type\":\"heading\",\"text\":\"Protocol-side, no silver bullet, a lot of tricks\"}, {\"type\":\"paragraph\",\"text\":\"Schnorr and Taproot, it is not a silver bullet. There are a lot of other leaks like when you are doing channel announcements on Lightning right now you are doxing yourself by linking a Lightning pubkey identity and onchain UTXO. In a few years people are going to wake up and say “This Lightning pubkey was linked to a domain name.” Then you will be able to link between a domain name and an onchain UTXO which is really bad. Even if we do PTLC for the payment path we still have issues with the CLTV delta which is the same on every hop. Also the amount stays the same minus the Lightning fees for every hop. Ideally we may want to implement further tricks like random CLTV delta routing algorithms or pad the payment path to always use 10 hops or 20 hops even if it is costlier. That may be better for privacy. Right now people are working on dual funded channels for Lightning. We may do Coinjoin for every funding transaction which would be really cool. Schnorr and Taproot are going to take more than one year to get integrated into Lightning. This will be only the start for building really consistent privacy for Lightning.\"}, {\"type\":\"heading\",\"text\":\"Application-side, building private first apps\"}, {\"type\":\"paragraph\",\"text\":\"Privacy is going to be the default for Lightning, I hope so. If you are going to build applications on top of this you should have this holistic approach and think “I have this Lightning protocol which provides me a lot of privacy. I will try to not break privacy for my application users.” You should think about integrating with Tor, identityless login or identityless tokens, that kind of stuff. I think that is a challenge for application developers building on top of Lightning but I think it is worth it. I am excited, Schnorr and Taproot have been proposed as BIPs and should be soft forked into the protocol if the community supports it. If you are interested to contribute to Lightning you are really welcome.\"}, {\"type\":\"heading\",\"text\":\"Thanks to Chaincode\"}, {\"type\":\"paragraph\",\"text\":\"Thanks to Chaincode for supporting this work. Thanks to Advancing Bitcoin.\"}, {\"type\":\"heading\",\"text\":\"Q&A\"}, {\"type\":\"paragraph\",\"text\":\"Q - How do you see Taproot being implemented in Lightning? Is it still Lightning?\"}, {\"type\":\"paragraph\",\"text\":\"A - There are multiple ways. First you can integrate Taproot for the funding output. Then you can use Taproot for the HTLC output part of the commitment transaction. You can also use Taproot for the output of the second stage HTLC transaction. There are at least multiple outputs that can be concerned with Lightning. I think the first is to fix the funding output because if you do this we will benefit from the Taproot assumption. Using Taproot for commitment transactions you are still going to leak that you are using Lightning. Maybe we could use the pool construction I was talking about but that is harder stuff. I would chase this one first.\"}, {\"type\":\"paragraph\",\"text\":\"Q - You said Lightning has privacy guarantees on its protocol but developers should make sure they don’t ruin the privacy guarantees on top of the base Lightning protocol. Do you see a tendency that applications are taking shortcuts on Lightning and ruining the privacy?\"}, {\"type\":\"paragraph\",\"text\":\"A - Yes. Right now there is this idea of [trampoline routing](https://diyhpl.us/wiki/transcripts/lightning-conference/2019/2019-10-20-bastien-teinturier-trampoline-routing/) which is maybe great for user experience but on the privacy side it is broken. What gives us a lot of privacy in Lightning is source routing. Going to trampoline routing means the person who does the trampoline routing for you is going to learn who you are if you are using one hop and worse is going to know who you are sending funds to. There is trampoline routing, if you are not using privacy preserving Lightning clients… Nobody has done a real privacy study on Lightning clients. Neutrino, bloom filters, no one has done real research. They are not great, there are privacy leaks if you are using them. There are Lightning privacy issues and there are base layer privacy issues. If you are building an application you should have all of them in mind. It is really hard. Using the node pubkey I don’t think is great. I would like [rendez-vous routing](https://lists.linuxfoundation.org/pipermail/lightning-dev/2018-November/001498.html) to be done on Lightning to avoid announcing my pubkey, having my invoice tied to my pubkey and my pubkey being part of Lightning. And channel announcement of course. I hope at some point we have some kind of proof of ownership so I can prove I own this channel without revealing which UTXO I own.\"}",
    "body": "Slides: https://www.dropbox.com/s/9vs54e9bqf317u0/Schnorr-Taproot%27ed-LN.pdf\n\n## Intro\n\nToday Schnorr and Taproot for Lightning, it is a really exciting topic.\n\n## Lightning architecture\n\nThe Lightning architecture for those who are not familiar with it. You have the blockchain as the underlying layer. On top of it you are going to build a channel, you have a HTLC and people are going to spend onions to you. If you want to be paid you are going to send an invoice to the sender.\n\n## What should we design Lightning for?\n\nWhat should we design Lightning for? When we are doing Lightning design spec, we are pouring a lot of brainpower into it and everyone has a different view of what Lightning should be. Should Lightning be a fast, payment transaction system? Should Lightning be optimized for microtransactions? Is Lightning really cool because you get instant finality of your transactions? Is privacy the reason we are doing Lightning? Lightning may have better privacy properties. When we are talking about privacy for Lightning it would be better to have the privacy of the base layer in mind. On the base layer you are going to broadcast transactions. There is an amount, it is not encrypted. There is an address, it is not encrypted. You are going to link inputs and outputs in the UTXO graph.\n\n## What’s the privacy on the base layer?\n\nPrivacy for the base layer is not that great that today. Lightning may be a way to solve privacy.\n\n## What’s the privacy on Lightning?\n\nBut on Lightning there is a payment path. Lightning nodes have pubkeys tied to them and that is an identity vector. With HTLCs you may reuse a hash, there are a lot of different privacy vectors. Privacy is I think really important if you want censorship resistant money.\n\n## Why should we focus on privacy?\n\n“Cryptography rearranges power, it configures who can do what, from what” [The Moral Character of Cryptographic Work](https://web.cs.ucdavis.edu/~rogaway/papers/moral-fn.pdf) (Rogaway)\n\nIf you don’t have privacy I can bribe or blackmail you because I know how you are using this tech. That is a huge vector of attack. There is this awesome paper by Philip Rogaway. I encourage everyone to read it.\n\n## EC-Schnorr: efficient signature scheme\n\n`Keypair = (x,P) with P= xG and ephemeral keypair (k,R) with R = kG`\n\n`Message hash = e = hash(R | m) and Signature = (R,s) with s = k + ex`\n\n`Verification = sG = R + eP`\n\nYou can see Schnorr and Taproot as a privacy boost. The reason to modify the consensus base layer which is a lot of work, there are a lot of people involved, there has to be a good motivation for doing this. Schnorr is a replacement for ECDSA. Originally Satoshi didn’t get Schnorr into Bitcoin because there were some patent issues. Schnorr is really awesome because there is linearity in the verification equation of Schnorr. Linearity means it is easy to sum up components. It is easy to sum up signatures, it is easy to sum up pubkeys and it is easy to sum up nonces between different parties.\n\n## Taproot: privacy preserving Script Tree\n\n`Taproot pubkey: Q = P + tG with Q and P curve points`\n\n`t is the root of a Merkle tree where each leaf is a hash of a script`\n\n`Spending witness provides Merkle proof and script`\n\nThe other big new consensus upgrade proposal, nothing has yet been adopted by the network, Taproot is the idea of building a Merkle tree of every leaf of the Merkle tree is going to be a script. You are going to commit the root of the Merkle tree inside the pubkey. That is cool. Now when you are going to spend a Taproot output you have two options. The first option is to use a keypath spend. The other option is to reveal one of the scripts plus a Merkle proof. This Merkle proof lets the network verify that this script has been committed with the initial commitment of the scriptPubKey, the pubkey of the transaction spend.\n\n## New consensus properties\n\nWhat are the new consensus properties of this upgrade? Linearity is the one we are going to use for this talk. With Taproot we have cheap complex scripts. Another advantage is under the Taproot assumption, if everyone agrees, you don’t have a disagreement, they can spend a Taproot output in a cooperative way so the script isn’t seen by any external observer.\n\n## More Schnorr-Taproot resources\n\nThere are BIP numbers for [Schnorr](https://github.com/bitcoin/bips/blob/master/bip-0340.mediawiki), [Taproot](https://github.com/bitcoin/bips/blob/master/bip-0341.mediawiki) and [Tapscript](https://github.com/bitcoin/bips/blob/master/bip-0342.mediawiki). I encourage you to read the BIPs. There are also more resources on AJ Town’s GitHub [repo](https://github.com/ajtowns/taproot-review).\n\n## Channel: “Plaintext” closing\n\n`P2WSH output: 0 <32-byte-hash>`\n\n`Witness script: 2 <pubkey1> <pubkey2> 2 OP_CHECKMULTISIG`\n\nRight now you are going to broadcast a funding transaction onchain. This funding transaction is going to be a pay-to-witness-script-hash (P2WSH). When you close the channel every peer of the network is going to see that was a 2-of-2. By revealing the script you are going to leak that you were using Lightning. How can we solve this?\n\n## Schnorr Taproot -Channel: “Discreet” closing\n\n`Taproot output: 1 <32-byte-pubkey>`\n\n`Witness script: <MuSig-sig>`\n\nWe can embed the script in a Taproot output. This way if both parties agree to do a mutual closing you are not going to be able to disassociate this Lightning funding Taproot output from another Taproot output.\n\n## Channel: Worst-case closing\n\nGoing further, even if we disagree ideally we would like the channel to not be seen by any party. The blockchain cares about faithful execution of the contract but ideally you shouldn’t learn about the amounts because amounts are part of the contract.\n\n## Schnorr Taproot -Channel: Pooled Commitment\n\nI think you can go further with this idea. You can encode the commitment transaction in its own Taptree and every Tapscript would be a HTLC. This Tapscript would spend to a 2nd stage transaction. This 2nd stage transaction would have two outputs. One output paying to the HTLC and the other one paying back to the Taptree minus the Tapscript spend. I think maybe SIGHASH_NOINPUT would be a better fit for this construction but there is a way to make the channel discreet. The blockchain shouldn’t learn about you doing some kind of offchain construction.\n\n## HTLC: Payment hash correlation\n\nEvery HTLC part of the payment path reuse the same Script hashlock ie\n\n`OP_HASH160  <RIPEMD160(payment_hash)>  OP_EQUALVERIFY`\n\nGoing further right now we are using a payment hash. Any HTLC part of the payment path is reusing the same hash. If you are a Chainalysis company and you are running spy nodes on the network or you are running big processing nodes and these nodes are part of the same payment path they are going to be able to guess “graph nearness” of the sender and receiver. That is really bad because right now payment paths are quite short given the current topology. Ideally we would like to use a different hashlock for every hop.\n\n## Schnorr-Taproot: Point Time Locked Contract\n\n`partial_sig = sG = R + H(P | R | m)P`\n\n`adaptor_sig = s’G = T + R + H(P | R | m)P with the T the nonce tweak`\n\n`secret t = adaptor_sig - partial_sig`\n\nThere is this cool idea of scriptless scripts by Andrew Poelstra who was speaking earlier today. With a scriptless script you are going to tweak the nonce pubkey with a secret. When one of the parties is ready to claim the secret she has to reveal it to unlock the output.\n\n## PTLC protocol: setup phase\n\n(See diagram in slides)\n\nThe protocol works like this. You are going to build an aggregated pubkey of 2-of-2. One of the parties is going to submit a modified nonce pubkey. Alice is going to send a partial sig to Bob. Bob is going to send his partial sig… When Bob is ready to claim the output he has to reveal the secret. That is a way to atomically exchange funds against a secret. You can reuse this primitive to build a world like Lightning payment paths. PTLC, point timelocked contracts, should be the replacement for HTLC. There will be three phases. The first phase, setup, you send a curve point to every part of the payment path.\n\n## PTLC protocol: update phase\n\n(See diagram in slides)\n\nThe second phase is the update phase. You are going to exchange \tpartial sigs between every hop of the payment path.\n\n## PTLC protocol: settlement phase\n\n(See diagram in slides)\n\nThe last phase is the settlement one. Dave is going to reveal the secret that lets Carol learn about her own secret which is going to let Bob learn about his own secret. Bob is going to claim the PTLC from Alice. Alice is going to learn the final secret. This final secret can be reused to solve other issues.\n\n## Invoices: proof-of-payment\n\nRight now when you are going to succeed a payment on the network you are going to learn the preimage. The preimage can be used as a proof of payment. But it doesn’t tell you who is the original sender. Every hop of the payment path can claim in front of a judge “I was the guy who made the payment. I have the preimage.” If you are able to also submit the invoice you can’t associate between parts of the payment path.\n\n## Schnorr Taproot Invoices: proof-of-payer\n\nReusing the z value (zG has been signed by the receiver) of the PTLC protocol, you will be able to have this unique secret value. This unique secret value is only going to be learned by the original sender. This could be cool because you could use this to trigger a second stage contract or some kind of consumer protection escrow, something like this.\n\n## Onion-packet: simple payment or MPP\n\nMPP has been presented by Joost. Right now MPP is cool to solve liquidity issues but it may be a weakness for privacy because you may be able to do payment paths intersection between the different MPP used if a spying node of part of all MPP payment paths. Ideally you want to use a different value for this payment path.\n\n## Schnorr Taproot onion packet: Discreet Log AMP\n\nThere is the idea of using the same cryptography trick of Schnorr linearity. Before to set the payment path Alice the sender will offset the curve point received from Dave, the last hop of the payment path, by her own secret. You are going to send shards of the secret through every onion part of the atomic multipayment path. Only when all of them are locked at the last hop, is it going to be possible to combine the shard secrets and claim the payment.\n\n## HTLC: stuck payments\n\nThere is another issue right now which is being discussed on the [mailing list](https://lists.linuxfoundation.org/pipermail/lightning-dev/2019-June/002029.html). You send a payment, one of the hops on the payment path is going to be offline or not available. To cancel the payment and wait to send another one you have to first wait until the HTLC timelock expires to get the funds back to the original sender. Ideally you want a way so that the sender can cancel the payment without waiting.\n\n## Schnorr Taproot HTLC: cancellable payments\n\nYou can do this again thanks to the PTLC construction. The last secret is only going to be revealed by Alice when Dave, the receiver of the funds, is going to acknowledge that he received every payment packet. If you do this this is really cool because it may allow you to build higher level protocols, some kind of forward error correction. The idea is you are going to send more packets than needed to fulfill the payment. Thanks to this it is going to better UX because if one of the packets fails you still have more packets to pay the payee.\n\n## HTLC: simple hash-time-locked-contract\n\nThe last thing that we can also build thanks to Schnorr… Right now HTLCs are pretty cool but they are pretty simple. There is only one timelock, there is only one hash. Maybe people are interested to have different hashes. One of the hashes is submitted by an escrow. It may be an arbiter in any contract. I am Alice, I am interested to get a shipment of some goods. I am funding a payment today but I never received my goods. You may be able to insert an escrow into your HTLC. By doing this it would mean every hop part of the payment path has to support the advanced HTLC. Worse it is going to learn the semantics of the contract.\n\n## Schnorr Taproot: end-to-end payment point contracts\n\nWhat you can do is instead of this is have payment point constructions. The idea is you still use scriptless scripts but you add other primitives thanks to key aggregation or ECDH. You can also do DLCs which is just a curve point. We may be able to build a wider class of HTLC packets or conditional payment packets. I foresee in a few years people doing futures or options on top of Lightning. This class of payments is going to be confidential. Only the endpoints are going to learn about this.\n\n## Protocol-side, no silver bullet, a lot of tricks\n\nSchnorr and Taproot, it is not a silver bullet. There are a lot of other leaks like when you are doing channel announcements on Lightning right now you are doxing yourself by linking a Lightning pubkey identity and onchain UTXO. In a few years people are going to wake up and say “This Lightning pubkey was linked to a domain name.” Then you will be able to link between a domain name and an onchain UTXO which is really bad. Even if we do PTLC for the payment path we still have issues with the CLTV delta which is the same on every hop. Also the amount stays the same minus the Lightning fees for every hop. Ideally we may want to implement further tricks like random CLTV delta routing algorithms or pad the payment path to always use 10 hops or 20 hops even if it is costlier. That may be better for privacy. Right now people are working on dual funded channels for Lightning. We may do Coinjoin for every funding transaction which would be really cool. Schnorr and Taproot are going to take more than one year to get integrated into Lightning. This will be only the start for building really consistent privacy for Lightning.\n\n## Application-side, building private first apps\n\nPrivacy is going to be the default for Lightning, I hope so. If you are going to build applications on top of this you should have this holistic approach and think “I have this Lightning protocol which provides me a lot of privacy. I will try to not break privacy for my application users.” You should think about integrating with Tor, identityless login or identityless tokens, that kind of stuff. I think that is a challenge for application developers building on top of Lightning but I think it is worth it. I am excited, Schnorr and Taproot have been proposed as BIPs and should be soft forked into the protocol if the community supports it. If you are interested to contribute to Lightning you are really welcome.\n\n## Thanks to Chaincode\n\nThanks to Chaincode for supporting this work. Thanks to Advancing Bitcoin.\n\n## Q&A\n\nQ - How do you see Taproot being implemented in Lightning? Is it still Lightning?\n\nA - There are multiple ways. First you can integrate Taproot for the funding output. Then you can use Taproot for the HTLC output part of the commitment transaction. You can also use Taproot for the output of the second stage HTLC transaction. There are at least multiple outputs that can be concerned with Lightning. I think the first is to fix the funding output because if you do this we will benefit from the Taproot assumption. Using Taproot for commitment transactions you are still going to leak that you are using Lightning. Maybe we could use the pool construction I was talking about but that is harder stuff. I would chase this one first.\n\nQ - You said Lightning has privacy guarantees on its protocol but developers should make sure they don’t ruin the privacy guarantees on top of the base Lightning protocol. Do you see a tendency that applications are taking shortcuts on Lightning and ruining the privacy?\n\nA - Yes. Right now there is this idea of [trampoline routing](https://diyhpl.us/wiki/transcripts/lightning-conference/2019/2019-10-20-bastien-teinturier-trampoline-routing/) which is maybe great for user experience but on the privacy side it is broken. What gives us a lot of privacy in Lightning is source routing. Going to trampoline routing means the person who does the trampoline routing for you is going to learn who you are if you are using one hop and worse is going to know who you are sending funds to. There is trampoline routing, if you are not using privacy preserving Lightning clients… Nobody has done a real privacy study on Lightning clients. Neutrino, bloom filters, no one has done real research. They are not great, there are privacy leaks if you are using them. There are Lightning privacy issues and there are base layer privacy issues. If you are building an application you should have all of them in mind. It is really hard. Using the node pubkey I don’t think is great. I would like [rendez-vous routing](https://lists.linuxfoundation.org/pipermail/lightning-dev/2018-November/001498.html) to be done on Lightning to avoid announcing my pubkey, having my invoice tied to my pubkey and my pubkey being part of Lightning. And channel announcement of course. I hope at some point we have some kind of proof of ownership so I can prove I own this channel without revealing which UTXO I own.\n\n\n",
    "body_type": "markdown",
    "created_at": "2020-02-06T00:00:00.000Z",
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/advancing-bitcoin/2020/2020-02-06-antoine-riard-taproot-lightning",
    "categories": [
        "conference"
    ],
    "tags": [
        "taproot",
        "lightning",
        "ptlc"
    ],
    "media": "https://www.advancingbitcoin.com/video/a-schnorr-taprooted-lightning,11/",
    "authors": [
        "Antoine Riard"
    ],
    "indexed_at": "2024-03-21T16:33:35.855Z",
    "transcript_by": "Michael Folkson",
    "summary": "In an insightful discourse on the intersection of privacy and efficiency within Bitcoin's Lightning Network, Antoine Riard highlights the transformative potential of Schnorr signatures and Taproot upgrades. These cryptographic advancements promise to address inherent privacy concerns and transactional inefficiencies plaguing the current state of the Lightning Network, a layer operating atop the blockchain to facilitate rapid, scalable transactions. With a focus on the architectural nuances of this system, Riard articulates its significance in overcoming blockchain's limitations through off-chain channels, while emphasizing privacy as a central theme deserving attention.\n\nRiard’s discussion is deeply rooted in the premise that privacy is not merely an optional feature but a fundamental requirement for a censorship-resistant monetary system. Drawing from Philip Rogaway's work, he argues that robust privacy measures are essential to prevent coercion and surveillance, thereby redistributing power in digital spaces. This perspective sets the stage for considering Schnorr signatures and Taproot as critical enhancements for the Lightning Network, offering a pathway to more private, efficient, and secure transactions.\n\nSchnorr signatures, with their linearity, allow for the aggregation of multiple signatures into one, streamlining multi-party transactions significantly. Taproot complements this by enabling transactions to occur without disclosing all potential spending conditions, thanks to a Merkle tree of conditions embedded within a single public key. These technologies collectively aim to refine the closing processes of Lightning channels, making them discreet and, under cooperative conditions, indistinguishable from regular transactions. Moreover, pooled commitments via Taproot could further bolster privacy and efficiency during channel closures.\n\nThe conversation also ventures into the domain of Hash Time-Locked Contracts (HTLCs), pinpointing their limitations in preserving payment path privacy. Riard introduces Point Time Locked Contracts (PTLCs) as a superior alternative that leverages scriptless scripts for executing contracts based on secret revelations rather than explicit scripts, enhancing privacy across payment paths. This advancement, along with the potential for proving payments in a manner that verifies the payer and not just the payment, indicates a significant leap towards more nuanced privacy controls within the network.\n\nDespite these promising developments, Riard acknowledges existing challenges and the complexity of fully integrating Schnorr and Taproot into the Lightning Network. He notes ongoing issues like doxing risks through channel announcements and suggests innovative solutions such as random CLTV delta routing algorithms to improve privacy. The discourse extends to practical applications, where Riard urges developers to prioritize privacy by default, leveraging features like Tor integration to preserve user anonymity at the application level.\n\nConcluding his presentation, Riard expresses appreciation for the community's efforts in advancing Bitcoin's technological frontier and encourages further participation and research. His subsequent engagement in a Q&A session sheds light on implementation challenges and reaffirms the necessity of continuous innovation to achieve the delicate balance between usability, security, and privacy within the Lightning Network. Through this comprehensive analysis, Riard elucidates the critical role of Schnorr and Taproot in catalyzing the evolution of Bitcoin's transactional infrastructure, marking a pivotal step towards realizing a truly private, efficient, and scalable payment system."
}