{
    "id": "bitcointranscripts+bitcoin-explained+taproot-activation-update",
    "title": "Taproot Activation Update: Speedy Trial And The LOT=True Client",
    "body_formatted": "{\"type\":\"paragraph\",\"text\":\"Previous episode on lockinontimeout (LOT): <https://btctranscripts.com/bitcoin-magazine/2021-02-26-taproot-activation-lockinontimeout/>\"}, {\"type\":\"paragraph\",\"text\":\"Previous episode on Speedy Trial: <https://btctranscripts.com/bitcoin-magazine/2021-03-12-taproot-activation-speedy-trial/>\"}, {\"type\":\"paragraph\",\"text\":\"Aaron van Wirdum on “There are now two Taproot activation clients, here’s why”: <https://bitcoinmagazine.com/technical/there-are-now-two-taproot-activation-clients-heres-why>\"}, {\"type\":\"heading\",\"text\":\"Intro\"}, {\"type\":\"paragraph\",\"text\":\"Aaron van Wirdum (AvW): Live from Utrecht this is the van Wirdum Sjorsnado.\"}, {\"type\":\"paragraph\",\"text\":\"Sjors Provoost (SP): Hello\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Sjors, today we have a “lot” more to discuss.\"}, {\"type\":\"paragraph\",\"text\":\"SP: We’ve already made this pun.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: We’ve already made it twice I think. It doesn’t matter. We are going to discuss the final implementation details of Speedy Trial today. We have already covered Speedy Trial in a previous [episode](https://btctranscripts.com/bitcoin-magazine/2021-03-12-taproot-activation-speedy-trial/). This time we are also going to contrast it to the LOT=true client which is an alternative that has been released by a couple of community members. We are going to discuss how they compare.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That sounds like a good idea. We also talked about Taproot activation options in general in a much earlier episode.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: One of the first ones?\"}, {\"type\":\"paragraph\",\"text\":\"SP: We also talked about this idea of this cowboy mentality where somebody would eventually release a LOT=true client whatever you do.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That is where we are.\"}, {\"type\":\"paragraph\",\"text\":\"SP: We also predicted correctly that there would be a lot of bikeshedding.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Yes, this is also something we will get into. First of all as a very brief recap, we are talking about Taproot activation. Taproot is a proposed protocol upgrade for compact and potentially privacy preserving smart contracts on the Bitcoin protocol. Is that a good summary?\"}, {\"type\":\"paragraph\",\"text\":\"SP: Yeah I think so.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: The discussion on how to upgrade has been going on for a while now. The challenge is that on a decentralized open network like Bitcoin without a central dictator to tell everyone what to run when, you are not going to get everyone to upgrade at the same time. But we do want to keep the network in consensus somehow or other.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Yeah. The other thing that can work when it is a distributed system is some sort of conventions, ways that you are used to doing things. But unfortunately the convention we had ran into problems with the SegWit deployment. Then the question is “Should we try something else or was it just a freak accident and we should try the same thing again?”\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I think the last preface before we really start getting into Speedy Trial, I’d like to point out the general idea with a soft fork, a backwards compatible upgrade which Taproot is, is that if a majority of hash power is enforcing the new rules that means that the network will stay in consensus.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Yeah. We can repeat that if you keep making transactions that are pre-Taproot then those transactions are still valid. In that sense, as a user you can ignore soft forks. Unfortunately if there is a problem you cannot ignore that as a user even if your transactions don’t use Taproot.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I think everyone agrees that it is very nice if a majority of hash power enforces the rules. There are coordination mechanisms to measure how many miners are on board with an upgrade. That is how you can coordinate a fairly safe soft fork. That is something everyone agrees on. Where people start to disagree on what happens if miners don’t actually cooperate with this coordination. We are not going to rehash all of that. There are previous episodes about that. What we are going to explain is that in the end the Bitcoin Core development community settled on a solution called “Speedy Trial.” We already mentioned that as well in a previous episode. Now it is finalized and we are going to explain what the finalized parameters are for this.\"}, {\"type\":\"paragraph\",\"text\":\"SP: There was a slight change.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Let’s hear it Sjors. What are the finalized parameters for Speedy Trial? How is Bitcoin Core going to upgrade to Taproot?\"}, {\"type\":\"heading\",\"text\":\"Bitcoin Core finalized activation parameters\"}, {\"type\":\"paragraph\",\"text\":\"Bitcoin Core 0.21.1 release notes: <https://github.com/bitcoin/bitcoin/blob/0.21/doc/release-notes.md>\"}, {\"type\":\"paragraph\",\"text\":\"Speedy Trial activation parameters merged into Core: <https://github.com/bitcoin/bitcoin/pull/21686>\"}, {\"type\":\"paragraph\",\"text\":\"SP: Starting on I think it is this Sunday (April 25th, midnight) the first time the difficult readjusts, that happens every two weeks, probably one week after Sunday…\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It is Saturday\"}, {\"type\":\"paragraph\",\"text\":\"SP:… the signaling starts. In about two weeks the signaling starts, no earlier than one week from now.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Just to be clear, that’s the earliest it can start.\"}, {\"type\":\"paragraph\",\"text\":\"SP: The earliest it can start is April 24th but because it only starts at a new difficulty adjustment period, a new retargeting period, it probably won’t start until two weeks from now.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It will start at the first new difficulty period after April 24th which is estimated I think somewhere early May. May 4th, may the fourth be with you Sjors.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That would be a cool date. That is when the signaling starts and the signaling happens in you could say voting rounds. A voting round is two weeks or one difficulty adjustment period, one retargeting period. If 90 percent of the blocks in that voting period signal on bit number 2, if that happens Taproot is locked in. Locked in means that it is going to happen, imagine the little gif with Ron Paul, “It’s happening.” But the actual Taproot rules won’t take effect immediately, they will take effect at block number 709632.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Which is estimated to be mined when?\"}, {\"type\":\"paragraph\",\"text\":\"SP: That will be November 12th this year.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That is going to differ a bit of course based on how fast blocks are going to be mined over the coming months. It is going to be November almost certainly.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Which would be 4 years after the SegWit2x effort imploded.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Right, nice timing in that sense.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Every date is nice. That’s what the Speedy Trial does. Every two weeks there is a vote, if 90 percent of the vote is reached then that’s the activation date. It doesn’t happen immediately and because it is a “Speedy” Trial it could also fail quickly and that is in August, around August 11th. If the difficulty period after that or before that, I always forget, doesn’t reach the goal, I think it is after…\"}, {\"type\":\"paragraph\",\"text\":\"AvW: The difficulty period must have ended by August 11th right?\"}, {\"type\":\"paragraph\",\"text\":\"SP: When August 11th is passed it could still activate but then the next difficulty period, it cannot. I think the rule is at the end of the difficulty period you start counting and if the result is a failure then if it is after August 11th you give up but if it is not yet August 11th you enter the next round.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: If the first block of a new difficulty period is mined on August 10th will that difficulty period still count?\"}, {\"type\":\"paragraph\",\"text\":\"SP: That’s right. I think that’s one of the subtle changes made to BIP 9 to make BIP 9 easier to reason about. I think it used to be the other way around where you first check the date but if it was past the date you would give up but if it was before the date you would still count. Now I think it is the other way round, it is a bit simpler.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I see. There is going to be a signaling window of about 3 months.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That’s right.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: If in any difficulty period within that signaling window of 3 months 90 percent of hash power is reached Taproot will activate in November of this year.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Yes\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I think that covers Speedy Trial.\"}, {\"type\":\"paragraph\",\"text\":\"SP: The threshold is 90 percent as we said. Normally with BIP 9 it is 95 percent, it has been lowered to 90.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: What happens if the threshold is not met?\"}, {\"type\":\"paragraph\",\"text\":\"SP: Nothing. Which means anything could still happen. People could deploy new versions of software, try another bit etc\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I just wanted to clarify that.\"}, {\"type\":\"paragraph\",\"text\":\"SP: It does not mean that Taproot is cancelled.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: If the threshold isn’t met then this specific software client will just do nothing but Bitcoin Core developers and the rest of the Bitcoin community can still figure out new ways to activate Taproot.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Exactly. It is a low cost experiment. If it wins we get Taproot. If not then we have some more information as to why we don’t…\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I also want to clarify. We don’t know what it is going to look like yet. That will have to be figured out then. We could start figuring it out now but that hasn’t been decided yet, what the deployment would look like.\"}, {\"type\":\"heading\",\"text\":\"Alternative to Bitcoin Core (Bitcoin Core 0.21.0-based Taproot Client)\"}, {\"type\":\"paragraph\",\"text\":\"Update on Taproot activation releases: <https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2021-April/018790.html>\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Another client was also launched. There is a lot of debate on the name. We are going to call it the LOT=true client.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That sounds good to me.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It derives from this technical and philosophical difference about how soft forks should be activated in the first place. This client uses, you guessed it, LOT=true. LOT=true means that if the signaling window is over, by the end of the signaling window nodes will start to reject any blocks that don’t signal. They only accept blocks that signal. That is the main difference. Let’s get into the specifics of the LOT=true client.\"}, {\"type\":\"paragraph\",\"text\":\"SP: In the beginning it is the same, in principle it is the same. There is a theoretical possibility that it is not if miners do something really crazy. It starts at a certain block height…\"}, {\"type\":\"paragraph\",\"text\":\"AvW: We just mentioned that Bitcoin Core 0.21.1 starts its signaling window on the first difficulty period after April 24th. This LOT=true client will also in practice start its signaling window on the first difficulty period after April 24th except that April 24th isn’t specified specifically. They just picked the specific block height that is expected to be the first one after April 24th.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Exactly, they picked block 681,408.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It is specified as a block height instead of indirectly through using a date.\"}, {\"type\":\"paragraph\",\"text\":\"SP: But in all likelihood that is going to be the exact same moment. Both Speedy Trial (Core) and the LOT=true client will start the signaling, the voting periods at the same time. The voting periods themselves, they vote on the same bit. They both vote on bit 2. They both have a threshold of 90 percent. Also if the vote is true then it also has a delayed activation. The delayed activation is a block height in both scenarios in both the Speedy Trial (Core) and the LOT=true variant.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Botha are November 12th, a November activation anyway. If miners signal readiness for Taproot within the Speedy Trial period both of these clients will activate Taproot in November on that exact same date, exact same block.\"}, {\"type\":\"paragraph\",\"text\":\"SP: So in that sense they are identical. But they are also different.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Let’s get into the first big difference. We already mentioned one difference which is the very subtle difference between starting it at height, the thing we just mentioned. Let’s get into a bigger difference.\"}, {\"type\":\"paragraph\",\"text\":\"SP: There is also a height for a timeout in this LOT=true and that is also a block. But not only is that a block, that could be a slight difference especially when it is a long time period. At the beginning if you use block height or time, date you can guess very accurately but if it is a year ahead then you can’t. But this is almost two years ahead, this block height (762048, approximately November 10th 2022) that they have in there. It goes on much longer.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Two years from now you mean, well one and a half.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Exactly. In that sense it doesn’t really matter that they are using height because it is such a big difference anyway. But this is important. They will keep signaling much longer than the Speedy Trial. We can get into the implications later but basically they will signal much later.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Let’s stick to the facts first and the implications later. Speedy Trial (Bitcoin Core), it will last for 3 months. And this one, the LOT=true client will allow signaling for 18 months.\"}, {\"type\":\"paragraph\",\"text\":\"SP: The other big difference is that at the end of that 18 months, where the Speedy Trial will simply give up and continue, the LOT=true will wait for miners who do signal. This could be nobody or could be everybody.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: They will only accept signaling blocks after these 18 months. For those who are aware of the whole block size war, it is a little bit like the BIP 148 client.\"}, {\"type\":\"paragraph\",\"text\":\"SP: It is pretty much the same with slightly better tolerance. The UASF client required every single block to signal whereas this one requires 90 percent to signal. In practice if you are the miners at the last 10 percent of that window you need to pay a bit more attention. Other than that it is the same.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That is why some people would call this the UASF client. The BIP 148 client was the UASF client for SegWit, this is the UASF client for Taproot. I know that for example Luke Dashjr has been contributing to this client doesn’t like the term UASF in this context because there is 18 months of regular miner signaling.\"}, {\"type\":\"paragraph\",\"text\":\"SP: So did the UASF. It is a bit more patient than the UASF.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: There is a lot of discussion on the name of the client and what people should call it or not call it. In general some people have been calling it the UASF client and this is why.\"}, {\"type\":\"paragraph\",\"text\":\"SP: You could call it the “Slow UASF” or something.\"}, {\"type\":\"heading\",\"text\":\"Implications of having two alternative clients\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I have also seen the name User Enforced Miner Activated Soft Fork (UEMASF). People are coming up with names. The basic facts are clear now I hope. Let’s get into the implications. There are some potential incompatibilities between these two activation clients. Everyone agrees that Taproot is great. Everyone wants Taproot. Everyone agrees that it would be preferable if miners activate it. The only thing where there is some disagreement on is what’s the backup plan. That is where the incompatibilities come in. Do you agree?\"}, {\"type\":\"paragraph\",\"text\":\"SP: I think so.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: What are the incompatibilities? First of all and I already mentioned this, to emphasize this, if Speedy Trial activates Taproot there are no incompatibilities. Both clients are happily using Taproot starting in November. This seems pretty likely because 90 percent of mining pools have already indicated that they support Taproot. Likely there is no big deal here, everything will turn out fine. If Speedy Trial doesn’t succeed in activating Taproot that is where we enter a phase where we are going to start to look at potential incompatibilities.\"}, {\"type\":\"paragraph\",\"text\":\"SP: For sure. Imagine one scenario where Speedy Trial fails. Probably Bitcoin Core people will think about that for a while and think about some other possibilities. For some reason miners get wildly enthusiastic right after Speedy Trial fails and start signaling at 90 percent. As far as Bitcoin Core is concerned Taproot never activated. As far as the UASF or LOT=true client Taproot did just activate.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Let’s say in month 4, we have 3 months of Speedy Trial and then in month 4 miners suddenly signal readiness for Taproot. Bitcoin Core doesn’t care anymore, Bitcoin Core 0.21.1 isn’t looking at the signaling anymore. But this LOT=true client is. On the LOT=true client Taproot will be activated in November while on this Bitcoin Core client it will not.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Then of course if you are using that LOT=true client and you start immediately using Taproot at that moment because you are very excited, you see all these blocks coming in, you may or may not lose your money. Anybody who is running the regular Bitcoin Core client will accept those thefts from Taproot addresses essentially.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: In this case it matters what miners are doing as well. If miners signal readiness because they are actually ready and they are actually going to enforce Taproot then it is fine. There is no issue because they will enforce the soft fork and even Bitcoin Core 0.21.1 nodes will follow this chain. The LOT=true client will enforce and everybody is happy on the same chain. The only scenario where this is a problem, what you just described, is if miners do signal readiness but they aren’t actually going to enforce the Taproot rules.\"}, {\"type\":\"paragraph\",\"text\":\"SP: The problem is of course in general with soft forks, but especially if everyone is not on exactly the same page about what the rules are, you only know that it is enforced when it is actually enforced. You don’t know if it is going to be enforced in the future. This will create a conundrum for everybody else because then the question is what to do? One thing you could do at that point is say “Obviously Taproot is activated so let’s just release a new version of Bitcoin Core that just says retroactively it activated.” It could just be a BIP 9 soft fork repeating the same bit but slightly later or it could just say “We know it activated. We will just hardcode the flag date.”\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It could just be a second Speedy Trial. Everything would work in that case?\"}, {\"type\":\"paragraph\",\"text\":\"SP: There is a problem with reusing the same bit number within a short period of time. (Note: AJ Towns stated on IRC that this would only be a problem if multiple soft forks were being deployed in parallel.) Because it would be exactly the week after in the scenario we talked about it may not be possible to use the same bit. Then you will have a problem because you can’t actually check that specific bit but there’s no signal on any of the other bits. That would create a bit of a headache. The other solution would be very simple, to say it apparently activated so we will just hardcode the block date and activate it then. The problem is what if between the time that the community decides “Let’s do this” and the moment that software is released and somewhat widely deployed one or more miners say “Actually we are going to start stealing these Taproot coins.” You get a massive clusterf\\\\*\\\\*\\\\* in terms of agreeing on the chain. Now miners will not be incentivized to do this because why would you deliberately create complete chaos if you just signaled for a soft fork? But it is a very scary situation and it might make it scary to make the release. If you do make the release but miners start playing these shenanigans what do you do then? Do you accept a huge re-org at some point? Or do you give up and consider it not deployed? But then people lose their money and you’ve released a client that you now have to hard fork from technically. It is not a good scenario.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It gets complicated in scenarios like this, also with game theory and economics. Even if miners would choose to steal they risk stealing coins on a chain that could be re-orged. They have just mined a chain that could be re-orged if other miners do enforce these Taproot rules. It gets weird, it is a discussion about economic incentives and game theory in that scenario. Personally I think it is pretty unlikely that something like this would happen but it is at least technically possible and it is something to be aware of.\"}, {\"type\":\"paragraph\",\"text\":\"SP: It does make you wonder whether as a miner it is smart to signal immediately after this Speedy Trial. This LOT=true client allows for two years anyway. If the only reason you are signaling is because this client exists then I would strongly suggest not doing it immediately after the Speedy Trial. Maybe wait a little bit until there is some consensus about what to do next.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: One thing you mentioned and I want to quickly address that, this risk always exists for any soft fork. Miners can always false signal, they could have done it with SegWit for example, false signal and then steal coins from SegWit outputs. Old nodes wouldn’t notice the difference. That is always a risk. I think the difference here is that Bitcoin Core 0.21.1 users in this scenario might think they are running a new node, from their perspective they are running an updated node. They are running the same risks as previously only outdated nodes would run.\"}, {\"type\":\"paragraph\",\"text\":\"SP: I would be mostly worried about the potential 0.21.2 users who are installing the successor to Speedy Trial which retroactively activates Taproot perhaps. That group is very uncertain of what the rules are.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Which group is this?\"}, {\"type\":\"paragraph\",\"text\":\"SP: If the Speedy Trial fails and then it is signaled, there might be a new release and people would install that new release, but then it is not clear whether that new release would be safe or not. That very new release would be the only one that would actually think that Taproot is active, as well as the LOT=true client. But now we don’t know what the miners are running and we don’t know what the exchanges are running because this is very new. This would be done in a period of weeks. Right now we have a 6 month… I guess the activation date would still be November.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It would still be November so there is still room to prepare in that case.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Ok, then I guess what I said before is nonsense. The easier solution would be to do a flag date where the new release would say “It is going to activate on November 12th or whatever that block height is without any signaling.” Signaling exists but people have different interpretations about it. That could be a way.\"}, {\"type\":\"heading\",\"text\":\"Recap\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I am still completely clear about what we are talking about it here but I am not sure if our listeners are catching up at this point. Shall we recap? If miners activate during the Speedy Trial then everything is fine, everyone is in consensus.\"}, {\"type\":\"paragraph\",\"text\":\"SP: And the new rules take effect in November.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: If miners activate after the Speedy Trial period then there is a possibility that the LOT=true client and the Bitcoin Core 0.21.1 client won’t be in consensus if an invalid Taproot block is ever mined.\"}, {\"type\":\"paragraph\",\"text\":\"SP: They have no forced signaling, you’re right. If an invalid Taproot transaction shows up after November 12th….\"}, {\"type\":\"paragraph\",\"text\":\"AvW:…. and if that is mined and enforced by a majority of miners, a majority of miners must have false signaled, then the two clients can get out of consensus. Technically this is true, I personally think it is fairly unlikely. I am not too concerned about this but it is at least technically true and something people should be aware of.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That scenario could be prevented by saying “If we see this “false” signaling, if we see this massive signaling a week after the Speedy Trial then you could decide to release a flag date client which just says we are going to activate this November 12th because apparently the miners want this. Otherwise we have no idea what to make of this signal.”\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I find it very hard to predict what Bitcoin Core developers in this case are going to decide.\"}, {\"type\":\"paragraph\",\"text\":\"SP: I agree but this is one possibility.\"}, {\"type\":\"heading\",\"text\":\"A likelier way that the two clients could be incompatible?\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That was one way the two clients can become incompatible potentially. There is another way which is maybe more likely or at least it is not as complicated.\"}, {\"type\":\"paragraph\",\"text\":\"SP: The other one is “Let’s imagine that the Speedy Trial fails and the community does not have consensus over how to proceed next.” Bitcoin Core developers can see that, there is ongoing discussion and nobody agrees. Maybe Bitcoin Core developers decide to wait and see.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Miners aren’t signaling…\"}, {\"type\":\"paragraph\",\"text\":\"SP: Or erratically etc. Miners aren’t signaling. The discussion still goes on. Nothing happens. Then this LOT=true mechanism kicks in…\"}, {\"type\":\"paragraph\",\"text\":\"AvW: After 18 months. We are talking about November 2022, it is a long way off but at some point the LOT=true mechanism will kick in.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Exactly. Those nodes will then, assuming that the miners are still not signaling, they will stop…\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That is if there are literally no LOT=true signaling blocks.\"}, {\"type\":\"paragraph\",\"text\":\"SP: In the other scenario where miners do massively start signaling, now we are back to that previous scenario where suddenly there is a lot of miner signaling on bit 2. Maybe the soft fork is active but now there is no delay. If the signaling happens anywhere after November 12th the LOT=true client will activate Taproot after one adjustment period.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I am not sure I am following you.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Let’s say in this case in December of this year the miners suddenly start signaling. After the minimum activation height. In December they all start signaling. The Bitcoin Core client will ignore it but the LOT=true client will say “Ok Taproot is active.”\"}, {\"type\":\"paragraph\",\"text\":\"AvW: This is the same scenario we just discussed? There is only a problem if there is a false signaling. Otherwise it is fine.\"}, {\"type\":\"paragraph\",\"text\":\"SP: There is a problem if there is false signaling but it is more complicated to resolve this one because that option of just releasing a new client with a flag day in it that is far enough into the future, that is not longer there. It is potentially active immediately. If you do a release but then suddenly a miner starts not enforcing the rules you get this confusion that we talked about earlier. Then we are able to solve it by just making a flag date. This would be even messier. Maybe it is also even less likely.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It is pretty similar to the previous scenario but a little more difficult, less obvious how to solve this.\"}, {\"type\":\"paragraph\",\"text\":\"SP: I think it is messier because it is less obvious how you would do a flag day release in Bitcoin Core in that scenario because it immediately activates.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That is not where I wanted to go with this.\"}, {\"type\":\"paragraph\",\"text\":\"SP: You wanted to go for some scenario where miners wait all the way to the end until they start signaling?\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Yes that is where I wanted to go.\"}, {\"type\":\"paragraph\",\"text\":\"SP: This is where the mandatory signaling kicks in. If there is no mandatory signaling then the LOT=true nodes will stop until somebody mines a block that they’d like to see, a block that signals. If they do see this block that signals we are back in the previous example where suddenly the regular Bitcoin Core nodes see this signaling but they ignore it. Now there is a group of nodes that believe that Taproot is active and there is a group of nodes that don’t. Somebody then has to decide what to do with it.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: You are still talking about false signaling here?\"}, {\"type\":\"paragraph\",\"text\":\"SP: Even if the signaling is genuine you still want there to be a Bitcoin Core release, probably, that actually says “We have Taproot now.” But the question is when do we have Taproot according to that release? What is a safe date to put in there? You could do it retroactively.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Whenever they want. The point is if miners are actually enforcing the new rules then the chain will stay together. It is up to Bitcoin Core to implement whenever they feel like it.\"}, {\"type\":\"paragraph\",\"text\":\"SP: The problem with this signaling is you don’t know if it is active until somebody decides to try to break the rules.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: My assumption was that there wasn’t false signaling. They’ll just create the longest chain with the valid rules anyway.\"}, {\"type\":\"paragraph\",\"text\":\"SP: The problem with that is that it is unknowable.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: The scenario I really wanted to get to Sjors is the very simple scenario where the majority of miners doesn’t signal when the 18 months are up. In that case they are going to create the longest chain that the Bitcoin Core 0.21.1 nodes are going to follow while the LOT=true nodes are only going to accept blocks that do signal which maybe zero or at least fewer. If it is a majority then there is no split. But if it is not a majority then we have a split.\"}, {\"type\":\"paragraph\",\"text\":\"SP: And that chain would get further and further behind. The incentive to make a release to account for that would be quite small I think. It depends, this is where your game theory comes in. From a safety point of view, if you now make a release that says “By the way we retroactively consider Taproot active” that would cause a giant re-org. If you just activate it that wouldn’t cause a giant re-org. But if you say “By the way we are going to retroactively mandate that signaling that you guys care about” that would cause a massive re-org. This would be unsafe, that would not be something that would be released probably. That is a very messy situation.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: There are messy potential scenarios. I want to emphasize to our dear listeners, none of this is going to happen in the next couple of months.\"}, {\"type\":\"paragraph\",\"text\":\"SP: And hopefully never. We will throw in a few other bad scenarios and then I guess we can go onto some other topics.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I want to mention real quick is the reason I’m not too concerned about these really bad scenarios playing out is because I think if it seems even slightly likely that there might be a coin split or anything like that there will probably be futures markets. These futures markets will probably make it very clear to everyone the alternative chain that stands a chance, that will inform miners on what to mine and prevent a split that way. I feel pretty confident about the collective wisdom of the market to warn everyone about potential scenarios so it will probably work out fine. That’s my general perception.\"}, {\"type\":\"paragraph\",\"text\":\"SP: The problem with this sort of stuff is if it doesn’t work out fine it is really, really bad. Then we get to say retroactively “I guess it didn’t work out fine.”\"}, {\"type\":\"heading\",\"text\":\"Development process of LOT=true client\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I want to bring something up before you bring up whatever you wanted to bring up. I have seen some concerns by Bitcoin Core developers about the development process of the LOT=true client. I think this gets down to the Gitian building, Gitian signing which we also discussed in another [episode](https://www.youtube.com/watch?v=_qdhc5WLd2A).\"}, {\"type\":\"paragraph\",\"text\":\"SP: We talked about the need for software to be open source, to be easy to audit.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Can you give your view on that in this context?\"}, {\"type\":\"paragraph\",\"text\":\"SP; The change that they made relative to the main Bitcoin Core client is not huge. You can see it on GitHub. In that sense that part of open source is reasonably doable to verify. I think that code has had less review but not zero review.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Less than Bitcoin Core’s?\"}, {\"type\":\"paragraph\",\"text\":\"SP: Exactly but much more than the UASF, much more than the 2017 UASF.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: More than that?\"}, {\"type\":\"paragraph\",\"text\":\"SP: I would say. The idea has been studied a bit longer. But the second problem is how do you know that what you are downloading isn’t malware. There are two measures there. There is release signatures, the website explains pretty well how to check those. I think they were signed by Luke Dashjr and by the other developer. You can check that.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Bitcoin Mechanic is the other developer. Actually it is released by Bitcoin Mechanic and Shinobi and Luke Dashjr is the advisor, contributor.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Usually there is a binary file that you download and then there is a file with checksums in it and that file with checksums is also signed by a known person. If you have Luke’s key or whoever, their key and you know them, you can check that at least the binary you downloaded is not coming from a hacked website. The second thing, you just have a binary and you know they signed it but who are they? The second thing is you want to check that this code matches the binary and that is where Gitian building comes in which we talked about in an earlier [episode](https://www.youtube.com/watch?v=_qdhc5WLd2A). Basically deterministic builds. It takes the source code and it produces the binary. Multiple people can then sign that indeed according to them this source code produces this binary. The more people that confirm that the more likely it is that they are not colluding. I think there are only two Gitian signatures for this other release.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: So the Bitcoin Core software is being Gitian signed by…\"}, {\"type\":\"paragraph\",\"text\":\"SP: I think 10 or 20 people.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: A lot of the experienced Bitcoin Core developers that have been developing the Bitcoin Core software for a while. Including you? Did you sign it?\"}, {\"type\":\"paragraph\",\"text\":\"SP: The most recent release, yes.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: You are trusting that they are not all colluding and spreading malware. It still comes down to trust in that sense for most people.\"}, {\"type\":\"paragraph\",\"text\":\"SP: If you are really contemplating running this alternative software you really should know what you are doing in terms of all these re-org scenarios. If you already know what you are doing in those terms then just compile the thing from source. Why not? If you are not able to compile things from source you probably shouldn’t be running this. But that is up to you. I am not worried that they are shipping malware but in general it is just a matter of time before somebody says “I have a different version with LOT=happy and please download  it here” and it steals all your Bitcoin. It is more the precedent this is setting that I’m worried about than that this thing might actually have malware in it.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That is fair. Maybe sign it Sjors?\"}, {\"type\":\"paragraph\",\"text\":\"SP: No because I don’t think this is a sane thing to release.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Fair enough.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That’s just my opinion. Everyone is free to run whatever they want to run.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Was there anything else you wanted to bring up?\"}, {\"type\":\"heading\",\"text\":\"What would Bitcoin Core release if Speedy Trial failed to activate?\"}, {\"type\":\"paragraph\",\"text\":\"SP: Yeah we talked about true signaling or false signaling on bit 1 but a very real possibility I think if this activation fails and we want to try something else then we probably don’t want to use the same bit if it is before the timeout window. That could create a scenario where you might start saying “Let’s use another bit to do signaling.” Then you could get some confusion where there is a new Bitcoin Core release that activates using bit 3 for example but the LOT=true folks don’t see it because they are looking at bit 1. That may or may not be an actual problem. The other thing is that there could be all sorts of other ways to activate this thing. One could be a flag day. If Bitcoin Core were to release a flag day then there won’t be any signaling. The LOT=true client won’t know that Taproot is active and they will demand signaling at some point even though Taproot is already active.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Your point being that we don’t know what Bitcoin Core will release after Speedy Trial and what they might release might not necessarily be compatible with the LOT=true client. That works both ways of course.\"}, {\"type\":\"paragraph\",\"text\":\"SP: Sure. I am just reasoning from one point here. I would also say that in the event that Bitcoin Core releases something else that has pretty wide community support, I would imagine the people who are running the BIP 8 clients are not sitting in a cave somewhere. They are probably relatively active users that can decide “I am going to run this Bitcoin Core version again because there is a flag day in it which is earlier than the forced signaling.” I could imagine they would decide to run it or not.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That also works both ways.\"}, {\"type\":\"paragraph\",\"text\":\"SP: No, not really. I am much more worried about people who are not following this discussion who just default to whatever the newest version of Core is. Or don’t upgrade at all, they are still running say Bitcoin Core v0.15. I am much more worried about that group than about the group that actively takes a stance on this thing. If you actively take a stance by running something else then you know what you are doing. It is up to you to stay up to date. But we have a commitment towards all the users that if you are still running in your bunker the 0.15 version of Bitcoin Core that nothing bad should happen to you if you follow the most proof of work within the rules that you know.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That could also mean making it compatible with the LOT=true client.\"}, {\"type\":\"paragraph\",\"text\":\"SP: No, as far as the v0.15 node is concerned there is no LOT=true client.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Do we want to get into all sorts of scenarios? The scenario that I am most concerned about is the LOT=true chain to call it that if there is ever a split will win but only after a while because you get long re-orgs. This gets back to the LOT=true versus LOT=false discussion in the first place.\"}, {\"type\":\"paragraph\",\"text\":\"SP: I can only see that happening with a massive price collapse of Bitcoin itself. If the scenario comes to be where LOT=true starts winning after a delay which requires a big re-org… if it is more likely to win its relative price will go up because it is more likely to win. But because a bigger re-org is more disastrous for Bitcoin the longer the re-org the lower the Bitcoin price. That would be the bad scenario. If there is a 1000 block re-org or more then I think the Bitcoin price will collapse to something very low. We don’t really care whether the LOT=true client wins or not. That doesn’t matter anymore.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: I agree with that. The reason I am not concerned is what I mentioned before, I think these things will be sorted out by futures markets well before it actually happens.\"}, {\"type\":\"paragraph\",\"text\":\"SP: I guess the futures market would predict exactly that. That would not be good. Depending on your confidence in futures markets which for me is not that amazing.\"}, {\"type\":\"heading\",\"text\":\"Block height versus MTP\"}, {\"type\":\"paragraph\",\"text\":\"<https://github.com/bitcoin/bitcoin/pull/21377#issuecomment-818758277>\"}, {\"type\":\"paragraph\",\"text\":\"SP: We could still talk about this nitty difference between block height versus block time. There was a fiasco but I don’t think it is an interesting difference.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: We might as well mention it.\"}, {\"type\":\"paragraph\",\"text\":\"SP: When we first described the Speedy Trial we assumed everything would be based on block height. There would be a transformation from the way soft forks work right now which is based on these median times to block heights which is conceptually simpler. Later on there was some discussion between the people who were working on that, considering maybe the only Speedy Trial difference should be the activation height and none of the other changes. From the point of the view of the existing codebase it is easier to make the Speedy Trial adjust one parameter which is a minimum activation height versus the change where you change everything into block heights which is a bigger change from the existing code. Even though the end result is easier. A purely block height based approach is easier to understand, easier to explain what it is going to do, when it is going to do it. Some edge cases are also easier. But to stay closer to the existing codebase is easier for reviewers somewhat. The difference is pretty small so I think some people decided on a coin toss and other people I think agreed without the coin toss.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: There are arguments on both sides but they seem to be pretty subtle, pretty nuanced. Like we mentioned Speedy Trial is going to start on the same date anyway so it doesn’t seem to matter that much. At some point some developers were seriously considering deciding through a coin flip using the Bitcoin blockchain for that, picking a block in the near future and seeing if it ends with an even or odd number. I don’t know if that was literally what they did but that would be one way of doing it. I think they did do the coin flip but then after that the champions for both solutions ended up agreeing anyway.\"}, {\"type\":\"paragraph\",\"text\":\"SP: They agreed on the same thing that the coin flip said.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: The main dissenter was Luke Dashjr who feels strongly about using block heights consistently. He also is of the opinion that the community had found consensus on that and that Bitcoin Core developers not using that is going back or breaking community consensus.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That is his perspective. If you look at the person who wrote the original pull request that was purely height based, I think that was Andrew Chow, he closed his own pull request in favor of the mixed solution that we have now. If the person writing the code removes it himself I think that’s pretty clear. From my point of view the people who are putting in the most effort should probably decide when it is something this trivial. I don’t think it matters that much.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It seems like a minor point to me but clearly not everyone agrees it is a minor point.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That is what bikeshedding is about right? It wouldn’t be bikeshedding if everybody thought it was irrelevant which color the bike shed had.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: Let’s leave the coin flip and the time, block height thing behind us Sjors because I think we covered anything and maybe we shouldn’t dwell on this last point. Is that it? I hope this was clear.\"}, {\"type\":\"paragraph\",\"text\":\"SP: I think we can very briefly still interject one thing that was brought up which is the timewarp attack.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: We didn’t mention that, that is somewhat relevant in this context. An argument against using block time is that it opens the door to timewarp attacks where miners are faking the timestamps on the blocks they mine to pretend it is a different time and date. That way they can for example just skip the signaling period altogether, if they collude in doing that.\"}, {\"type\":\"paragraph\",\"text\":\"SP: That sounds like an enormous amount of effort for no good reason but it is an interesting scenario. We did an episode about the timewarp attack a long time ago, back when I understood it. There is a soft fork proposal to get rid of it that I don’t think anyone objected to but also nobody bothered to actually implement. One way to deal with this hypothetical scenario is if it were to happen then we deploy the soft fork against the timewarp attack first and then we try Taproot activation again.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: The argument against that from someone like Luke is of course you can fix any bug but you can also just not include the bug in the first place.\"}, {\"type\":\"paragraph\",\"text\":\"SP: It is nice to know that miners would be willing to use it. If we know that miners are actually willing to exploit the timewarp attack that is incredibly valuable information. If they have a way to collude and a motivation to use that attack… The cost of that attack would be pretty low, it would be delaying Taproot by a few months but we would have this massive conspiracy unveiled. I think that is a win.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: The way Luke sees it is that there was already consensus on all sorts of things, using BIP 8 and this LOT=true thing, he saw this as somewhat of a consensus effort. Using block times is frustrating that in his opinion. I don’t want to speak for him but if I am trying to channel Luke a little bit or explain his perspective that would be it. In his view consensus was already forming and now it is a different path.\"}, {\"type\":\"paragraph\",\"text\":\"SP: I don’t think this new approach blocks any of the LOT=true stuff that much. We went through all the scenarios here and the confusion wasn’t around block height versus time, it was on all sorts of things that could go wrong depending on how things evolved. But not that particular issue. As for consensus, consensus is in the eye of the beholder. I would say if multiple people disagree then there isn’t consensus.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: That would also work the other way around. Where Luke disagrees using block time.\"}, {\"type\":\"paragraph\",\"text\":\"SP: But he cannot say there was consensus on something. If people disagree by definition there wasn’t consensus.\"}, {\"type\":\"paragraph\",\"text\":\"AvW: It was my impression that there was no consensus because people disagree. Let’s wrap up. For our listeners that are confused and worried I am going to emphasize the next 3 months Speedy Trial is going to run on both clients. If miners activate through Speedy Trial we are going to have Taproot in November and everyone is going to be happy. We will continue the soft fork discussion with the next soft fork.\"}, {\"type\":\"paragraph\",\"text\":\"SP: We’ll have the same arguments all over again because we’ve learnt absolutely nothing.\"}",
    "body": "Previous episode on lockinontimeout (LOT): <https://btctranscripts.com/bitcoin-magazine/2021-02-26-taproot-activation-lockinontimeout/>\n\nPrevious episode on Speedy Trial: <https://btctranscripts.com/bitcoin-magazine/2021-03-12-taproot-activation-speedy-trial/>\n\nAaron van Wirdum on “There are now two Taproot activation clients, here’s why”: <https://bitcoinmagazine.com/technical/there-are-now-two-taproot-activation-clients-heres-why>\n## Intro\n\nAaron van Wirdum (AvW): Live from Utrecht this is the van Wirdum Sjorsnado.\n\nSjors Provoost (SP): Hello\n\nAvW: Sjors, today we have a “lot” more to discuss.\n\nSP: We’ve already made this pun.\n\nAvW: We’ve already made it twice I think. It doesn’t matter. We are going to discuss the final implementation details of Speedy Trial today. We have already covered Speedy Trial in a previous [episode](https://btctranscripts.com/bitcoin-magazine/2021-03-12-taproot-activation-speedy-trial/). This time we are also going to contrast it to the LOT=true client which is an alternative that has been released by a couple of community members. We are going to discuss how they compare.\n\nSP: That sounds like a good idea. We also talked about Taproot activation options in general in a much earlier episode.\n\nAvW: One of the first ones?\n\nSP: We also talked about this idea of this cowboy mentality where somebody would eventually release a LOT=true client whatever you do.\n\nAvW: That is where we are.\n\nSP: We also predicted correctly that there would be a lot of bikeshedding.\n\nAvW: Yes, this is also something we will get into. First of all as a very brief recap, we are talking about Taproot activation. Taproot is a proposed protocol upgrade for compact and potentially privacy preserving smart contracts on the Bitcoin protocol. Is that a good summary?\n\nSP: Yeah I think so.\n\nAvW: The discussion on how to upgrade has been going on for a while now. The challenge is that on a decentralized open network like Bitcoin without a central dictator to tell everyone what to run when, you are not going to get everyone to upgrade at the same time. But we do want to keep the network in consensus somehow or other.\n\nSP: Yeah. The other thing that can work when it is a distributed system is some sort of conventions, ways that you are used to doing things. But unfortunately the convention we had ran into problems with the SegWit deployment. Then the question is “Should we try something else or was it just a freak accident and we should try the same thing again?”\n\nAvW: I think the last preface before we really start getting into Speedy Trial, I’d like to point out the general idea with a soft fork, a backwards compatible upgrade which Taproot is, is that if a majority of hash power is enforcing the new rules that means that the network will stay in consensus.\n\nSP: Yeah. We can repeat that if you keep making transactions that are pre-Taproot then those transactions are still valid. In that sense, as a user you can ignore soft forks. Unfortunately if there is a problem you cannot ignore that as a user even if your transactions don’t use Taproot.\n\nAvW: I think everyone agrees that it is very nice if a majority of hash power enforces the rules. There are coordination mechanisms to measure how many miners are on board with an upgrade. That is how you can coordinate a fairly safe soft fork. That is something everyone agrees on. Where people start to disagree on what happens if miners don’t actually cooperate with this coordination. We are not going to rehash all of that. There are previous episodes about that. What we are going to explain is that in the end the Bitcoin Core development community settled on a solution called “Speedy Trial.” We already mentioned that as well in a previous episode. Now it is finalized and we are going to explain what the finalized parameters are for this.\n\nSP: There was a slight change.\n\nAvW: Let’s hear it Sjors. What are the finalized parameters for Speedy Trial? How is Bitcoin Core going to upgrade to Taproot?\n\n## Bitcoin Core finalized activation parameters\n\nBitcoin Core 0.21.1 release notes: <https://github.com/bitcoin/bitcoin/blob/0.21/doc/release-notes.md>\n\nSpeedy Trial activation parameters merged into Core: <https://github.com/bitcoin/bitcoin/pull/21686>\n\nSP: Starting on I think it is this Sunday (April 25th, midnight) the first time the difficult readjusts, that happens every two weeks, probably one week after Sunday…\n\nAvW: It is Saturday\n\nSP:… the signaling starts. In about two weeks the signaling starts, no earlier than one week from now.\n\nAvW: Just to be clear, that’s the earliest it can start.\n\nSP: The earliest it can start is April 24th but because it only starts at a new difficulty adjustment period, a new retargeting period, it probably won’t start until two weeks from now.\n\nAvW: It will start at the first new difficulty period after April 24th which is estimated I think somewhere early May. May 4th, may the fourth be with you Sjors.\n\nSP: That would be a cool date. That is when the signaling starts and the signaling happens in you could say voting rounds. A voting round is two weeks or one difficulty adjustment period, one retargeting period. If 90 percent of the blocks in that voting period signal on bit number 2, if that happens Taproot is locked in. Locked in means that it is going to happen, imagine the little gif with Ron Paul, “It’s happening.” But the actual Taproot rules won’t take effect immediately, they will take effect at block number 709632.\n\nAvW: Which is estimated to be mined when?\n\nSP: That will be November 12th this year.\n\nAvW: That is going to differ a bit of course based on how fast blocks are going to be mined over the coming months. It is going to be November almost certainly.\n\nSP: Which would be 4 years after the SegWit2x effort imploded.\n\nAvW: Right, nice timing in that sense.\n\nSP: Every date is nice. That’s what the Speedy Trial does. Every two weeks there is a vote, if 90 percent of the vote is reached then that’s the activation date. It doesn’t happen immediately and because it is a “Speedy” Trial it could also fail quickly and that is in August, around August 11th. If the difficulty period after that or before that, I always forget, doesn’t reach the goal, I think it is after…\n\nAvW: The difficulty period must have ended by August 11th right?\n\nSP: When August 11th is passed it could still activate but then the next difficulty period, it cannot. I think the rule is at the end of the difficulty period you start counting and if the result is a failure then if it is after August 11th you give up but if it is not yet August 11th you enter the next round.\n\nAvW: If the first block of a new difficulty period is mined on August 10th will that difficulty period still count?\n\nSP: That’s right. I think that’s one of the subtle changes made to BIP 9 to make BIP 9 easier to reason about. I think it used to be the other way around where you first check the date but if it was past the date you would give up but if it was before the date you would still count. Now I think it is the other way round, it is a bit simpler.\n\nAvW: I see. There is going to be a signaling window of about 3 months.\n\nSP: That’s right.\n\nAvW: If in any difficulty period within that signaling window of 3 months 90 percent of hash power is reached Taproot will activate in November of this year.\n\nSP: Yes\n\nAvW: I think that covers Speedy Trial.\n\nSP: The threshold is 90 percent as we said. Normally with BIP 9 it is 95 percent, it has been lowered to 90.\n\nAvW: What happens if the threshold is not met?\n\nSP: Nothing. Which means anything could still happen. People could deploy new versions of software, try another bit etc\n\nAvW: I just wanted to clarify that.\n\nSP: It does not mean that Taproot is cancelled.\n\nAvW: If the threshold isn’t met then this specific software client will just do nothing but Bitcoin Core developers and the rest of the Bitcoin community can still figure out new ways to activate Taproot.\n\nSP: Exactly. It is a low cost experiment. If it wins we get Taproot. If not then we have some more information as to why we don’t…\n\nAvW: I also want to clarify. We don’t know what it is going to look like yet. That will have to be figured out then. We could start figuring it out now but that hasn’t been decided yet, what the deployment would look like.\n\n## Alternative to Bitcoin Core (Bitcoin Core 0.21.0-based Taproot Client)\n\nUpdate on Taproot activation releases: <https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2021-April/018790.html>\n\nAvW: Another client was also launched. There is a lot of debate on the name. We are going to call it the LOT=true client.\n\nSP: That sounds good to me.\n\nAvW: It derives from this technical and philosophical difference about how soft forks should be activated in the first place. This client uses, you guessed it, LOT=true. LOT=true means that if the signaling window is over, by the end of the signaling window nodes will start to reject any blocks that don’t signal. They only accept blocks that signal. That is the main difference. Let’s get into the specifics of the LOT=true client.\n\nSP: In the beginning it is the same, in principle it is the same. There is a theoretical possibility that it is not if miners do something really crazy. It starts at a certain block height…\n\nAvW: We just mentioned that Bitcoin Core 0.21.1 starts its signaling window on the first difficulty period after April 24th. This LOT=true client will also in practice start its signaling window on the first difficulty period after April 24th except that April 24th isn’t specified specifically. They just picked the specific block height that is expected to be the first one after April 24th.\n\nSP: Exactly, they picked block 681,408.\n\nAvW: It is specified as a block height instead of indirectly through using a date.\n\nSP: But in all likelihood that is going to be the exact same moment. Both Speedy Trial (Core) and the LOT=true client will start the signaling, the voting periods at the same time. The voting periods themselves, they vote on the same bit. They both vote on bit 2. They both have a threshold of 90 percent. Also if the vote is true then it also has a delayed activation. The delayed activation is a block height in both scenarios in both the Speedy Trial (Core) and the LOT=true variant.\n\nAvW: Botha are November 12th, a November activation anyway. If miners signal readiness for Taproot within the Speedy Trial period both of these clients will activate Taproot in November on that exact same date, exact same block.\n\nSP: So in that sense they are identical. But they are also different.\n\nAvW: Let’s get into the first big difference. We already mentioned one difference which is the very subtle difference between starting it at height, the thing we just mentioned. Let’s get into a bigger difference.\n\nSP: There is also a height for a timeout in this LOT=true and that is also a block. But not only is that a block, that could be a slight difference especially when it is a long time period. At the beginning if you use block height or time, date you can guess very accurately but if it is a year ahead then you can’t. But this is almost two years ahead, this block height (762048, approximately November 10th 2022) that they have in there. It goes on much longer.\n\nAvW: Two years from now you mean, well one and a half.\n\nSP: Exactly. In that sense it doesn’t really matter that they are using height because it is such a big difference anyway. But this is important. They will keep signaling much longer than the Speedy Trial. We can get into the implications later but basically they will signal much later.\n\nAvW: Let’s stick to the facts first and the implications later. Speedy Trial (Bitcoin Core), it will last for 3 months. And this one, the LOT=true client will allow signaling for 18 months.\n\nSP: The other big difference is that at the end of that 18 months, where the Speedy Trial will simply give up and continue, the LOT=true will wait for miners who do signal. This could be nobody or could be everybody.\n\nAvW: They will only accept signaling blocks after these 18 months. For those who are aware of the whole block size war, it is a little bit like the BIP 148 client.\n\nSP: It is pretty much the same with slightly better tolerance. The UASF client required every single block to signal whereas this one requires 90 percent to signal. In practice if you are the miners at the last 10 percent of that window you need to pay a bit more attention. Other than that it is the same.\n\nAvW: That is why some people would call this the UASF client. The BIP 148 client was the UASF client for SegWit, this is the UASF client for Taproot. I know that for example Luke Dashjr has been contributing to this client doesn’t like the term UASF in this context because there is 18 months of regular miner signaling.\n\nSP: So did the UASF. It is a bit more patient than the UASF.\n\nAvW: There is a lot of discussion on the name of the client and what people should call it or not call it. In general some people have been calling it the UASF client and this is why.\n\nSP: You could call it the “Slow UASF” or something.\n\n## Implications of having two alternative clients\n\nAvW: I have also seen the name User Enforced Miner Activated Soft Fork (UEMASF). People are coming up with names. The basic facts are clear now I hope. Let’s get into the implications. There are some potential incompatibilities between these two activation clients. Everyone agrees that Taproot is great. Everyone wants Taproot. Everyone agrees that it would be preferable if miners activate it. The only thing where there is some disagreement on is what’s the backup plan. That is where the incompatibilities come in. Do you agree?\n\nSP: I think so.\n\nAvW: What are the incompatibilities? First of all and I already mentioned this, to emphasize this, if Speedy Trial activates Taproot there are no incompatibilities. Both clients are happily using Taproot starting in November. This seems pretty likely because 90 percent of mining pools have already indicated that they support Taproot. Likely there is no big deal here, everything will turn out fine. If Speedy Trial doesn’t succeed in activating Taproot that is where we enter a phase where we are going to start to look at potential incompatibilities.\n\nSP: For sure. Imagine one scenario where Speedy Trial fails. Probably Bitcoin Core people will think about that for a while and think about some other possibilities. For some reason miners get wildly enthusiastic right after Speedy Trial fails and start signaling at 90 percent. As far as Bitcoin Core is concerned Taproot never activated. As far as the UASF or LOT=true client Taproot did just activate.\n\nAvW: Let’s say in month 4, we have 3 months of Speedy Trial and then in month 4 miners suddenly signal readiness for Taproot. Bitcoin Core doesn’t care anymore, Bitcoin Core 0.21.1 isn’t looking at the signaling anymore. But this LOT=true client is. On the LOT=true client Taproot will be activated in November while on this Bitcoin Core client it will not.\n\nSP: Then of course if you are using that LOT=true client and you start immediately using Taproot at that moment because you are very excited, you see all these blocks coming in, you may or may not lose your money. Anybody who is running the regular Bitcoin Core client will accept those thefts from Taproot addresses essentially.\n\nAvW: In this case it matters what miners are doing as well. If miners signal readiness because they are actually ready and they are actually going to enforce Taproot then it is fine. There is no issue because they will enforce the soft fork and even Bitcoin Core 0.21.1 nodes will follow this chain. The LOT=true client will enforce and everybody is happy on the same chain. The only scenario where this is a problem, what you just described, is if miners do signal readiness but they aren’t actually going to enforce the Taproot rules.\n\nSP: The problem is of course in general with soft forks, but especially if everyone is not on exactly the same page about what the rules are, you only know that it is enforced when it is actually enforced. You don’t know if it is going to be enforced in the future. This will create a conundrum for everybody else because then the question is what to do? One thing you could do at that point is say “Obviously Taproot is activated so let’s just release a new version of Bitcoin Core that just says retroactively it activated.” It could just be a BIP 9 soft fork repeating the same bit but slightly later or it could just say “We know it activated. We will just hardcode the flag date.”\n\nAvW: It could just be a second Speedy Trial. Everything would work in that case?\n\nSP: There is a problem with reusing the same bit number within a short period of time. (Note: AJ Towns stated on IRC that this would only be a problem if multiple soft forks were being deployed in parallel.) Because it would be exactly the week after in the scenario we talked about it may not be possible to use the same bit. Then you will have a problem because you can’t actually check that specific bit but there’s no signal on any of the other bits. That would create a bit of a headache. The other solution would be very simple, to say it apparently activated so we will just hardcode the block date and activate it then. The problem is what if between the time that the community decides “Let’s do this” and the moment that software is released and somewhat widely deployed one or more miners say “Actually we are going to start stealing these Taproot coins.” You get a massive clusterf\\*\\*\\* in terms of agreeing on the chain. Now miners will not be incentivized to do this because why would you deliberately create complete chaos if you just signaled for a soft fork? But it is a very scary situation and it might make it scary to make the release. If you do make the release but miners start playing these shenanigans what do you do then? Do you accept a huge re-org at some point? Or do you give up and consider it not deployed? But then people lose their money and you’ve released a client that you now have to hard fork from technically. It is not a good scenario.\n\nAvW: It gets complicated in scenarios like this, also with game theory and economics. Even if miners would choose to steal they risk stealing coins on a chain that could be re-orged. They have just mined a chain that could be re-orged if other miners do enforce these Taproot rules. It gets weird, it is a discussion about economic incentives and game theory in that scenario. Personally I think it is pretty unlikely that something like this would happen but it is at least technically possible and it is something to be aware of.\n\nSP: It does make you wonder whether as a miner it is smart to signal immediately after this Speedy Trial. This LOT=true client allows for two years anyway. If the only reason you are signaling is because this client exists then I would strongly suggest not doing it immediately after the Speedy Trial. Maybe wait a little bit until there is some consensus about what to do next.\n\nAvW: One thing you mentioned and I want to quickly address that, this risk always exists for any soft fork. Miners can always false signal, they could have done it with SegWit for example, false signal and then steal coins from SegWit outputs. Old nodes wouldn’t notice the difference. That is always a risk. I think the difference here is that Bitcoin Core 0.21.1 users in this scenario might think they are running a new node, from their perspective they are running an updated node. They are running the same risks as previously only outdated nodes would run.\n\nSP: I would be mostly worried about the potential 0.21.2 users who are installing the successor to Speedy Trial which retroactively activates Taproot perhaps. That group is very uncertain of what the rules are.\n\nAvW: Which group is this?\n\nSP: If the Speedy Trial fails and then it is signaled, there might be a new release and people would install that new release, but then it is not clear whether that new release would be safe or not. That very new release would be the only one that would actually think that Taproot is active, as well as the LOT=true client. But now we don’t know what the miners are running and we don’t know what the exchanges are running because this is very new. This would be done in a period of weeks. Right now we have a 6 month… I guess the activation date would still be November.\n\nAvW: It would still be November so there is still room to prepare in that case.\n\nSP: Ok, then I guess what I said before is nonsense. The easier solution would be to do a flag date where the new release would say “It is going to activate on November 12th or whatever that block height is without any signaling.” Signaling exists but people have different interpretations about it. That could be a way.\n\n## Recap\n\nAvW: I am still completely clear about what we are talking about it here but I am not sure if our listeners are catching up at this point. Shall we recap? If miners activate during the Speedy Trial then everything is fine, everyone is in consensus.\n\nSP: And the new rules take effect in November.\n\nAvW: If miners activate after the Speedy Trial period then there is a possibility that the LOT=true client and the Bitcoin Core 0.21.1 client won’t be in consensus if an invalid Taproot block is ever mined.\n\nSP: They have no forced signaling, you’re right. If an invalid Taproot transaction shows up after November 12th….\n\nAvW:…. and if that is mined and enforced by a majority of miners, a majority of miners must have false signaled, then the two clients can get out of consensus. Technically this is true, I personally think it is fairly unlikely. I am not too concerned about this but it is at least technically true and something people should be aware of.\n\nSP: That scenario could be prevented by saying “If we see this “false” signaling, if we see this massive signaling a week after the Speedy Trial then you could decide to release a flag date client which just says we are going to activate this November 12th because apparently the miners want this. Otherwise we have no idea what to make of this signal.”\n\nAvW: I find it very hard to predict what Bitcoin Core developers in this case are going to decide.\n\nSP: I agree but this is one possibility.\n\n## A likelier way that the two clients could be incompatible?\n\nAvW: That was one way the two clients can become incompatible potentially. There is another way which is maybe more likely or at least it is not as complicated.\n\nSP: The other one is “Let’s imagine that the Speedy Trial fails and the community does not have consensus over how to proceed next.” Bitcoin Core developers can see that, there is ongoing discussion and nobody agrees. Maybe Bitcoin Core developers decide to wait and see.\n\nAvW: Miners aren’t signaling…\n\nSP: Or erratically etc. Miners aren’t signaling. The discussion still goes on. Nothing happens. Then this LOT=true mechanism kicks in…\n\nAvW: After 18 months. We are talking about November 2022, it is a long way off but at some point the LOT=true mechanism will kick in.\n\nSP: Exactly. Those nodes will then, assuming that the miners are still not signaling, they will stop…\n\nAvW: That is if there are literally no LOT=true signaling blocks.\n\nSP: In the other scenario where miners do massively start signaling, now we are back to that previous scenario where suddenly there is a lot of miner signaling on bit 2. Maybe the soft fork is active but now there is no delay. If the signaling happens anywhere after November 12th the LOT=true client will activate Taproot after one adjustment period.\n\nAvW: I am not sure I am following you.\n\nSP: Let’s say in this case in December of this year the miners suddenly start signaling. After the minimum activation height. In December they all start signaling. The Bitcoin Core client will ignore it but the LOT=true client will say “Ok Taproot is active.”\n\nAvW: This is the same scenario we just discussed? There is only a problem if there is a false signaling. Otherwise it is fine.\n\nSP: There is a problem if there is false signaling but it is more complicated to resolve this one because that option of just releasing a new client with a flag day in it that is far enough into the future, that is not longer there. It is potentially active immediately. If you do a release but then suddenly a miner starts not enforcing the rules you get this confusion that we talked about earlier. Then we are able to solve it by just making a flag date. This would be even messier. Maybe it is also even less likely.\n\nAvW: It is pretty similar to the previous scenario but a little more difficult, less obvious how to solve this.\n\nSP: I think it is messier because it is less obvious how you would do a flag day release in Bitcoin Core in that scenario because it immediately activates.\n\nAvW: That is not where I wanted to go with this.\n\nSP: You wanted to go for some scenario where miners wait all the way to the end until they start signaling?\n\nAvW: Yes that is where I wanted to go.\n\nSP: This is where the mandatory signaling kicks in. If there is no mandatory signaling then the LOT=true nodes will stop until somebody mines a block that they’d like to see, a block that signals. If they do see this block that signals we are back in the previous example where suddenly the regular Bitcoin Core nodes see this signaling but they ignore it. Now there is a group of nodes that believe that Taproot is active and there is a group of nodes that don’t. Somebody then has to decide what to do with it.\n\nAvW: You are still talking about false signaling here?\n\nSP: Even if the signaling is genuine you still want there to be a Bitcoin Core release, probably, that actually says “We have Taproot now.” But the question is when do we have Taproot according to that release? What is a safe date to put in there? You could do it retroactively.\n\nAvW: Whenever they want. The point is if miners are actually enforcing the new rules then the chain will stay together. It is up to Bitcoin Core to implement whenever they feel like it.\n\nSP: The problem with this signaling is you don’t know if it is active until somebody decides to try to break the rules.\n\nAvW: My assumption was that there wasn’t false signaling. They’ll just create the longest chain with the valid rules anyway.\n\nSP: The problem with that is that it is unknowable.\n\nAvW: The scenario I really wanted to get to Sjors is the very simple scenario where the majority of miners doesn’t signal when the 18 months are up. In that case they are going to create the longest chain that the Bitcoin Core 0.21.1 nodes are going to follow while the LOT=true nodes are only going to accept blocks that do signal which maybe zero or at least fewer. If it is a majority then there is no split. But if it is not a majority then we have a split.\n\nSP: And that chain would get further and further behind. The incentive to make a release to account for that would be quite small I think. It depends, this is where your game theory comes in. From a safety point of view, if you now make a release that says “By the way we retroactively consider Taproot active” that would cause a giant re-org. If you just activate it that wouldn’t cause a giant re-org. But if you say “By the way we are going to retroactively mandate that signaling that you guys care about” that would cause a massive re-org. This would be unsafe, that would not be something that would be released probably. That is a very messy situation.\n\nAvW: There are messy potential scenarios. I want to emphasize to our dear listeners, none of this is going to happen in the next couple of months.\n\nSP: And hopefully never. We will throw in a few other bad scenarios and then I guess we can go onto some other topics.\n\nAvW: I want to mention real quick is the reason I’m not too concerned about these really bad scenarios playing out is because I think if it seems even slightly likely that there might be a coin split or anything like that there will probably be futures markets. These futures markets will probably make it very clear to everyone the alternative chain that stands a chance, that will inform miners on what to mine and prevent a split that way. I feel pretty confident about the collective wisdom of the market to warn everyone about potential scenarios so it will probably work out fine. That’s my general perception.\n\nSP: The problem with this sort of stuff is if it doesn’t work out fine it is really, really bad. Then we get to say retroactively “I guess it didn’t work out fine.”\n\n## Development process of LOT=true client\n\nAvW: I want to bring something up before you bring up whatever you wanted to bring up. I have seen some concerns by Bitcoin Core developers about the development process of the LOT=true client. I think this gets down to the Gitian building, Gitian signing which we also discussed in another [episode](https://www.youtube.com/watch?v=_qdhc5WLd2A).\n\nSP: We talked about the need for software to be open source, to be easy to audit.\n\nAvW: Can you give your view on that in this context?\n\nSP; The change that they made relative to the main Bitcoin Core client is not huge. You can see it on GitHub. In that sense that part of open source is reasonably doable to verify. I think that code has had less review but not zero review.\n\nAvW: Less than Bitcoin Core’s?\n\nSP: Exactly but much more than the UASF, much more than the 2017 UASF.\n\nAvW: More than that?\n\nSP: I would say. The idea has been studied a bit longer. But the second problem is how do you know that what you are downloading isn’t malware. There are two measures there. There is release signatures, the website explains pretty well how to check those. I think they were signed by Luke Dashjr and by the other developer. You can check that.\n\nAvW: Bitcoin Mechanic is the other developer. Actually it is released by Bitcoin Mechanic and Shinobi and Luke Dashjr is the advisor, contributor.\n\nSP: Usually there is a binary file that you download and then there is a file with checksums in it and that file with checksums is also signed by a known person. If you have Luke’s key or whoever, their key and you know them, you can check that at least the binary you downloaded is not coming from a hacked website. The second thing, you just have a binary and you know they signed it but who are they? The second thing is you want to check that this code matches the binary and that is where Gitian building comes in which we talked about in an earlier [episode](https://www.youtube.com/watch?v=_qdhc5WLd2A). Basically deterministic builds. It takes the source code and it produces the binary. Multiple people can then sign that indeed according to them this source code produces this binary. The more people that confirm that the more likely it is that they are not colluding. I think there are only two Gitian signatures for this other release.\n\nAvW: So the Bitcoin Core software is being Gitian signed by…\n\nSP: I think 10 or 20 people.\n\nAvW: A lot of the experienced Bitcoin Core developers that have been developing the Bitcoin Core software for a while. Including you? Did you sign it?\n\nSP: The most recent release, yes.\n\nAvW: You are trusting that they are not all colluding and spreading malware. It still comes down to trust in that sense for most people.\n\nSP: If you are really contemplating running this alternative software you really should know what you are doing in terms of all these re-org scenarios. If you already know what you are doing in those terms then just compile the thing from source. Why not? If you are not able to compile things from source you probably shouldn’t be running this. But that is up to you. I am not worried that they are shipping malware but in general it is just a matter of time before somebody says “I have a different version with LOT=happy and please download  it here” and it steals all your Bitcoin. It is more the precedent this is setting that I’m worried about than that this thing might actually have malware in it.\n\nAvW: That is fair. Maybe sign it Sjors?\n\nSP: No because I don’t think this is a sane thing to release.\n\nAvW: Fair enough.\n\nSP: That’s just my opinion. Everyone is free to run whatever they want to run.\n\nAvW: Was there anything else you wanted to bring up?\n\n## What would Bitcoin Core release if Speedy Trial failed to activate?\n\nSP: Yeah we talked about true signaling or false signaling on bit 1 but a very real possibility I think if this activation fails and we want to try something else then we probably don’t want to use the same bit if it is before the timeout window. That could create a scenario where you might start saying “Let’s use another bit to do signaling.” Then you could get some confusion where there is a new Bitcoin Core release that activates using bit 3 for example but the LOT=true folks don’t see it because they are looking at bit 1. That may or may not be an actual problem. The other thing is that there could be all sorts of other ways to activate this thing. One could be a flag day. If Bitcoin Core were to release a flag day then there won’t be any signaling. The LOT=true client won’t know that Taproot is active and they will demand signaling at some point even though Taproot is already active.\n\nAvW: Your point being that we don’t know what Bitcoin Core will release after Speedy Trial and what they might release might not necessarily be compatible with the LOT=true client. That works both ways of course.\n\nSP: Sure. I am just reasoning from one point here. I would also say that in the event that Bitcoin Core releases something else that has pretty wide community support, I would imagine the people who are running the BIP 8 clients are not sitting in a cave somewhere. They are probably relatively active users that can decide “I am going to run this Bitcoin Core version again because there is a flag day in it which is earlier than the forced signaling.” I could imagine they would decide to run it or not.\n\nAvW: That also works both ways.\n\nSP: No, not really. I am much more worried about people who are not following this discussion who just default to whatever the newest version of Core is. Or don’t upgrade at all, they are still running say Bitcoin Core v0.15. I am much more worried about that group than about the group that actively takes a stance on this thing. If you actively take a stance by running something else then you know what you are doing. It is up to you to stay up to date. But we have a commitment towards all the users that if you are still running in your bunker the 0.15 version of Bitcoin Core that nothing bad should happen to you if you follow the most proof of work within the rules that you know.\n\nAvW: That could also mean making it compatible with the LOT=true client.\n\nSP: No, as far as the v0.15 node is concerned there is no LOT=true client.\n\nAvW: Do we want to get into all sorts of scenarios? The scenario that I am most concerned about is the LOT=true chain to call it that if there is ever a split will win but only after a while because you get long re-orgs. This gets back to the LOT=true versus LOT=false discussion in the first place.\n\nSP: I can only see that happening with a massive price collapse of Bitcoin itself. If the scenario comes to be where LOT=true starts winning after a delay which requires a big re-org… if it is more likely to win its relative price will go up because it is more likely to win. But because a bigger re-org is more disastrous for Bitcoin the longer the re-org the lower the Bitcoin price. That would be the bad scenario. If there is a 1000 block re-org or more then I think the Bitcoin price will collapse to something very low. We don’t really care whether the LOT=true client wins or not. That doesn’t matter anymore.\n\nAvW: I agree with that. The reason I am not concerned is what I mentioned before, I think these things will be sorted out by futures markets well before it actually happens.\n\nSP: I guess the futures market would predict exactly that. That would not be good. Depending on your confidence in futures markets which for me is not that amazing.\n\n## Block height versus MTP\n\n<https://github.com/bitcoin/bitcoin/pull/21377#issuecomment-818758277>\n\nSP: We could still talk about this nitty difference between block height versus block time. There was a fiasco but I don’t think it is an interesting difference.\n\nAvW: We might as well mention it.\n\nSP: When we first described the Speedy Trial we assumed everything would be based on block height. There would be a transformation from the way soft forks work right now which is based on these median times to block heights which is conceptually simpler. Later on there was some discussion between the people who were working on that, considering maybe the only Speedy Trial difference should be the activation height and none of the other changes. From the point of the view of the existing codebase it is easier to make the Speedy Trial adjust one parameter which is a minimum activation height versus the change where you change everything into block heights which is a bigger change from the existing code. Even though the end result is easier. A purely block height based approach is easier to understand, easier to explain what it is going to do, when it is going to do it. Some edge cases are also easier. But to stay closer to the existing codebase is easier for reviewers somewhat. The difference is pretty small so I think some people decided on a coin toss and other people I think agreed without the coin toss.\n\nAvW: There are arguments on both sides but they seem to be pretty subtle, pretty nuanced. Like we mentioned Speedy Trial is going to start on the same date anyway so it doesn’t seem to matter that much. At some point some developers were seriously considering deciding through a coin flip using the Bitcoin blockchain for that, picking a block in the near future and seeing if it ends with an even or odd number. I don’t know if that was literally what they did but that would be one way of doing it. I think they did do the coin flip but then after that the champions for both solutions ended up agreeing anyway.\n\nSP: They agreed on the same thing that the coin flip said.\n\nAvW: The main dissenter was Luke Dashjr who feels strongly about using block heights consistently. He also is of the opinion that the community had found consensus on that and that Bitcoin Core developers not using that is going back or breaking community consensus.\n\nSP: That is his perspective. If you look at the person who wrote the original pull request that was purely height based, I think that was Andrew Chow, he closed his own pull request in favor of the mixed solution that we have now. If the person writing the code removes it himself I think that’s pretty clear. From my point of view the people who are putting in the most effort should probably decide when it is something this trivial. I don’t think it matters that much.\n\nAvW: It seems like a minor point to me but clearly not everyone agrees it is a minor point.\n\nSP: That is what bikeshedding is about right? It wouldn’t be bikeshedding if everybody thought it was irrelevant which color the bike shed had.\n\nAvW: Let’s leave the coin flip and the time, block height thing behind us Sjors because I think we covered anything and maybe we shouldn’t dwell on this last point. Is that it? I hope this was clear.\n\nSP: I think we can very briefly still interject one thing that was brought up which is the timewarp attack.\n\nAvW: We didn’t mention that, that is somewhat relevant in this context. An argument against using block time is that it opens the door to timewarp attacks where miners are faking the timestamps on the blocks they mine to pretend it is a different time and date. That way they can for example just skip the signaling period altogether, if they collude in doing that.\n\nSP: That sounds like an enormous amount of effort for no good reason but it is an interesting scenario. We did an episode about the timewarp attack a long time ago, back when I understood it. There is a soft fork proposal to get rid of it that I don’t think anyone objected to but also nobody bothered to actually implement. One way to deal with this hypothetical scenario is if it were to happen then we deploy the soft fork against the timewarp attack first and then we try Taproot activation again.\n\nAvW: The argument against that from someone like Luke is of course you can fix any bug but you can also just not include the bug in the first place.\n\nSP: It is nice to know that miners would be willing to use it. If we know that miners are actually willing to exploit the timewarp attack that is incredibly valuable information. If they have a way to collude and a motivation to use that attack… The cost of that attack would be pretty low, it would be delaying Taproot by a few months but we would have this massive conspiracy unveiled. I think that is a win.\n\nAvW: The way Luke sees it is that there was already consensus on all sorts of things, using BIP 8 and this LOT=true thing, he saw this as somewhat of a consensus effort. Using block times is frustrating that in his opinion. I don’t want to speak for him but if I am trying to channel Luke a little bit or explain his perspective that would be it. In his view consensus was already forming and now it is a different path.\n\nSP: I don’t think this new approach blocks any of the LOT=true stuff that much. We went through all the scenarios here and the confusion wasn’t around block height versus time, it was on all sorts of things that could go wrong depending on how things evolved. But not that particular issue. As for consensus, consensus is in the eye of the beholder. I would say if multiple people disagree then there isn’t consensus.\n\nAvW: That would also work the other way around. Where Luke disagrees using block time.\n\nSP: But he cannot say there was consensus on something. If people disagree by definition there wasn’t consensus.\n\nAvW: It was my impression that there was no consensus because people disagree. Let’s wrap up. For our listeners that are confused and worried I am going to emphasize the next 3 months Speedy Trial is going to run on both clients. If miners activate through Speedy Trial we are going to have Taproot in November and everyone is going to be happy. We will continue the soft fork discussion with the next soft fork.\n\nSP: We’ll have the same arguments all over again because we’ve learnt absolutely nothing.\n\n\n",
    "body_type": "markdown",
    "created_at": "2021-04-23T00:00:00.000Z",
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/bitcoin-explained/taproot-activation-update",
    "categories": [
        "podcast"
    ],
    "tags": [
        "taproot"
    ],
    "media": "https://www.youtube.com/watch?v=SHmEXPvN6t4",
    "authors": [
        "Sjors Provoost",
        "Aaron van Wirdum"
    ],
    "indexed_at": "2024-03-21T16:33:36.170Z",
    "transcript_by": "Michael Folkson",
    "summary": "In a thought-provoking discussion, Sjors Provoost and Aaron van Wirdum delved into the complexities surrounding the activation methods for Bitcoin's Taproot update, highlighting a nuanced divide within the community. The primary focus rested on comparing the Speedy Trial client with the LOT=true client, each embodying distinct approaches towards activating this significant protocol upgrade. The Speedy Trial opts for a conservative three-month signaling period from miners, aiming for swift consensus. In contrast, the LOT=true client advocates for an extended signaling window of 18 months, coupled with a more assertive stance that would reject blocks not signaling Taproot readiness post-window, indicating a philosophical split on achieving network consensus.\n\nThis divergence underscores broader challenges in Bitcoin's decentralized governance. Through their conversation, Provoost and van Wirdum explored the implications of failing to activate Taproot via the Speedy Trial, including potential network fragmentation and user risks due to incompatible transactions. They considered solutions, such as developing new client versions for retroactive activation, but acknowledged the hurdles in aligning the community and ensuring seamless implementation, thus emphasizing the delicate balance between innovation and consensus in the Bitcoin ecosystem.\n\nMoreover, the dialogue ventured into technical and strategic considerations regarding software client releases, particularly focusing on the LockinOnTimeout (LOT) parameter's role. They highlighted scenarios where immediate activation could lead to confusion without a clear path forward, and how mandatory signaling might bifurcate the network, stressing the importance of timely and coordinated responses from developers to maintain network integrity.\n\nThe speakers also raised concerns about the development process and verification of the LOT=true client compared to the main Bitcoin Core client, stressing the need for rigorous review and authentication to prevent security risks. This part of the conversation broadened into a discussion on technical mechanisms like block height versus median time past for triggering soft forks, reflecting deeper layers of strategic thinking required for Bitcoin's technological advancement.\n\nThroughout the podcast, Provoost and van Wirdum engaged in a comprehensive exploration of the various facets of Bitcoin protocol updates, shedding light on the intricate dynamics at play. From the mechanics of miner signaling to the critical role of community consensus and clear communication, their discourse encapsulated the ongoing efforts to navigate the evolution of Bitcoin's protocol thoughtfully and securely. The conversation not only illuminated the specific challenges related to the Taproot activation but also highlighted the broader theme of fostering innovation while upholding the principles of decentralization and security inherent to Bitcoin's development ethos."
}