{
    "id": "bitcointranscripts+bit-block-boom+2019+accumulating-bitcoin",
    "title": "Accumulating Bitcoin",
    "body_formatted": "{\"type\":\"heading\",\"text\":\"Introduction\"}, {\"type\":\"paragraph\",\"text\":\"Today I am going to be preaching to the choir I think. Hopefully I will be reiterating and reinforcing some points that you already know but maybe forgot to bring up with your nocoiner friends, or learning something new. I hope there's something for everyone in here.\"}, {\"type\":\"paragraph\",\"text\":\"Q: Should I buy bitcoin?\"}, {\"type\":\"paragraph\",\"text\":\"A: Yes.\"}, {\"type\":\"paragraph\",\"text\":\"Q: Are you going to troll a journalist?\"}, {\"type\":\"paragraph\",\"text\":\"A: Today? Already done.\"}, {\"type\":\"heading\",\"text\":\"Misconceptions\"}, {\"type\":\"paragraph\",\"text\":\"One of the biggest misconceptions I heard when I first learned about bitcoin was that bitcoin was just a payments system. If you read the whitepaper, then you read this and you think okay it lets me transfer value without a trusted third party. The whitepaper doesn't say anything at all about bitcoin's monetary policy. It doesn't talk about the cap. It doesn't talk about the halving, or all of this scarcity. It has been very easy for folks to overlook that bitcoin inherently de facto as it how it exists in the world is not just a payments technology. It is also a savings technology, as well.\"}, {\"type\":\"paragraph\",\"text\":\"When money is on your balance sheet, if you have ever taken an accounting class, which you should, then that money is considered savings. This is where you put money to work to pay employees and suppliers to generate sales and generate a profit, that's investment. Savings is just holding cash on your balance sheet. You're deferring your decision about when and what to invest in. Savings is a crucial part of the economic process for people being able to allocate their capital across time so that they don't make a rash investment or a compulsive investment decision.\"}",
    "body": "## Introduction\n\nToday I am going to be preaching to the choir I think. Hopefully I will be reiterating and reinforcing some points that you already know but maybe forgot to bring up with your nocoiner friends, or learning something new. I hope there's something for everyone in here.\n\nQ: Should I buy bitcoin?\n\nA: Yes.\n\nQ: Are you going to troll a journalist?\n\nA: Today? Already done.\n\n## Misconceptions\n\nOne of the biggest misconceptions I heard when I first learned about bitcoin was that bitcoin was just a payments system. If you read the whitepaper, then you read this and you think okay it lets me transfer value without a trusted third party. The whitepaper doesn't say anything at all about bitcoin's monetary policy. It doesn't talk about the cap. It doesn't talk about the halving, or all of this scarcity. It has been very easy for folks to overlook that bitcoin inherently de facto as it how it exists in the world is not just a payments technology. It is also a savings technology, as well.\n\nWhen money is on your balance sheet, if you have ever taken an accounting class, which you should, then that money is considered savings. This is where you put money to work to pay employees and suppliers to generate sales and generate a profit, that's investment. Savings is just holding cash on your balance sheet. You're deferring your decision about when and what to invest in. Savings is a crucial part of the economic process for people being able to allocate their capital across time so that they don't make a rash investment or a compulsive investment decision.\n\n\n\n\n\n",
    "body_type": "markdown",
    "created_at": null,
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/bit-block-boom/2019/accumulating-bitcoin",
    "categories": [
        "conference"
    ],
    "media": "https://www.youtube.com/watch?v=eDsK4OpB69Q",
    "authors": [
        "Pierre Rochard"
    ],
    "indexed_at": "2024-03-21T16:33:35.935Z",
    "transcript_by": "Bryan Bishop",
    "summary": "In a recent podcast episode, Pierre Rochard shared his insights on the multifaceted nature of Bitcoin, aiming to clarify common misconceptions and shed light on its broader implications beyond mere transactions. He commenced by addressing the audience's potential familiarity with the subject, expressing his intention to reinforce known concepts while introducing potentially new perspectives, particularly for those skeptical about Bitcoin.\n\nRochard tackled a prevalent misunderstanding head-on: the notion of Bitcoin as solely a payment system. This perspective, he argued, is limited and overlooks Bitcoin's significant role in monetary policy and savings. Drawing from the original whitepaper, he pointed out that while it does emphasize Bitcoin's ability to facilitate value transfer without intermediaries, it conspicuously omits mention of its monetary aspects such as the supply cap and halving events. These omissions, according to Rochard, have led to an underappreciation of Bitcoin's capacity to function as a robust savings mechanism.\n\nExpanding on the concept of Bitcoin as a savings technology, Rochard delved into the economic principles underlying savings and investment. He explained that from an accounting perspective, money held on a balance sheet is not idle; rather, it represents deferred investment decisions. Savings, thus, play a critical role in the economic process, allowing individuals and entities to judiciously allocate capital over time. This avoids hasty or ill-considered investments, underscoring Bitcoin's utility in fostering sound financial planning and decision-making.\n\nThroughout the discussion, Rochard reiterated the importance of understanding Bitcoin's dual utility as both a payment and savings tool. He emphasized that this dual functionality makes Bitcoin a unique asset in the digital age, challenging the audience to reconsider any preconceived notions and appreciate the broader economic implications of Bitcoin's design and adoption."
}