{
    "id": "bitcointranscripts+bit-block-boom+2019+building-vibrant-bitcoin-communities",
    "title": "Building Vibrant Bitcoin Communities",
    "body_formatted": "{\"type\":\"paragraph\",\"text\":\"Building vibrant bitcoin communities\"}, {\"type\":\"paragraph\",\"text\":\"I am the content manager at Exodus Wallet. I have been helping to build up a userbase over the last few years. We are going to talk about building vibrant bitcoin communities. This is the antithesis of Michael Goldstein's talk.\"}, {\"type\":\"paragraph\",\"text\":\"I want to bring positive dynamics to the communities that we participate in. Bitcoin has a few problems we need to overcome. The problem is Craig Wright. Well, the problem is Roger Ver. If you take the personalities out of it, the problem is actually the pile of shitcoins. The real problem is actually all three of those, as well as a bunch of other stuff.\"}, {\"type\":\"paragraph\",\"text\":\"Bitcoin has fragmented communities, with strong dissenting voices talking to politics. This is confusing to beginners. When someone first comes into crypto, they see some pretty fragmented communities. They see a lot of strong dissenting voices. Personally, crypto is an escape. It's something different from what they're used to-- being abused by the traditional financial systems. When we start sounding like, mainstream political stuff, if somebody is looking for something different they are either going to dig in and join one side or another, or they are just going to give up and go somewhere else. When I say go somewhere else, they will find a somewhat closed off community that has had an ICO at one point in time, until eventually hopefully they realize that's not the place to be as far as their financial future is concerned, it's going to be bitcoin.\"}, {\"type\":\"paragraph\",\"text\":\"For the people who choose their own adventure, the first thing they are going to find is the asset that has the most recognition and it's almost a brand and it gets more coverage than anything. Once they do, then what? They are going to go look at cryptocompare or coinmarketcap and see thousands, literally thousands of altcoins that are there only to compete for their attention. Remember, these people are looking to get into bitcoin; they have no idea what bitcoin is, and coinmarketcap just adds more to the confusion.\"}, {\"type\":\"paragraph\",\"text\":\"I am sure that anyone that got into this ecosystem in late 2017, I am sure you can understand because that was the season of the ICO. And the price of Bitcoin was going up, and there were many more eyeballs on bitcoin. There are some still here who got in at that time, and they are now OGs because they weathered the bear market. You're a true believer.\"}, {\"type\":\"paragraph\",\"text\":\"Some of the barriers to the understandability of what bitcoin is, and this is the opposite of the last talk where we dove into technical aspects of what bitcoin is... the terms we use are great for us, we can understand them, we've talked iwth people. But if I am a noob, then I don't get what this stuff is: bech32, block explorer, coinjoin, private keys, confirmation time, segwit, blockchain, UTXO, fork, mass adoption, FinCen, full node, hashrate, mass adoption, DeFi, mixing, 2FA, hashrate, etc. This is understood by a whole group of people who has been forcefed by the mass media that bitcoin is only used for criminality, which is all they hear until they start to see some price. Then what happens is they start looking, and they get confused. They don't understand that bitcoin is the mechanism to eliminate the extremes of poverty in the world. They don't understand that bitcoin lets them do savings that actually work.\"}, {\"type\":\"paragraph\",\"text\":\"Somebody dives in for the first time, and they are going to start with a google search. They will find a lot of people talking about trading and a lot of people talking about price, which is great, but they might not be interested in that. They are going to see a lot of articles about government regulation, which may go over their head. Remember, when you say 2FA, these people have no idea what any of this means. For me, personally, I have an interest but it's not a party I would want to go to. Soon, they will start investigating and find some stuff out.\"}, {\"type\":\"paragraph\",\"text\":\"Back to community building. This is where community building starts. It starts in our social networks. It could be IRL just like here. This is what I would consider to be a vibrant community after talking with some of you last night at the SNI dinner. What we need to do is, we're building or participating in communities. Be as passionate about the community as we are about bitcoin. That's important. Bitcoin is a technology, it doesn't care about you. People care about people. We have to decide what our community is going to look like. Bitstein's meme game is on, and he has decided what his community is going to look like. We have to decide what it is going to look like, before we start building it.\"}, {\"type\":\"paragraph\",\"text\":\"What does it take to start building a strong community? It means relating to people who are using this technology as a goal. Bitcoin is as far as technology goes, if you're a computer scientist that's great, if you can barely read English then we have to provide spaces for those people to play as well. For anybody who works in this industry, who builds anything for this ecosystem, there's a tremendous focus on customers.\"}, {\"type\":\"paragraph\",\"text\":\"Why should we focus on the customers? Well, because they are the humans who are using or who we want to be using our products. We can code and design whatever we want and think it's the best thing since sliced bread, but you need to know people in your community and without that, you don't actually know what you are building for. What's the best way to help each person with a tech support problem? This creates trust and loyalty, which are two pillars of any successful community. If somebody trusts that the community has got their back, then they are going to want to jump in and help.\"}, {\"type\":\"paragraph\",\"text\":\"Why do I feel the ecosystem has a long way to go? I'm painting with a broad brush stroke. There are many people in this very room who do tremendous amounts of work to help people understand what bitcoin is, and to help build these communities that we want people to be part of. I feel that we have a long way to go. I'm always on the lookout for people to hire and do community support. We start by giving them a test that we use to screen all of our job applicants. This test is wrapped in the language of technology that requires some amount of technical skill to answer. The test is made up of real questions by real problems that they have emailed us. So we put some of these questions together and we put them in the test. Now, the test is not a technical test. It's an empathy test. It's a technical test wrapped in empathy. It's not can you give the right answer, it's about how you give the answer. How are we providing enough empathy that people actually want to come back? Most of the people in the crypto world, by and large, and there's some exceptions, by and large people who apply that are in the industry or are in the ecosystem, don't have empathy because I hate them and can't emphathize with their version of empathy. Why do they fail? Because it's an empathy test; they failed to care about the person on the other end of this answer. Most of them have a lot of ego. They are not considering where they might have been when they first heard the word \\\"bitcoin\\\". That's important for all of us. Also, they tend to cast blame on other people, and they don't ask questions from the troubled customer. Without questions, it's half-assed support. It's not helping anyone be successful. Someone who has just found out about bitcoin and has some on Coinbase, they don't know what the hell a private key is so you shouldn't just tell them to use a private key. You need to empower people to take control of how they participate in the ecosystem.\"}, {\"type\":\"paragraph\",\"text\":\"There are some best practices. You need to put the community at the center of everything you do, because you're a part of it. Decide what you want it to look like. You're going to try to participate in a community that you feel you can trust and appreciates you for being there with them. Be curious, ask questions, get to know people.  Instead of just trolling, which has its place, I'm not saying it doesn't, when you're building a community-- get to know the people by asking questions. We're building relationships with each other, and you can't do that through tech unless you're not incompetent. Just because I have a great app on my phone that you built, that doesn't make us friends.\"}, {\"type\":\"paragraph\",\"text\":\"Some best practices to overcome these challenges include finding people who are not currently entrenched in the community. What is this going to look like when my kids are my age? What is it going to look like when my grandchildren are my age? Bitcoin right now, bitcoin will not be an outlier of finance.\"}",
    "body": "\nBuilding vibrant bitcoin communities\n\nI am the content manager at Exodus Wallet. I have been helping to build up a userbase over the last few years. We are going to talk about building vibrant bitcoin communities. This is the antithesis of Michael Goldstein's talk.\n\nI want to bring positive dynamics to the communities that we participate in. Bitcoin has a few problems we need to overcome. The problem is Craig Wright. Well, the problem is Roger Ver. If you take the personalities out of it, the problem is actually the pile of shitcoins. The real problem is actually all three of those, as well as a bunch of other stuff.\n\nBitcoin has fragmented communities, with strong dissenting voices talking to politics. This is confusing to beginners. When someone first comes into crypto, they see some pretty fragmented communities. They see a lot of strong dissenting voices. Personally, crypto is an escape. It's something different from what they're used to-- being abused by the traditional financial systems. When we start sounding like, mainstream political stuff, if somebody is looking for something different they are either going to dig in and join one side or another, or they are just going to give up and go somewhere else. When I say go somewhere else, they will find a somewhat closed off community that has had an ICO at one point in time, until eventually hopefully they realize that's not the place to be as far as their financial future is concerned, it's going to be bitcoin.\n\nFor the people who choose their own adventure, the first thing they are going to find is the asset that has the most recognition and it's almost a brand and it gets more coverage than anything. Once they do, then what? They are going to go look at cryptocompare or coinmarketcap and see thousands, literally thousands of altcoins that are there only to compete for their attention. Remember, these people are looking to get into bitcoin; they have no idea what bitcoin is, and coinmarketcap just adds more to the confusion.\n\nI am sure that anyone that got into this ecosystem in late 2017, I am sure you can understand because that was the season of the ICO. And the price of Bitcoin was going up, and there were many more eyeballs on bitcoin. There are some still here who got in at that time, and they are now OGs because they weathered the bear market. You're a true believer.\n\nSome of the barriers to the understandability of what bitcoin is, and this is the opposite of the last talk where we dove into technical aspects of what bitcoin is... the terms we use are great for us, we can understand them, we've talked iwth people. But if I am a noob, then I don't get what this stuff is: bech32, block explorer, coinjoin, private keys, confirmation time, segwit, blockchain, UTXO, fork, mass adoption, FinCen, full node, hashrate, mass adoption, DeFi, mixing, 2FA, hashrate, etc. This is understood by a whole group of people who has been forcefed by the mass media that bitcoin is only used for criminality, which is all they hear until they start to see some price. Then what happens is they start looking, and they get confused. They don't understand that bitcoin is the mechanism to eliminate the extremes of poverty in the world. They don't understand that bitcoin lets them do savings that actually work.\n\nSomebody dives in for the first time, and they are going to start with a google search. They will find a lot of people talking about trading and a lot of people talking about price, which is great, but they might not be interested in that. They are going to see a lot of articles about government regulation, which may go over their head. Remember, when you say 2FA, these people have no idea what any of this means. For me, personally, I have an interest but it's not a party I would want to go to. Soon, they will start investigating and find some stuff out.\n\nBack to community building. This is where community building starts. It starts in our social networks. It could be IRL just like here. This is what I would consider to be a vibrant community after talking with some of you last night at the SNI dinner. What we need to do is, we're building or participating in communities. Be as passionate about the community as we are about bitcoin. That's important. Bitcoin is a technology, it doesn't care about you. People care about people. We have to decide what our community is going to look like. Bitstein's meme game is on, and he has decided what his community is going to look like. We have to decide what it is going to look like, before we start building it.\n\nWhat does it take to start building a strong community? It means relating to people who are using this technology as a goal. Bitcoin is as far as technology goes, if you're a computer scientist that's great, if you can barely read English then we have to provide spaces for those people to play as well. For anybody who works in this industry, who builds anything for this ecosystem, there's a tremendous focus on customers.\n\nWhy should we focus on the customers? Well, because they are the humans who are using or who we want to be using our products. We can code and design whatever we want and think it's the best thing since sliced bread, but you need to know people in your community and without that, you don't actually know what you are building for. What's the best way to help each person with a tech support problem? This creates trust and loyalty, which are two pillars of any successful community. If somebody trusts that the community has got their back, then they are going to want to jump in and help.\n\nWhy do I feel the ecosystem has a long way to go? I'm painting with a broad brush stroke. There are many people in this very room who do tremendous amounts of work to help people understand what bitcoin is, and to help build these communities that we want people to be part of. I feel that we have a long way to go. I'm always on the lookout for people to hire and do community support. We start by giving them a test that we use to screen all of our job applicants. This test is wrapped in the language of technology that requires some amount of technical skill to answer. The test is made up of real questions by real problems that they have emailed us. So we put some of these questions together and we put them in the test. Now, the test is not a technical test. It's an empathy test. It's a technical test wrapped in empathy. It's not can you give the right answer, it's about how you give the answer. How are we providing enough empathy that people actually want to come back? Most of the people in the crypto world, by and large, and there's some exceptions, by and large people who apply that are in the industry or are in the ecosystem, don't have empathy because I hate them and can't emphathize with their version of empathy. Why do they fail? Because it's an empathy test; they failed to care about the person on the other end of this answer. Most of them have a lot of ego. They are not considering where they might have been when they first heard the word \"bitcoin\". That's important for all of us. Also, they tend to cast blame on other people, and they don't ask questions from the troubled customer. Without questions, it's half-assed support. It's not helping anyone be successful. Someone who has just found out about bitcoin and has some on Coinbase, they don't know what the hell a private key is so you shouldn't just tell them to use a private key. You need to empower people to take control of how they participate in the ecosystem.\n\nThere are some best practices. You need to put the community at the center of everything you do, because you're a part of it. Decide what you want it to look like. You're going to try to participate in a community that you feel you can trust and appreciates you for being there with them. Be curious, ask questions, get to know people.  Instead of just trolling, which has its place, I'm not saying it doesn't, when you're building a community-- get to know the people by asking questions. We're building relationships with each other, and you can't do that through tech unless you're not incompetent. Just because I have a great app on my phone that you built, that doesn't make us friends.\n\nSome best practices to overcome these challenges include finding people who are not currently entrenched in the community. What is this going to look like when my kids are my age? What is it going to look like when my grandchildren are my age? Bitcoin right now, bitcoin will not be an outlier of finance.\n\n\n\n",
    "body_type": "markdown",
    "created_at": null,
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/bit-block-boom/2019/building-vibrant-bitcoin-communities",
    "categories": [
        "conference"
    ],
    "authors": [
        "Kris Merkel"
    ],
    "indexed_at": "2024-03-21T16:33:35.936Z",
    "transcript_by": "Bryan Bishop",
    "summary": "In a recent discussion led by Kris Merkel, the content manager at Exodus Wallet, the conversation veered towards the cultivation of vibrant Bitcoin communities, setting itself apart from previous discussions on the subject. Merkel aimed to inject positivity into these communities, emphasizing the need for overcoming certain challenges to foster a welcoming environment for newcomers. He identified the primary obstacles as divisive figures within the space, the confusion caused by the proliferation of altcoins, and a general misunderstanding of what Bitcoin represents.\n\nMerkel pointed out that new entrants to the cryptocurrency world are often met with fragmented communities and a barrage of technical jargon that can be off-putting. This complexity and internal discord serve to alienate those seeking refuge from traditional financial systems, potentially driving them towards less reliable crypto ventures before they fully appreciate the value and stability offered by Bitcoin. The plethora of altcoins, especially during the ICO boom of late 2017, adds to this confusion, making it difficult for novices to discern where to place their trust and investment.\n\nAddressing another significant barrier—the dense cloud of technical terminology surrounding Bitcoin—Merkel stressed the importance of making the technology accessible and understandable to all, regardless of their background. The use of terms like \"bech32\", \"segwit\", and \"UTXO\" without proper context or explanation can overwhelm those new to the space, overshadowing Bitcoin's potential to mitigate financial inequality through effective savings mechanisms.\n\nTo bridge this gap, Merkel advocated for community building that starts with genuine human connections, both online and in real life. He highlighted the necessity of fostering trust and loyalty within these communities, underscoring that technology should serve to bring people together rather than create divisions. By focusing on empathy and understanding the customer's perspective, those involved in the Bitcoin ecosystem can build supportive environments that encourage participation and education.\n\nFurthermore, Merkel emphasized the role of empathy in customer support within the Bitcoin community, illustrating how an empathetic approach not only resolves technical issues but also builds a supportive network for users. By prioritizing the community's needs and fostering a culture of curiosity and relationship-building, Bitcoin enthusiasts can ensure the technology remains inclusive and accessible.\n\nIn conclusion, Kris Merkel's discussion sheds light on the critical need for Bitcoin communities to focus on inclusivity, understanding, and support to flourish. By addressing the challenges posed by confusing jargon, divisive figures, and the overwhelming presence of altcoins, and by emphasizing empathy and human connection, these communities can attract and retain individuals looking to explore the benefits of Bitcoin. As the cryptocurrency landscape evolves, the focus must remain on creating spaces where everyone, regardless of their technical proficiency or financial background, feels welcomed and valued."
}