{
    "id": "bitcointranscripts+bit-block-boom+2019+how-to-meme-bitcoin-to-the-moon",
    "title": "How To Meme Bitcoin To The Moon",
    "body_formatted": "{\"type\":\"heading\",\"text\":\"Introduction\"}, {\"type\":\"paragraph\",\"text\":\"How many of y'all were at the dinner last night? Okay, great. I had a lot of fun. It was fantastic. I don't know how we will beat it next year, but we will figure something out. I am Michael Goldstein, and welcome to my ridiculous tedtalk. A lot of people talk about price fundamentals, but I am going to talk about how to troll and take the curves hard.\"}, {\"type\":\"paragraph\",\"text\":\"A month ago today, a pivotal moment in US history occurred in the US congress. The honorable representative Warren Davidson declared on congressional record that there is bitcoin, and then there is shitcoin. I shared the expression of the woman on the right-- exact same feeling.\"}, {\"type\":\"paragraph\",\"text\":\"We have also had guys like Joe Kernan on CBNC Squawk Box which is suddenly my favorite show, saying look at the stock-to-flow at the next halvings. He was saying $55k after the next halving. A little bearish, but okay.\"}, {\"type\":\"paragraph\",\"text\":\"This is our meme world, and everyone else is just living in it.\"}, {\"type\":\"heading\",\"text\":\"Defining the memetic landscape\"}, {\"type\":\"paragraph\",\"text\":\"We live in a world where we're inundated with social media, podcastings, fox and carrier pigeons, whatever you need to get messages out ther,e we have infomration overflow. My mind can only handle so much information at a time, I don't know about Bryan but-- our ability to process it all is extremely scarce. In order to get messages across, we need to be able to create memes that are efficient and extremely well crafted. We're getting to the floor of Congress now. We're not just playing around with magic internet money, we're engaging in advanced geopolitical meme craft and we're shaping civilization for centuries and we have to get our message out.\"}, {\"type\":\"heading\",\"text\":\"The path to victory\"}, {\"type\":\"paragraph\",\"text\":\"Frankly, no one person matters that much. This is really just all fun and games while the macroeconomics of hard money does what it does, which is dominate. In the mean time, we can have a lot of fun and expedite the process by finding people at the margins and teach them new information about what we know about the world, and also bully the people that don't agree with us.\"}, {\"type\":\"heading\",\"text\":\"Rhetoric vs dialectic\"}, {\"type\":\"paragraph\",\"text\":\"A very important concept in communication comes from Aristotle in this distinction. This is an important thing to understand when you are engaging people. Rhetoric is the art of persuasion. How do you convince people to take up a new idea or change their minds? Dialectic is the art of argumentation. When I say argumentation, I mean that in a strict debate sense where you are working through things in a logical method. Memes are rhetoric, whereas dialectic is not.\"}, {\"type\":\"paragraph\",\"text\":\"Rhetoric is good for public discussion, defending or accusing others. When people are hurling other memes back at you, the art of rhetoric lets you fence against it and perry against each attack.\"}, {\"type\":\"paragraph\",\"text\":\"Dialectic on the other hand is systematic logical discussion and method of finding truth. That is more good for private or academic discussion. Thta's good for people where you can agree on certain principles ahead of time so that you don't wallow around in the mud. You are both working together, and you might disagree, but you are working together to elucidate some bigger truth. You need to be on the same team to be able to do that.\"}, {\"type\":\"heading\",\"text\":\"When to argue, and when to troll\"}, {\"type\":\"paragraph\",\"text\":\"Arguing, like debate, that's with other bitcoin maximalists. It's people who-- or they can be pre-coiners. People who are interested in actually learning with you, like coming to that truth along with you. But everyone in the outgroup like shitcoiners, nocoiners, journalists, especially journalists, they only get trolling. Basically anyone with a blue checkmark on twitter, until proven innocent, will get the heavy hand of absolute trolling. There's no reason to ever engage in someone who is not willing to understand your position in a good systematic logical way. That doesn't mean you're constnatly always talking like that, but if they are not willing to take your ideas seriously, then there's no reason to engage them in a way that assumes they are that kind of person, they do not deserve it and they have not shown they have deserved it.\"}, {\"type\":\"paragraph\",\"text\":\"It's an important thing to have echo chambers. It lets you cultivate a group of people who can share these ideas. It's also a group that you actually trust to be able to give you good information and feedback. It doesn't mean that everyone in the echo chamber agree on everything, it means that they are on the same team and are trying to get the same thing together.\"}, {\"type\":\"paragraph\",\"text\":\"You're not really talking to the people who you are replying to on twitter; it is for the other people. Really the purpose of engaging in a hostile fashion is to broadcast to other people who might be looking in.\"}, {\"type\":\"paragraph\",\"text\":\"You must understand, who is your actual audience? You need to communicate based on that, rather than assuming everyone is there to find a bigger truth. Some people just want to nocoin.\"}, {\"type\":\"heading\",\"text\":\"Relentless propaganda\"}, {\"type\":\"paragraph\",\"text\":\"Relentless propaganda every single day, just do it. Pump it out. This is good for bitcoin. There is no bad news for bitcoin. Bitcoin is anti-fragile and overcomes all obstacles. Bitcoin Tina understands, correct. Anything you're broadcasting should be relentlessly positive, because there is no bad news for bitcoin, only good news for bitcoin.\"}, {\"type\":\"paragraph\",\"text\":\"We should always anchor on the most bullish position. You should never be afraid to take the possibilities to their logical extreme, and from there work reality into your model with nuance as necessary, as needed, and as deserved. A nocoiner doe snot necessarily need to understand that \\\"oh we might be going to $99m instead of $100m/coin\\\". Always give them the most bullish; their opinion isn't merely wrong, it's completely wrong.\"}, {\"type\":\"heading\",\"text\":\"Always be bullish\"}, {\"type\":\"paragraph\",\"text\":\"If someone says \\\"bitcoin is not going to change the economy\\\", no, you say: bitcoin is going to reshape civilization for the glorious future. Always be bullish. Learn to code.\"}, {\"type\":\"heading\",\"text\":\"Trigram memes good\"}, {\"type\":\"paragraph\",\"text\":\"Three word memes are very powerful. We learned this from \\\"the art of the meme\\\" himself, the President of the US-- Donald Trump--- orange coin good, number go up, bitcoin fixes this. These are powerful memes. They are so simple, that to an outsider it seems repetitive and droning and ridiculous, yet for us insiders, \\\"orange coin goods\\\"-- we're talking about the ethical implications of money production. \\\"Number go up\\\", we're talking about bitcoin being the most liquid good and liquid goods have a positive feedback loop. Outsiders don't get that, they just see \\\"number go up\\\". And \\\"bitcoin fixes this\\\"-- bitcoin as a tool for division of labor or whatever; but for them they ask, how do you think bitcoin fixes the food supply and modern art and real estate? It literally fixes all of that, by the way.\"}, {\"type\":\"heading\",\"text\":\"In-group techniques\"}, {\"type\":\"paragraph\",\"text\":\"You still need propaganda. You need a way to remind people why they are here. It's important to be witty, fun, memorable and find mental models that just stick. So you're able to boil things down into something that is three words. How do you get these complex ideas into three words? Bitcoin governance was boiled down to \\\"Mexican standoff\\\" --- or the geopolitics and the inevitability of bitcoin, done the same. You should also never be tired of sharing important actual knowledge to the world. There is no such thing as too much Austrian economics content. I need to see more Rothbartt people, get out there. For the in-group, this is a great way to be pumping people up and getting the knowledge out that helps craft greater memes as we go forward.\"}, {\"type\":\"heading\",\"text\":\"Relentless propaganda again\"}, {\"type\":\"paragraph\",\"text\":\"Rule number 2: Nocoiners must be crushed. When I say nocoiners, I don't mean someone who merely doesn't own bitcoin-- most of those are pre-coiners. We take care of our pre-coiners and love them. Nocoiners are people who don't own bitcoin, and they hate bitcoin. They must all be crushed. They are supporters of a massively destructive economic system that is both a historical abberation and completely unnecessary. Show no mercy. They deserve absolutely no mercy.\"}, {\"type\":\"heading\",\"text\":\"Out-group techniques\"}, {\"type\":\"paragraph\",\"text\":\"This is the concept of re-framing, agreeing and amplifying, and the concept of dominating.\"}, {\"type\":\"paragraph\",\"text\":\"Reframe: the importance of reframing is that no person in the outgroup should be defining your narrative for you. If that happens, you lose. They set the boundaries for you and tells you what is good and bad, but they aren't on your side. You know what is good and bad, so you get to set it yourself. When Vitalik was coming out and talking about bitcoin maximalists-- that was fine, we're maximalists, whatever. Reframing is how we took maximalist and turned it from a pejorative into a badge of honor. Same thing with \\\"toxic\\\". When Vitalik was saying this, he was saying bitcoin maximalists are people that think everything in the world should be on the bitcoin blockchain-- so ethereum should not have been its own chain, it should be on the bitcoin blockchain. But actually most of our positions is that we don't need any of that, we just want digital cash. So if you fall into Vitalik's frame, you say you need ethereum on bitcoin, but in fact we never wanted that. We just wanted a sound money for the digital age. Reset the frame and re-take the term.\"}, {\"type\":\"paragraph\",\"text\":\"Another re-frame is this: Anyone who is actually anti-bitcoin is a bitcoin accelerationist. Donald Trump gets on twitter and says the fed should be destroying the dollar faster, then clearly the guy is way more bitcoin maximalist than I thought. We all need to learn to hate the US dollar as much as Trump does.\"}, {\"type\":\"paragraph\",\"text\":\"Agree and amplify: There's a lot of different stuff you can find online about this. When you're memeing about bitcoin, you accept correct, but incorrectly labeled bad premises, and then you take it way further than they even thought. The classic example is where people talk about bitcoin and energy production and they say oh no look at how much energy bitcoin uses. They think that energy production is bad. I on the other hand, I have read \\\"The moral case for fossil fuels\\\" and I know that fossil fuels are associated with human flourishing and we're going to take tihs all the way. So if bitcoin is only going to produce as much energy as Denmark, no let's get the number to go up, we're going to build dyson spheres around the sun and soak up entire solar systems. We're going to do this. Don't just say the banking system uses energy or military uses energy, no, we want energy production, we want to take it all the way. Agree and amplify.\"}, {\"type\":\"paragraph\",\"text\":\"Dominate it: nocoiners are supporitng a massively destructive economic system. They are paid shills. Most nocoiners are ultimately paid shills of this massively destructive economic system. Being nice takes energy. Why should they deserve? Why should I expend that energy? These people are the enemy. They deserve nothing except extreme scorn. Nocoiners should be made to feel pain. Many of them have made fun of bitcoin for so long, but meanwhile we've been doing great, \\\"number go up\\\". Angry pink man good-- the more lojacks in the world, the better. So make those memes.\"}, {\"type\":\"paragraph\",\"text\":\"Ad hominen: sometimes you have to insult people because they deserve it. It is important to understand that in the course of online discussion, this comes up all the time when people accuse you like \\\"how dare you use ad hominen\\\". An ad hominen is rejecting an argument merely because of the person who says it, which says logic is somehow different from them because the preconditions of their existence. However, that's clearly not true, because logic is just logic, and I should say, there is in fact an objective truth. An insult is treating a person with contempt or rudeness. Know the difference. There was a great article called \\\"The ad hominen fallacy fallacy\\\" showing examples of how people take insults and mistake them for ad hominens.\"}, {\"type\":\"paragraph\",\"text\":\"No apologies: there is never a reason to give an apology, especially to a nocoiner. I was skeptical once, and I thought bitcoin was a fiat currency-- I thought it was by decree. Satoshi praise be upon him, he was probably the only one who was never a nocoiner. Maybe Hal Finney as well. They will learn, not just because someone insults them online, but because someone realizes they can't get rid of dollars anymore and they are forced to use bitcoin. If someone is unwilling to take on your \\\"untolerate, toxic opinion\\\" then they are also not the people you can take serious actually correct but unpopular ideas. If they are treating ideas with such contempt, you can't expect them to take it to the full extent in the first place. They have simply not deserved yet to have actual discussion. They need to prove they are capable of it.\"}, {\"type\":\"paragraph\",\"text\":\"Reject nocoiner orthodoxy. Do not fall into their frame. Show no mercy. Always remind them \\\"orange coin good, number go up\\\".\"}, {\"type\":\"heading\",\"text\":\"Requirements for successful memeing\"}, {\"type\":\"paragraph\",\"text\":\"You need to read the books. Get knowledge. Read all the classics-- computer science, hard money, networks, you need to fully understand bitcoin if you want to actually have yourself armed to be able to go out and make memes. You can't just show up and be an idiot, you will be found out. Likewise, you need to find actual truth. There's plenty of methods of trolling online where you don't need to know anything, and you're just trying to get a rise out of someone. I am in fact calling for ethical trolling, conscious memeing if you will. It's important to always be right. Also, you need confidence and you need to be able to stand up for the ideas that you believe. You did the work, and you proved it, and it comes out in the form of a nice little meme.\"}, {\"type\":\"paragraph\",\"text\":\"Memecrafting does not transpire in a day. It took years from us calling litecoin a shitcoin in 2013 to it being named as a technical term on the congressional floor. Because of this, this is why it is so important to stick to the truth. There's a time prefence here. Sticking to the truth gives you a long term focus that drives you towards good valuable content for perpituity.\"}, {\"type\":\"paragraph\",\"text\":\"Ethical trolling is more than just getting a rise of people. There's a fantastic essay called \\\"Live not by lies\\\", and he took up the objective of rejecting all falsehoods in his life. He didn't want to tell any lies, nor read any lies in the newspaper. He always wanted to take on the truth. It's in your advantage to not read hte news anyway, because it's full of bluecheck nocoiners spreading lies about bitcoin anyway.\"}, {\"type\":\"heading\",\"text\":\"Recommended reading\"}, {\"type\":\"list\"}",
    "body": "## Introduction\n\nHow many of y'all were at the dinner last night? Okay, great. I had a lot of fun. It was fantastic. I don't know how we will beat it next year, but we will figure something out. I am Michael Goldstein, and welcome to my ridiculous tedtalk. A lot of people talk about price fundamentals, but I am going to talk about how to troll and take the curves hard.\n\nA month ago today, a pivotal moment in US history occurred in the US congress. The honorable representative Warren Davidson declared on congressional record that there is bitcoin, and then there is shitcoin. I shared the expression of the woman on the right-- exact same feeling.\n\nWe have also had guys like Joe Kernan on CBNC Squawk Box which is suddenly my favorite show, saying look at the stock-to-flow at the next halvings. He was saying $55k after the next halving. A little bearish, but okay.\n\nThis is our meme world, and everyone else is just living in it.\n\n## Defining the memetic landscape\n\nWe live in a world where we're inundated with social media, podcastings, fox and carrier pigeons, whatever you need to get messages out ther,e we have infomration overflow. My mind can only handle so much information at a time, I don't know about Bryan but-- our ability to process it all is extremely scarce. In order to get messages across, we need to be able to create memes that are efficient and extremely well crafted. We're getting to the floor of Congress now. We're not just playing around with magic internet money, we're engaging in advanced geopolitical meme craft and we're shaping civilization for centuries and we have to get our message out.\n\n## The path to victory\n\nFrankly, no one person matters that much. This is really just all fun and games while the macroeconomics of hard money does what it does, which is dominate. In the mean time, we can have a lot of fun and expedite the process by finding people at the margins and teach them new information about what we know about the world, and also bully the people that don't agree with us.\n\n## Rhetoric vs dialectic\n\nA very important concept in communication comes from Aristotle in this distinction. This is an important thing to understand when you are engaging people. Rhetoric is the art of persuasion. How do you convince people to take up a new idea or change their minds? Dialectic is the art of argumentation. When I say argumentation, I mean that in a strict debate sense where you are working through things in a logical method. Memes are rhetoric, whereas dialectic is not.\n\nRhetoric is good for public discussion, defending or accusing others. When people are hurling other memes back at you, the art of rhetoric lets you fence against it and perry against each attack.\n\nDialectic on the other hand is systematic logical discussion and method of finding truth. That is more good for private or academic discussion. Thta's good for people where you can agree on certain principles ahead of time so that you don't wallow around in the mud. You are both working together, and you might disagree, but you are working together to elucidate some bigger truth. You need to be on the same team to be able to do that.\n\n## When to argue, and when to troll\n\nArguing, like debate, that's with other bitcoin maximalists. It's people who-- or they can be pre-coiners. People who are interested in actually learning with you, like coming to that truth along with you. But everyone in the outgroup like shitcoiners, nocoiners, journalists, especially journalists, they only get trolling. Basically anyone with a blue checkmark on twitter, until proven innocent, will get the heavy hand of absolute trolling. There's no reason to ever engage in someone who is not willing to understand your position in a good systematic logical way. That doesn't mean you're constnatly always talking like that, but if they are not willing to take your ideas seriously, then there's no reason to engage them in a way that assumes they are that kind of person, they do not deserve it and they have not shown they have deserved it.\n\nIt's an important thing to have echo chambers. It lets you cultivate a group of people who can share these ideas. It's also a group that you actually trust to be able to give you good information and feedback. It doesn't mean that everyone in the echo chamber agree on everything, it means that they are on the same team and are trying to get the same thing together.\n\nYou're not really talking to the people who you are replying to on twitter; it is for the other people. Really the purpose of engaging in a hostile fashion is to broadcast to other people who might be looking in.\n\nYou must understand, who is your actual audience? You need to communicate based on that, rather than assuming everyone is there to find a bigger truth. Some people just want to nocoin.\n\n## Relentless propaganda\n\nRelentless propaganda every single day, just do it. Pump it out. This is good for bitcoin. There is no bad news for bitcoin. Bitcoin is anti-fragile and overcomes all obstacles. Bitcoin Tina understands, correct. Anything you're broadcasting should be relentlessly positive, because there is no bad news for bitcoin, only good news for bitcoin.\n\nWe should always anchor on the most bullish position. You should never be afraid to take the possibilities to their logical extreme, and from there work reality into your model with nuance as necessary, as needed, and as deserved. A nocoiner doe snot necessarily need to understand that \"oh we might be going to $99m instead of $100m/coin\". Always give them the most bullish; their opinion isn't merely wrong, it's completely wrong.\n\n## Always be bullish\n\nIf someone says \"bitcoin is not going to change the economy\", no, you say: bitcoin is going to reshape civilization for the glorious future. Always be bullish. Learn to code.\n\n## Trigram memes good\n\nThree word memes are very powerful. We learned this from \"the art of the meme\" himself, the President of the US-- Donald Trump--- orange coin good, number go up, bitcoin fixes this. These are powerful memes. They are so simple, that to an outsider it seems repetitive and droning and ridiculous, yet for us insiders, \"orange coin goods\"-- we're talking about the ethical implications of money production. \"Number go up\", we're talking about bitcoin being the most liquid good and liquid goods have a positive feedback loop. Outsiders don't get that, they just see \"number go up\". And \"bitcoin fixes this\"-- bitcoin as a tool for division of labor or whatever; but for them they ask, how do you think bitcoin fixes the food supply and modern art and real estate? It literally fixes all of that, by the way.\n\n## In-group techniques\n\nYou still need propaganda. You need a way to remind people why they are here. It's important to be witty, fun, memorable and find mental models that just stick. So you're able to boil things down into something that is three words. How do you get these complex ideas into three words? Bitcoin governance was boiled down to \"Mexican standoff\" --- or the geopolitics and the inevitability of bitcoin, done the same. You should also never be tired of sharing important actual knowledge to the world. There is no such thing as too much Austrian economics content. I need to see more Rothbartt people, get out there. For the in-group, this is a great way to be pumping people up and getting the knowledge out that helps craft greater memes as we go forward.\n\n## Relentless propaganda again\n\nRule number 2: Nocoiners must be crushed. When I say nocoiners, I don't mean someone who merely doesn't own bitcoin-- most of those are pre-coiners. We take care of our pre-coiners and love them. Nocoiners are people who don't own bitcoin, and they hate bitcoin. They must all be crushed. They are supporters of a massively destructive economic system that is both a historical abberation and completely unnecessary. Show no mercy. They deserve absolutely no mercy.\n\n## Out-group techniques\n\nThis is the concept of re-framing, agreeing and amplifying, and the concept of dominating.\n\nReframe: the importance of reframing is that no person in the outgroup should be defining your narrative for you. If that happens, you lose. They set the boundaries for you and tells you what is good and bad, but they aren't on your side. You know what is good and bad, so you get to set it yourself. When Vitalik was coming out and talking about bitcoin maximalists-- that was fine, we're maximalists, whatever. Reframing is how we took maximalist and turned it from a pejorative into a badge of honor. Same thing with \"toxic\". When Vitalik was saying this, he was saying bitcoin maximalists are people that think everything in the world should be on the bitcoin blockchain-- so ethereum should not have been its own chain, it should be on the bitcoin blockchain. But actually most of our positions is that we don't need any of that, we just want digital cash. So if you fall into Vitalik's frame, you say you need ethereum on bitcoin, but in fact we never wanted that. We just wanted a sound money for the digital age. Reset the frame and re-take the term.\n\nAnother re-frame is this: Anyone who is actually anti-bitcoin is a bitcoin accelerationist. Donald Trump gets on twitter and says the fed should be destroying the dollar faster, then clearly the guy is way more bitcoin maximalist than I thought. We all need to learn to hate the US dollar as much as Trump does.\n\nAgree and amplify: There's a lot of different stuff you can find online about this. When you're memeing about bitcoin, you accept correct, but incorrectly labeled bad premises, and then you take it way further than they even thought. The classic example is where people talk about bitcoin and energy production and they say oh no look at how much energy bitcoin uses. They think that energy production is bad. I on the other hand, I have read \"The moral case for fossil fuels\" and I know that fossil fuels are associated with human flourishing and we're going to take tihs all the way. So if bitcoin is only going to produce as much energy as Denmark, no let's get the number to go up, we're going to build dyson spheres around the sun and soak up entire solar systems. We're going to do this. Don't just say the banking system uses energy or military uses energy, no, we want energy production, we want to take it all the way. Agree and amplify.\n\nDominate it: nocoiners are supporitng a massively destructive economic system. They are paid shills. Most nocoiners are ultimately paid shills of this massively destructive economic system. Being nice takes energy. Why should they deserve? Why should I expend that energy? These people are the enemy. They deserve nothing except extreme scorn. Nocoiners should be made to feel pain. Many of them have made fun of bitcoin for so long, but meanwhile we've been doing great, \"number go up\". Angry pink man good-- the more lojacks in the world, the better. So make those memes.\n\nAd hominen: sometimes you have to insult people because they deserve it. It is important to understand that in the course of online discussion, this comes up all the time when people accuse you like \"how dare you use ad hominen\". An ad hominen is rejecting an argument merely because of the person who says it, which says logic is somehow different from them because the preconditions of their existence. However, that's clearly not true, because logic is just logic, and I should say, there is in fact an objective truth. An insult is treating a person with contempt or rudeness. Know the difference. There was a great article called \"The ad hominen fallacy fallacy\" showing examples of how people take insults and mistake them for ad hominens.\n\nNo apologies: there is never a reason to give an apology, especially to a nocoiner. I was skeptical once, and I thought bitcoin was a fiat currency-- I thought it was by decree. Satoshi praise be upon him, he was probably the only one who was never a nocoiner. Maybe Hal Finney as well. They will learn, not just because someone insults them online, but because someone realizes they can't get rid of dollars anymore and they are forced to use bitcoin. If someone is unwilling to take on your \"untolerate, toxic opinion\" then they are also not the people you can take serious actually correct but unpopular ideas. If they are treating ideas with such contempt, you can't expect them to take it to the full extent in the first place. They have simply not deserved yet to have actual discussion. They need to prove they are capable of it.\n\nReject nocoiner orthodoxy. Do not fall into their frame. Show no mercy. Always remind them \"orange coin good, number go up\".\n\n## Requirements for successful memeing\n\nYou need to read the books. Get knowledge. Read all the classics-- computer science, hard money, networks, you need to fully understand bitcoin if you want to actually have yourself armed to be able to go out and make memes. You can't just show up and be an idiot, you will be found out. Likewise, you need to find actual truth. There's plenty of methods of trolling online where you don't need to know anything, and you're just trying to get a rise out of someone. I am in fact calling for ethical trolling, conscious memeing if you will. It's important to always be right. Also, you need confidence and you need to be able to stand up for the ideas that you believe. You did the work, and you proved it, and it comes out in the form of a nice little meme.\n\nMemecrafting does not transpire in a day. It took years from us calling litecoin a shitcoin in 2013 to it being named as a technical term on the congressional floor. Because of this, this is why it is so important to stick to the truth. There's a time prefence here. Sticking to the truth gives you a long term focus that drives you towards good valuable content for perpituity.\n\nEthical trolling is more than just getting a rise of people. There's a fantastic essay called \"Live not by lies\", and he took up the objective of rejecting all falsehoods in his life. He didn't want to tell any lies, nor read any lies in the newspaper. He always wanted to take on the truth. It's in your advantage to not read hte news anyway, because it's full of bluecheck nocoiners spreading lies about bitcoin anyway.\n\n## Recommended reading\n\n* \"Rejecting nocoiner orthodoxy\" (Elaine Ou)\n\n* \"Rhetoric\" by Aristotle\n\n* \"The art of controversy\" (Arthur Schopenhauer)\n\n* \"Isaiah's Job\" (Albert Jay Nock)\n\n* Live not by lies (Aleksandr Solzhentisynwhatthefuck)\n\n* The bitcoin standard by Saifedean\n\n* The ethics of money production (JOrg Guido Hulsmann)\n\n\n\n",
    "body_type": "markdown",
    "created_at": null,
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/bit-block-boom/2019/how-to-meme-bitcoin-to-the-moon",
    "categories": [
        "conference"
    ],
    "media": "https://www.youtube.com/watch?v=PBAuHv5cPl8",
    "authors": [
        "Michael Goldstein"
    ],
    "indexed_at": "2024-03-21T16:33:35.938Z",
    "transcript_by": "Bryan Bishop",
    "summary": "In a thought-provoking exploration of digital discourse, Michael Goldstein highlights the influential power of memes in shaping political and public opinion, particularly within the realm of cryptocurrency. His discussion draws attention to a pivotal moment in U.S. Congress, where cryptocurrencies were starkly categorized by Representative Warren Davidson, showcasing the impact of memetics on cultural and political narratives. Goldstein advances the argument that in today's information-saturated age, the strategic crafting of impactful memes is essential for cutting through the clutter, positing them as vital tools in geopolitical maneuvering and the shaping of civilization's future.\n\nGoldstein differentiates between the use of memes as a form of rhetoric, aimed at persuasion, versus the dialectic method focused on logical debate. This distinction underscores the importance of using memes strategically to appeal to various audiences effectively. He delves into the dynamics of bitcoin advocacy, stressing the creation of \"in-groups\" and \"out-groups,\" and highlighting the utility of echo chambers in building community and trust among bitcoin supporters. In contrast, he advocates for a propaganda-like approach towards \"nocoiners\" and skeptics, suggesting tactics such as trolling and ridicule rather than logical engagement, to protect and advance the interests of the bitcoin community.\n\nCentral to his strategy is the promotion of an unwavering belief in bitcoin's potential to transform economic systems. Goldstein urges the adoption of an optimistic stance on bitcoin's future, emphasizing the power of simple memes like \"orange coin good\" and \"bitcoin fixes this\" to make complex economic, ethical, and technological discussions accessible to a broader audience. These memes serve not only as a means of communication but as vehicles for engaging more people with the underlying ideologies of bitcoin.\n\nFurthermore, Goldstein stresses the continuous promotion of a positive narrative around bitcoin, framing opposition from nocoiners as supporting a harmful economic status quo. He introduces rhetorical tactics aimed at reframing negative perceptions and asserting bitcoin's superiority. Through this, Goldstein outlines a multifaceted approach to fostering bitcoin's acceptance and dominance, combining a combative stance towards skeptics with supportive strategies for potential adopters.\n\nMoreover, Goldstein emphasizes the necessity of a deep understanding of computer science, economic theories, and network effects for those engaging in \"ethical trolling\" or \"conscious memeing.\" This approach contrasts with aimless online provocation, demanding memes rooted in undeniable truths to engage skeptics from a position of informed strength. He also highlights the evolution of terms like \"shitcoin\" from casual jargon to recognized terminology in formal settings, underscoring the long-term impact of truth-centered memetic warfare.\n\nDrawing inspiration from a diverse range of works, Goldstein recommends readings that span classical rhetoric to contemporary monetary critiques, providing a foundation for effective and informed meme crafting within the Bitcoin community. This selection underscores the importance of truth, ethical persuasion, and the ethical considerations surrounding money production in public discourse.\n\nIn conclusion, Michael Goldstein's discussion offers a comprehensive blueprint for leveraging memes in support of Bitcoin, emphasizing ethical engagement, factual integrity, and the strategic use of digital discourse to shape public perception. By grounding their efforts in a thorough understanding of relevant disciplines, Bitcoin proponents can navigate online challenges and significantly influence the narrative surrounding this transformative technology."
}