{
    "header_summary": "The release of Bitcoin Core version 26.0 brings several enhancements to the cryptocurrency's software, including improvements in network security, wallet functionality, GUI updates, and experimental support for the v2 transport protocol. Users must be aware that upgrading, particularly from older versions, could require shutting down the software and migrating data. New developments include more efficient storage management through pruning adjustments, updated RPC layer with new commands and deprecation of outdated elements, and the implementation of startup checks for configuration errors.\n\nWallet functionality has been refined in the latest update with better handling of corrupted records, optimized coin selection, and simplified RPC methods that now accept `options` parameters. Error reporting has been improved for troubleshooting, and steps toward standardizing transactions on the testnet have been taken. User interface changes are designed to enhance the overall experience, including clearer transaction displays, easier transitions between wallet types, and better identification of personal outputs in PSBT operations, with an ongoing phase-out of legacy wallet creation in the GUI.\n\nAdditionally, advancements in the PSBT format are proposed by Brandon Black, aiming to facilitate multi-party transaction coordination through a standardized descriptor file and the introduction of new global types in BIP174. This initiative seeks to improve the interaction between coordinating and signing devices in the Bitcoin ecosystem. The open-source community's collaborative efforts underline the continuous drive to evolve Bitcoin Core's functionality, reliability, and efficiency, with detailed information available in the official release documentation.",
    "recent_posts": [
        {
            "id": "022187",
            "title": "Bitcoin Core 26.0 released",
            "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-December/022187.html",
            "authors": [
                "Michael Ford"
            ],
            "published_at": "2023-12-06T12:12:34+00:00",
            "summary": "- Bitcoin Core version 26.0 offers new features, bug fixes, performance enhancements, and translation updates.\n- Improvements target wallet functionality, networking protocol support, and RPC layer, with new commands added.\n- GUI advancements, stricter configuration rules, and testnet standardization are also integral parts of the update.",
            "n_threads": 1,
            "dev_name": "bitcoin-dev",
            "contributors": [],
            "file_path": "static/bitcoin-dev/Dec_2023/022187_Bitcoin-Core-26-0-released.xml",
            "combined_summ_file_path": ""
        },
        {
            "id": "022186",
            "title": "A proposal for a \"PSBT for descriptors\" format",
            "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-November/022186.html",
            "authors": [
                "Brandon Black"
            ],
            "published_at": "2023-11-30T23:12:05+00:00",
            "summary": "- Brandon Black proposes enhancements to the PSBT protocol for Bitcoin transactions.\n- He suggests adding standardized descriptor files to simplify transaction coordination.\n- New global types in BIP174 would standardize descriptors and key names for signing devices.",
            "n_threads": 2,
            "dev_name": "bitcoin-dev",
            "contributors": [
                "SeedHammer Team"
            ],
            "file_path": "static/bitcoin-dev/Nov_2023/022186_A-proposal-for-a-PSBT-for-descriptors-format.xml",
            "combined_summ_file_path": ""
        }
    ],
    "active_posts": [
        {
            "id": "022184",
            "title": "A proposal for a \"PSBT for descriptors\" format",
            "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-November/022184.html",
            "authors": [
                "SeedHammer Team"
            ],
            "published_at": "2023-11-23T22:25:43+00:00",
            "summary": "- SeedHammer is developing a metal backup standard using PSBT binary encoding.\n- The format aligns with BIP standards and allows Miniscript with certain limitations.\n- The team invites feedback before formalizing the proposal via the BIP process.",
            "n_threads": 2,
            "dev_name": "bitcoin-dev",
            "contributors": [
                "Brandon Black"
            ],
            "file_path": "static/bitcoin-dev/Nov_2023/022184_A-proposal-for-a-PSBT-for-descriptors-format.xml",
            "combined_summ_file_path": "static/bitcoin-dev/Nov_2023/combined_A-proposal-for-a-PSBT-for-descriptors-format.xml"
        },
        {
            "id": "022187",
            "title": "Bitcoin Core 26.0 released",
            "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-December/022187.html",
            "authors": [
                "Michael Ford"
            ],
            "published_at": "2023-12-06T12:12:34+00:00",
            "summary": "- Bitcoin Core 26.0 introduces new features, bug fixes, and performance enhancements.\n- The update maintains cross-platform compatibility; upgrading may require data migration.\n- It furthers wallet functionality, network security, and provides detailed error codes for RPC calls.",
            "n_threads": 1,
            "dev_name": "bitcoin-dev",
            "contributors": [],
            "file_path": "static/bitcoin-dev/Dec_2023/022187_Bitcoin-Core-26-0-released.xml",
            "combined_summ_file_path": ""
        },
        {
            "id": "004223",
            "title": "Mailing List Future",
            "link": "https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-November/004223.html",
            "authors": [
                "Matt Corallo"
            ],
            "published_at": "2023-11-26T16:51:17+00:00",
            "summary": "- The recent meeting discussed replacing the mailing list by year-end with new platforms.\n- Concerns were raised about Google Groups access and GitHub's moderation capabilities.\n- A vote is set for the next meeting to finalize the decision, with attendees' input encouraged.",
            "n_threads": 12,
            "dev_name": "lightning-dev",
            "contributors": [
                "Bastien TEINTURIER",
                "James O'Beirne",
                "Olaoluwa Osuntokun",
                "Peter Todd",
                "Vincenzo Palazzo"
            ],
            "file_path": "static/lightning-dev/Nov_2023/004223_Mailing-List-Future.xml",
            "combined_summ_file_path": "static/lightning-dev/Nov_2023/combined_Mailing-List-Future.xml"
        },
        {
            "id": "004227",
            "title": "Liquidity Ads and griefing subtleties",
            "link": "https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-December/004227.html",
            "authors": [
                "Bastien TEINTURIER"
            ],
            "published_at": "2023-12-01T17:45:18+00:00",
            "summary": "- Liquidity ads in protocol design impact both buyers and sellers, presenting pricing challenges.\n- Proposed solutions like CLTV and splicing add complexity and potential for exploitation.\n- Sellers must price liquidity ads effectively, considering risks despite the protocol's potential.",
            "n_threads": 4,
            "dev_name": "lightning-dev",
            "contributors": [
                "Matt Morehouse",
                "ZmnSCPxj"
            ],
            "file_path": "static/lightning-dev/Dec_2023/004227_Liquidity-Ads-and-griefing-subtleties.xml",
            "combined_summ_file_path": "static/lightning-dev/Dec_2023/combined_Liquidity-Ads-and-griefing-subtleties.xml"
        }
    ]
}