{
    "header_summary": "The latest version 26.0 of Bitcoin Core introduces significant enhancements, including new functionalities, bug fixes, performance improvements, and updated translations, prompting users to obtain the update from the official website or via BitTorrent. Developers encourage bug reports via GitHub and highlight the version's compatibility with Linux, macOS 11.0+, and Windows 7 or newer, though Unix-like systems may differ. Upgrading requires shutting down existing Bitcoin instances, and in some cases, data migration may be necessary, with continued wallet support for older versions.\n\nNetwork enhancements feature experimental support for the v2 transport protocol (BIP324) aimed at improving resistance to eclipse and partition attacks, although it is not enabled by default. The release also includes pruning adjustments for assumeutxo, new and updated RPC commands for improved transaction management, and network information accessibility. Meanwhile, misconfigurations that cause startup failures, modifications to the GUI wallet, and refined wallet behaviors for corrupted records and coin selection are among the wallet updates.\n\nMoreover, the GUI has been refined to better display transaction effects on inputs and outputs, introduce a new wallet migration option, and improve PSBT operations' clarity, with a planned phase-out of legacy wallet creation. Additionally, the testnet defaults to disallowing non-standard transactions, emphasizing the collaborative efforts by numerous developers in advancing the platform's functionality and user experience. Users are directed to the official documentation for comprehensive feature details and instructions.",
    "recent_posts": [
        {
            "id": "022187",
            "title": "Bitcoin Core 26.0 released",
            "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-December/022187.html",
            "authors": [
                "Michael Ford"
            ],
            "published_at": "2023-12-06T12:12:34+00:00",
            "summary": "- Bitcoin Core version 26.0 introduces new features, bug fixes, and performance enhancements.\n- Compatibility is retained for recent OS versions; migration may be required for updates.\n- The release adds protocols for network security, RPC updates, and pruning adjustments.",
            "n_threads": 1,
            "dev_name": "bitcoin-dev",
            "contributors": [],
            "file_path": "static/bitcoin-dev/Dec_2023/022187_Bitcoin-Core-26-0-released.xml",
            "combined_summ_file_path": ""
        }
    ],
    "active_posts": [
        {
            "id": "022187",
            "title": "Bitcoin Core 26.0 released",
            "link": "https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2023-December/022187.html",
            "authors": [
                "Michael Ford"
            ],
            "published_at": "2023-12-06T12:12:34+00:00",
            "summary": "- Bitcoin Core version 26.0 features new tools, performance enhancements, and a bug fix update.\n- It introduces BIP324 v2 protocol support and network improvements for security.\n- GUI advancements include updated transaction displays and a legacy wallet migration option.",
            "n_threads": 1,
            "dev_name": "bitcoin-dev",
            "contributors": [],
            "file_path": "static/bitcoin-dev/Dec_2023/022187_Bitcoin-Core-26-0-released.xml",
            "combined_summ_file_path": ""
        },
        {
            "id": "004223",
            "title": "Mailing List Future",
            "link": "https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-November/004223.html",
            "authors": [
                "Matt Corallo"
            ],
            "published_at": "2023-11-26T16:51:17+00:00",
            "summary": "- Alternative platforms to replace the current mailing list were discussed due to its year-end shutdown.\n- Concerns were raised about non-Gmail users’ access to Google Groups and GitHub's moderation tools.\n- A vote will be held next meeting to decide with options including a new mailman instance or Discourse.",
            "n_threads": 12,
            "dev_name": "lightning-dev",
            "contributors": [
                "Bastien TEINTURIER",
                "James O'Beirne",
                "Olaoluwa Osuntokun",
                "Peter Todd",
                "Vincenzo Palazzo"
            ],
            "file_path": "static/lightning-dev/Nov_2023/004223_Mailing-List-Future.xml",
            "combined_summ_file_path": "static/lightning-dev/Nov_2023/combined_Mailing-List-Future.xml"
        },
        {
            "id": "004227",
            "title": "Liquidity Ads and griefing subtleties",
            "link": "https://lists.linuxfoundation.org/pipermail/lightning-dev/2023-December/004227.html",
            "authors": [
                "Bastien TEINTURIER"
            ],
            "published_at": "2023-12-01T17:45:18+00:00",
            "summary": "- Liquidity ads imply risks and pricing challenges for sellers due to potential griefing attacks.\n- Solutions like CLTV can disadvantage sellers, highlighting a debate on protection priorities.\n- The integration of liquidity ads remains complex, with the community seeking balanced implementations.",
            "n_threads": 4,
            "dev_name": "lightning-dev",
            "contributors": [
                "Matt Morehouse",
                "ZmnSCPxj"
            ],
            "file_path": "static/lightning-dev/Dec_2023/004227_Liquidity-Ads-and-griefing-subtleties.xml",
            "combined_summ_file_path": "static/lightning-dev/Dec_2023/combined_Liquidity-Ads-and-griefing-subtleties.xml"
        }
    ]
}