{
    "id": "bitcointranscripts+baltic-honeybadger+2018+investing-in-bitcoin-businesses",
    "title": "Investing In Bitcoin Businesses",
    "body_formatted": "{\"type\":\"paragraph\",\"text\":\"1 on 1: Investing in bitcoin businesses\"}, {\"type\":\"paragraph\",\"text\":\"Matthew Mezinskis (crypto\\\\_voices) (moderator)\"}, {\"type\":\"paragraph\",\"text\":\"MM: I run a podcast based here in Latvia on bitcoin economics and money. It's American-Latvian. I do it with my partner who is based in Brazil. Today we're going to focus on investing in businesses focused on bitcoin and crypto.\"}, {\"type\":\"paragraph\",\"text\":\"NC: My name is Nic Carter. I work for a venture fund. We're one of the few venture funds that focus on bitcoin and bitcoin-related startups. We're not focused at ICO or things trying to bring down bitcoin. I'm also the co-founder of coinmetrics.io.\"}, {\"type\":\"paragraph\",\"text\":\"FM: I'm from Munich, Germany. I'm an IT architect. I have an interest in bitcoin and blockchain. I'm a huge shitcoin fund. I'm not directly into venture capital but I'm a technical guy with a focus on security... I'm used to get asked a lot about how to handle the technical details of the stuff getting bought and if it's useful or interesting. Since 2018, I'm a member of the HodlHodl and Casa Hodl family.\"}, {\"type\":\"paragraph\",\"text\":\"MM: I think we want to touch on lightning and possible applications on top of lightning. Before we get there, let's get a lay of the land in terms of venture investing in bitcoin. Nic, are you trying to benchmark your investments against stocks, bonds, fiat, US dollar? Are you looking strictly in terms of BTC?\"}, {\"type\":\"paragraph\",\"text\":\"NC: Benchmarking is really interesting in venture capital. Quite a few funds say they benchmark their investments against bitcoin. They ask themselves will this series stage equity outperform bitcoin over their return profile window. Eric Meltzer does this. The question they ask themselves is, will this startup actually outperform bitcoin? Coinbase seed stage round in 2012 didn't outperform bitcoin. We're a conventional fund so we don't benchmark against bitcoin, we're just chasing the IRR that our LPs are looking for, which is 15-20% annualized. Our investors get paid in dollars, very old fashioned.\"}, {\"type\":\"paragraph\",\"text\":\"MM: Florian, you're on the trading panel tomorrow, what kind of returns do you look at?\"}, {\"type\":\"paragraph\",\"text\":\"FM: It's hard to compete against BTC with those earnings. In the right markte conditions or bull markets... those investments or Hodlhodl or other ventures that I make as a trader or investor I see as a short-term hedge against bitcoin volatility. I believe in the ecosystem and what bitcoin could do for us. I see a lot of stuff built on lightning and how the technical is built.. for me it's a hedge against the short-term volatility and maybe the loss of value. I mostly look at people and who's on the team.\"}",
    "body": "\n1 on 1: Investing in bitcoin businesses\n\nMatthew Mezinskis (crypto\\_voices) (moderator)\n\nMM: I run a podcast based here in Latvia on bitcoin economics and money. It's American-Latvian. I do it with my partner who is based in Brazil. Today we're going to focus on investing in businesses focused on bitcoin and crypto.\n\nNC: My name is Nic Carter. I work for a venture fund. We're one of the few venture funds that focus on bitcoin and bitcoin-related startups. We're not focused at ICO or things trying to bring down bitcoin. I'm also the co-founder of coinmetrics.io.\n\nFM: I'm from Munich, Germany. I'm an IT architect. I have an interest in bitcoin and blockchain. I'm a huge shitcoin fund. I'm not directly into venture capital but I'm a technical guy with a focus on security... I'm used to get asked a lot about how to handle the technical details of the stuff getting bought and if it's useful or interesting. Since 2018, I'm a member of the HodlHodl and Casa Hodl family.\n\nMM: I think we want to touch on lightning and possible applications on top of lightning. Before we get there, let's get a lay of the land in terms of venture investing in bitcoin. Nic, are you trying to benchmark your investments against stocks, bonds, fiat, US dollar? Are you looking strictly in terms of BTC?\n\nNC: Benchmarking is really interesting in venture capital. Quite a few funds say they benchmark their investments against bitcoin. They ask themselves will this series stage equity outperform bitcoin over their return profile window. Eric Meltzer does this. The question they ask themselves is, will this startup actually outperform bitcoin? Coinbase seed stage round in 2012 didn't outperform bitcoin. We're a conventional fund so we don't benchmark against bitcoin, we're just chasing the IRR that our LPs are looking for, which is 15-20% annualized. Our investors get paid in dollars, very old fashioned.\n\nMM: Florian, you're on the trading panel tomorrow, what kind of returns do you look at?\n\nFM: It's hard to compete against BTC with those earnings. In the right markte conditions or bull markets... those investments or Hodlhodl or other ventures that I make as a trader or investor I see as a short-term hedge against bitcoin volatility. I believe in the ecosystem and what bitcoin could do for us. I see a lot of stuff built on lightning and how the technical is built.. for me it's a hedge against the short-term volatility and maybe the loss of value. I mostly look at people and who's on the team.\n\n\n\n",
    "body_type": "markdown",
    "created_at": null,
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/baltic-honeybadger/2018/investing-in-bitcoin-businesses",
    "categories": [
        "conference"
    ],
    "authors": [
        "Nic Carter",
        "Florian Maier"
    ],
    "indexed_at": "2024-03-21T16:33:35.921Z",
    "transcript_by": "Bryan Bishop",
    "summary": "In a recent discussion on the dynamics of investing in Bitcoin and cryptocurrency-focused businesses, Nic Carter and Florian Maier shared their insights alongside Matthew Mezinskis. The conversation provided a deep dive into the strategies and considerations unique to venture capital in this rapidly evolving sector.\n\nNic Carter, representing a venture fund specifically aimed at supporting Bitcoin and related startups, highlighted the fund's distinction from those interested in Initial Coin Offerings (ICOs) or projects adversarial to Bitcoin. Instead, Carter’s focus lies on foundational technologies like those tracked by his co-founded platform, coinmetrics.io, underscoring a commitment to the core values and long-term potential of Bitcoin. This approach delineates a clear boundary between ventures seeking to innovate within the Bitcoin ecosystem and those chasing fleeting trends.\n\nThe dialogue then shifted towards the intricacies of venture capital benchmarks, particularly how investments in the Bitcoin space are evaluated against traditional financial metrics. Carter revealed that while some funds compare their performance directly to Bitcoin's value fluctuations, his fund adheres to conventional investment return rates, targeting an annualized Internal Rate of Return (IRR) of 15-20%. This methodology reflects a pragmatic stance towards investor expectations, balancing the speculative nature of crypto assets with the grounded objectives of venture capital.\n\nFlorian Maier, bringing a technical perspective to the conversation, underscored the significance of security and operational viability in Bitcoin-related ventures. His involvement with HodlHodl and Casa Hodl showcases a dedication to enhancing the infrastructure and services within the Bitcoin community. Maier also touched upon the strategic role of investments as hedges against Bitcoin's notorious volatility. By scrutinizing team compositions and project foundations, he aims to identify ventures that not only promise short-term resilience but also contribute to the broader ecosystem's sustainability.\n\nThe discussion concluded with reflections on the potential applications of Bitcoin's Lightning Network. Both speakers implied that innovation in this area could herald significant advancements for scalability and functionality in the crypto space. This anticipation speaks to the underlying optimism about Bitcoin's capacity to transform financial systems through both its native features and the layers being built atop it.\n\nOverall, the exchange between Nic Carter, Florian Maier, and Matthew Mezinskis offered a comprehensive overview of the current landscape for venture capital investment in Bitcoin-centric businesses. It underscored the balance between embracing the revolutionary potential of cryptocurrencies and adhering to disciplined investment strategies. As the sector continues to mature, the insights shared in this conversation will undoubtedly influence both current and future stakeholders in the crypto economy."
}