{
    "id": "bitcointranscripts+baltic-honeybadger+2018+opening",
    "title": "Opening",
    "body_formatted": "{\"type\":\"paragraph\",\"text\":\"Opening remarks for Baltic Honeybadger 2018\"}, {\"type\":\"paragraph\",\"text\":\"twitter: <https://twitter.com/search?f=tweets&vertical=default&q=bh2018>\"}, {\"type\":\"paragraph\",\"text\":\"<https://twitter.com/kanzure/status/1043384689321566208>\"}, {\"type\":\"paragraph\",\"text\":\"Okay guys, we're going to start in five minutes. So stay here. She is going to introduce speakers and help everyone out. Thanks everyone for coming. It's a huge crowd this year. I wanted to make a few technical announcements. First of all, just remember that we should be excellent to each other. We have people from all over the world here. We don't care from where you're from, what your height is, we don't care how old are you, we don't care about those things- be excellent to each other. The other thing is, the afterparty starts at 6pm. Please wear the badges for the afterparty. Unless you have them, they aren't going to let you in. You need to wear the badges. Last year we had a few guys from Australia brought some beers. I was supposed to do the same this year, but we have two guys from New Zealand if you guys could identify yourselves. How long did you fly? 22 hours. 42 hours? Okay. Was it business or economy? Don't tell me. So, this is pretty much it for the technical announcements. I would like to say a few words about our organizers. They did a great job here on sighting Riga and finding the space. You probably remembe rlast year we had the second day at the co-working space. Let's give them a round of applause as well, they're doing a great job here. Alright, so, Dominic, would you like to say a few words?\"}, {\"type\":\"paragraph\",\"text\":\"Thanks so much for having me. I'm honored to help at this conference. My name is Dominique. I'm from the Bitcoin Association. I will be introducing the speakers and say a few sentences about them.\"}",
    "body": "\nOpening remarks for Baltic Honeybadger 2018\n\ntwitter: <https://twitter.com/search?f=tweets&vertical=default&q=bh2018>\n\n<https://twitter.com/kanzure/status/1043384689321566208>\n\nOkay guys, we're going to start in five minutes. So stay here. She is going to introduce speakers and help everyone out. Thanks everyone for coming. It's a huge crowd this year. I wanted to make a few technical announcements. First of all, just remember that we should be excellent to each other. We have people from all over the world here. We don't care from where you're from, what your height is, we don't care how old are you, we don't care about those things- be excellent to each other. The other thing is, the afterparty starts at 6pm. Please wear the badges for the afterparty. Unless you have them, they aren't going to let you in. You need to wear the badges. Last year we had a few guys from Australia brought some beers. I was supposed to do the same this year, but we have two guys from New Zealand if you guys could identify yourselves. How long did you fly? 22 hours. 42 hours? Okay. Was it business or economy? Don't tell me. So, this is pretty much it for the technical announcements. I would like to say a few words about our organizers. They did a great job here on sighting Riga and finding the space. You probably remembe rlast year we had the second day at the co-working space. Let's give them a round of applause as well, they're doing a great job here. Alright, so, Dominic, would you like to say a few words?\n\nThanks so much for having me. I'm honored to help at this conference. My name is Dominique. I'm from the Bitcoin Association. I will be introducing the speakers and say a few sentences about them.\n\n\n\n\n\n",
    "body_type": "markdown",
    "created_at": null,
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/baltic-honeybadger/2018/opening",
    "categories": [
        "conference"
    ],
    "media": "https://www.youtube.com/watch?v=66ZoGUAnY9s",
    "indexed_at": "2024-03-21T16:33:35.922Z",
    "transcript_by": "Bryan Bishop",
    "summary": "At the Baltic Honeybadger 2018, an air of anticipation and camaraderie filled the room as attendees from across the globe congregated, eagerly awaiting the commencement of the conference. The atmosphere was one of inclusivity and respect, underscored by a reminder to the audience to uphold excellence in their interactions, irrespective of geographical origins, age, or stature. This principle of mutual respect and open-mindedness set the tone for the event, emphasizing the diverse and global nature of the community gathered.\n\nThe organizer took the stage to make several key announcements, highlighting the logistical aspects that would enhance the attendee experience. A notable point of interest was the afterparty, a staple of the conference designed to foster networking and camaraderie among participants. To ensure a smooth entry, attendees were reminded of the necessity to wear their badges, a simple yet crucial detail for access. The mention of guests traveling extensive distances, including a humorous nod to two attendees from New Zealand who embarked on a journey of over 20 hours, served to illustrate the dedication and passion of the community members making their way to the conference.\n\nIn addition to logistical details, the organizer expressed gratitude towards the individuals behind the scenes who made the conference possible. The efforts of the organizers in selecting Riga as the venue and securing the space did not go unnoticed, with last year's impromptu shift to a co-working space for the second day of the conference serving as a testament to their adaptability and commitment. This acknowledgment of the organizational team's hard work fostered a sense of appreciation and community spirit among the attendees.\n\nDominique, representing the Bitcoin Association, was introduced to further bridge the connection between the speakers and the audience. Tasked with the role of introducing speakers and providing context for their presentations, Dominique's involvement underscored the collaborative effort required to curate a conference of this caliber. Her presence highlighted the importance of facilitating meaningful exchanges between the experts and the audience, ensuring that the wealth of knowledge and insights shared during the conference would resonate and inspire.\n\nIn summary, the opening remarks at the Baltic Honeybadger 2018 conference painted a picture of a vibrant, engaged, and respectful community coming together to share, learn, and connect. The emphasis on inclusivity, combined with the meticulous organization and the dedication of both the attendees and the organizing team, set the stage for an event that promised to be both informative and transformative."
}