{
    "id": "bitcointranscripts+stephan-livera-podcast+2019-02-11-jack-dorsey-elizabeth-stark",
    "title": "Bitcoin- Native Currency of the Internet",
    "body_formatted": "{\"type\":\"paragraph\",\"text\":\"podcast: https://stephanlivera.com/episode/52/\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Welcome to the Stephan Livera podcast, focused on Bitcoin and Austrian economics. Learn the technology and economics of Bitcoin by listening in to interviews with the best and brightest. It’s a very special episode today with Jack Dorsey, CEO of Twitter and Square, and also Elizabeth Stark, CEO of Lightning Labs.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: I’ve been very impressed with Jack’s commentary on Bitcoin as potentially the native currency of the internet, and the way he’s been managing Square and one of Square’s products in particular, the Cash App, which allows for Bitcoin purchases and sales. The Cash App has been quite successful on the App Store charts, hitting number one.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Elizabeth Stark is the CEO of Lightning Labs, one of the all-star teams building the Lightning Network. Their brilliant team has consistently been making major contributions to the Lightning Network as a protocol, and also developing and shipping incredible products, such as lnd and associated software.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: It’s a must-listen interview, so make sure to share it wide. Here’s the interview.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: It’s my pleasure to welcome you to the show, Jack and Elizabeth.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Hey.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Thanks for having us.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Let’s start with you, Jack. I’ve been really impressed by your commentary and I’d love to hear more about how you came to understand Bitcoin. Can you tell us your journey from first hearing of it to now believing that it could someday be native currency of the internet?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: I’ve been fascinated by the internet for a long time, probably since I was 11 in Saint Louis, Missouri. And Saint Louis, Missouri had a pretty active hacker culture, and we had the great fortune of having Wash U in the city that was also directly connected to the backbone of the internet pretty early on. A lot of the early BBS’s connected directly to that, so I could access things like IRC and Usenet, and Usenet is where I discovered old cypherpunks and that led me to a lot of reading on cryptography, and it was something I didn’t fully understand but really appreciated and obviously on alt cypherpunks. There was a lot of discussion around digital currency, around cryptocurrency, the role of cryptography.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: I didn’t get too deep into it in the sense that I implemented anything or played with a lot of the ideas, but it was a fascination. I had heard of Bitcoin when it started and just when the white paper was released. Looked at the white paper, thought it was pretty amazing, simple, beautiful. We were just getting started with Square at that time. And it wasn’t until 2014 that one of our engineers decided that they wanted to enable Square merchants online to accept Bitcoin and we made this very simple feature that allowed anyone on our online store to pay using Bitcoin without the seller having to be aware of it. So anyone can come up and go to a bike store online and pay through Bitcoin. And we could automatically translate it in the back end to US dollar. And it was cool, we wrote a blog post about it.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: We weren’t connected directly to the blockchain, we used a few APIs. We didn’t see many transactions, we just didn’t see much activity. The people using Bitcoin at the time weren’t buying the things that our merchants were selling per se. And then two years ago we had a hack week for the cash team and I found one of our engineers, Mike Brock, and I suggested that we worked together on it. He did the majority of the work but I suggested that we try something really simple which is, we had this ability to add a cash card, a Visa card, to Apple Pay. And we wanted to, by the end of the week, to be able to store Bitcoin and then actually use my phone at BlueBottle Coffee across the street, buy a cappuccino with Bitcoin and have it automatically translate to US dollar for the seller without them having to consider it.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: And we almost hit that goal, it didn’t really work until the following Monday. But it felt really good and really cool and that gave us a lot of conviction and also desire to… In this case we were connecting directly to the blockchain, we were learning a ton about how it worked and it just gave us a lot of conviction around, we should do something here. And throughout the year, it kept evolving into a buy and sell platform. Realized our role and responsibility in terms of educating people around it as well, because a lot of people would probably be new to it. And this was during the huge run up as well so we released it at the end of the year. I think it’s one of the simplest ways to fuel Bitcoin and to participate and to get a sense of what it is and what it could become.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Ever since then we’ve just been continuing to push and educate ourselves and learn, but also attempting to be leads in the financial technology space. I think we were one of the first public companies to have a Bitcoin offering and one of the first to talk to the SEC about what that meant. We continued to pull the thread and I’m pretty excited to see where it goes, but ultimately we don’t believe it stops at just buying and selling. We do want to help make happen the currency aspect and helping the internet get to a native global currency.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Fascinating. I was particularly impressed that you were quite early being involved or at least following the material of the Cypherpunks. Is that what also gave you some understanding around Bitcoin’s principles and resilience?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: I had a lot of the background context in terms of what people wanted to see and some of their principles that people were driving with the ideas around cryptocurrency. But the whitepaper really laid it all out and I think it’s one of the most seminal works on computer science in the past few decades. I think it’s beautifully written. I think it is very principled and has a strong point of view and I love that it was put out there through pseudonymity which just feels very ‘internet’ to me. The whole thing just feels very native to internet ideals and that appealed to me a lot. Maybe this thing that was ideated on the internet and then created on the internet, released to it and continues to be developed throughout it. It’s been amazing, but the resilience comes from the fact that early on it had a fairly negative lens on top of it, just because of how people were using it, but it persisted through that.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: It also persisted through multiple forks and questions and scalability issues and certainly none of those are complete, but it really speaks to something that inherently has a natural resilience to it. I think the brand strength, the brand of Bitcoin, is just really spectacular and I think it enables some more of that resilience. It is a mainstream well known, quote/unquote, “household” concept. Not everyone really knows what it might be for or may have different perspectives about what it does but it’s known that it’s digital currency, digital money, digital asset. Even when I go back to St. Louis, and this was years ago, the brand recognition is so strong and awareness is so strong that people would ask me about it as soon as I would tell them I was in technology. So I think it has a lot going for it in terms of lasting power and ensuring that it endures.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: An excellent answer Jack. I’m also interested to know why you focused so much particularly on Bitcoin and not necessarily some of the other projects in the space?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Most of it is just due to the principles that created it. The community around it, the ideals that it fosters, the brand. But it’s also that there’s an element of practicality to it as well. Focusing on this and helping in whatever way we can with the community and helping to make it happen just can really focus our resources and our attention. I think there’s interesting ideas elsewhere, but I think those ideas can be integrated to Bitcoin if they have the merit that is above some bar. It feels like it’s the one that wants to be the currency the most versus others that are doing more general purpose things or distributed computing and whatnot. I think it’s spawned a lot of really amazing ideas but I’m focused on the currency aspect and focused on the transactional aspect and what that enables.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: That’s excellent. I like the insights that you give there around that Bitcoin wants to be a currency the most around the transactional component as well. I think on that transactional component, let’s bring you in Elizabeth. Obviously, the Lightning Network, it enables so many new possibilities with Bitcoin such as incredibly low fees, extremely fast payments, improved customer experience. It can enable entirely new business models. Why are people so excited about the Lightning Network now?\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: It’s actually been amazing to see everything pan out. Actually, when I first met Jack it was summer of 2017, and we’d had a mutual friend that connected us. And my co founder Olaoluwa, AKA ‘Roasbeef’, and I went into the Square office and I remember that we were white-boarding and meeting with the team and talking about the cool things that Square was working on and even in 2017 we’d had a release of our lnd software for Testnet, but it wasn’t yet out for real Bitcoin. It was still mostly just something that was being tested and it wasn’t yet out into the world.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: What we’ve seen over the past year has been… March 15th of 2018, our company Lightning Labs released the beta version of our lnd software. There are other betas that followed of other limitations and it was really the year where Lightning became real. People started spinning up nodes, they started building on top of it. It was also funny that prior to the beta releases, people were using Lightning even though, at least for our implementation, we said “guys it’s not ready yet” and they said “we don’t care, we’re going to modify the code, recompile it”. It’s Bitcoin, you can’t tell people what to do.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: There have been a few factors lately that have really contributed to it. The first is just the evolution of the infrastructure. In March, things were still pretty early. Getting the implementations out in beta meant a lot of us could do testing. We had this super dedicated community. We have this Slack community, lnd developer and tester Slack, where people are testing every day. And they’re so passionate. And for them, it’s a hobby and it’s a way of life. I really think we’re building a movement here. Using the infrastructure billed out such that we’ve been able to find bugs, we’ve been able to add improvements, add more features.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: We’ve also seen the developer community grow dramatically, which I think is a big part of this. There were these really cool Lightning hack days and they’re still happening. There was one in New York a few months ago, there’ve been several in Berlin and there are quite a lot of them popping up. There was one in [inaudible]. And so people are coming together, they’re building on top of Lightning. One thing that I think is really key is, lots of people are using it as well and that gets inside everything that happened with the torch. We’re seeing the evolution of developers, the infrastructure. And then third, I think the quote/unquote “Bear market” has… For us I don’t actually think it’s really a Bear market. When we started the company, the price of Bitcoin was $200, so it’s quite a bit higher today.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: It’s brought us back to fundamentals as opposed to all the hype and hysteria and frenzy when the price is just skyrocketing. I think the focus on building and building out real infrastructure and solving real problems for real users is very healthy. I think that’s actually helped contribute to the uptake and Lightning hood option and what everyone’s building and just what people are doing with it.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Excellent. And I think on that theme of solving the real problems for real users, we’ve seen just an amazing array of new concepts and models for business come up. Can you talk to us a little bit about some of the, perhaps some of the new concepts that have come up in terms of businesses or services online that can be paid for with Lightning.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: One of our team members, Alex Bosworth, who’s awesome Lightning developer has actually… Has awesome tweets by the way, follow him on Twitter. But he’s been tweeting a lot about the emerging Lightning economy. There’s also Nik Bhatia who’s been doing great work as well in terms of writing about the financial and economic aspects of Lightning and the time value of money and time values of Bitcoin matters on Lightning. We’ve actually seen this new economy develop where there are whole host of sites that only accept Lightning. So Bitcoin via Lightning obviously. And in many cases there were things that we hadn’t even imaging or thought of. For example, recently, somebody made a science fiction novel where you can pay per page. So if you don’t like the book, you can just stop paying. You can keep paying per page.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: We saw some cool examples of Lightning on Twitch. People said “Oh, did Twitch integrate Lightning?” Turned out they didn’t need to because much like we were doing on Twitter, you can just add Lightning invoices in Twitch. We also saw people using a Unity plugin in games, where you can open this door and there’s a cool QR code and there’s instant inter-game interaction with Lightning. I think we’re seeing the start of this new economy of these used cases that weren’t previously possible. Today if you want to send five cents on the internet with the existing payment systems, and do so instantly and globally, that’s just not going to work. So I think what Jack was getting to, with the idea of Bitcoin being this digital money, being transactional. The goal with Lightning is really building this layer for programmable money, where anybody can build on top of it around the world.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Fantastic, I love that idea of being able to pay instantly and globally. Let’s talk now about the Lightning Network Trust Chain, also known as the Lightning Torch. I think that’s a fascinating example, so perhaps Elizabeth, you could just tell us a little bit about what it is and how it got started.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Yeah, one of the cool things about Lightning lately is that people are tweeting about how much fun it is. We’re bringing the fun back to money and also, that it’s kind of making money a meme. This is an example of that. Some members of the community were getting excited about sending funds on Lightning and I know they were using this site called tippin.me and then they were also… I believe a community member going by the name of Hodlonaut, he’s Norwegian. Getting back Jack to the whole internet thing, he has a space cat in an astronaut suit as his Twitter image and has a taco in his twitter name, which I think is exactly the kind of internet thing we need. Started thing whole, just started sending people money with Lightning and then people started sending it along and adding some satoshis and adding some satoshis.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: One key point with Lightning as well is that people like to nanominate in satoshis, it makes it a lot more fun. One Sat is four thousandths of a cent or something. So they’re doing so in satoshis and we were watching from my team, this is interesting. Money is going viral and they’re just passing it along like this Olympic torch and then all of a sudden it started being sent to all these different places around the world. At one point we thought somebody had “exit scammed”, quote/unquote. We thought somebody had taken the money and actually it was more like a social experiment to see how people would react and then, because anybody at any point could have just taken the money.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Yeah Jack, I would love to hear. I actually don’t know exactly how you found this whole thing, so I’d love to hear your story from there.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, so I was made aware of it from a member of our CashApp team, his name is Miles. We talk a lot about the space in crypto and he makes me aware of a bunch of the trends I might have missed, and just have conversations about it. He brought this up and forwarded a tweet that was actually passing the torch to me. Someone did mention me as a recipient of the torch. I looked into it and I thought it was just really cool. It was Bitcoin, Twitter, at its best and I wanted to participate. So our Cash team has Lightning nodes running so I worked with Miles and them to request the torch and then also just spread more awareness of this movement on Twitter and ultimately decided to pass it over to Elizabeth.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: And that was awesome by the way. People thought “Oh was it preplanned, or something”? I had no idea when I woke up that morning that you were going to do this.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Yeah, it’s going around to more and more people and in one instance, it’s actually gone… So Samson Moo had the torch and he requested that somebody send a Lightning network invoice via the block stream Satellite message service. Pavol Rusnak, the CTO of Satoshi Labs carried this out. So the Lightning torch has now gone through different countries and the message has literally been transmitted from out of this world.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: And also William Shatner tweeting about it as well.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Wow, that’s awesome.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Jack, do you have any ideas on who might be a good person to send the Lightning torch to next, perhaps someone like Elon Musk?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: That’s what everyone’s been suggesting. I think it’d be… He’s definitely had the, somewhat of a contentious relationship with crypto, specifically Ethereum, at least on Twitter.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: I believe Elon once tweeting a Twitter anime, sorry a Bitcoin anime character but…[crosstalk 00:18:57]\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Yeah, it was something like, “Do you want to buy Bitcoin?”\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Oh that’s cool.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: But yeah, broadly speaking, I think what’s been so fascinating about the torch. I mean, Jack getting involved, just it went viral, it blew up. It’s just one of those truly internet things. At first you don’t even fully really understand what’s going on and then you’re “Oh wow, people are just sending each other money instantly on the internet across 37 countries”. One of the really cool facts that some people have posted is, if this had been with the traditional system internationally, it would have taken months and the fees would have probably exceeded the amount sent. This is part of what Bitcoin and Lightning really make possible. To make this global.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: It just, it’s one of those internet things where you’re just “Okay, this is awesome, it’s random and we love it”.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Yeah exactly, and I think the other component is just that normally to send money, you have to go through all these different parties. But in this case it’s literally the Lightning invoice that you would paste. So I think that’s another example of how Lightning Network is uniquely suited to doing this kind of thing.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: And for us, I think the torch served as well as a kind of demonstration and even a stress test, if you will, of the network. One of the components of Lightning is that you need receiving capacity to get funds in. So for people to be able to ensure that they could send and receive effectively – and this something that we’re very acutely aware of in terms of the Lightning labs teams working on, Alex Bosworth has been doing great work there as well – it showed that actually, people can send and received and it is going to work. And that is I think really exciting for us to see.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Excellent. All right, so let’s now turn to a little bit more discussion on Square and the Cash App. So Jack, you gave us a little bit of a breakdown on how the Cash App came to include Bitcoin. I think another theme of the Cash App is just around financial empowerment and it’s very easy onboarding for a Bitcoin user. Can you tell us a little bit more on that?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, we started the Cash App about five years ago, just a little bit over that. It really just came out of a desire to build something fun that we could use. We wanted sending and receiving money to be as simple as communicating that. The way we started it was actually through email. You could create a new email, I might put Elizabeth’s address in the “To” line. I cc cash@square.com and in the subject line I could put “here’s five dollars”. And just by doing that it would send the money across, assuming all the email addresses are linked and whatnot. That was the original idea. We moved to an app not too long after that and that purity has remained. I think you see it in the design of the app, where it just starts right away with a keypad. We’re just trying to simplify and also, to amplify something Elizabeth said, try to make it a little bit more fun. A little bit more approachable and not make money feel like such a burden. But make it feel something that could be exciting and could be something that you want to engage with, rather than dread.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Since the launch of the app, we have been looking at just patterns of what people are doing with it and it led us to enabling people to store money with the app as well. Which led us to issuing a card that they could spend that money with and it’s on the Visa network so it’s accepted anywhere Visa’s accepted and online, offline. It works at any ATM so you can actually get physical paper money out as well, right from the Cash App. We put an ABA number on top of it so you can directly deposit your paycheck into it and Bitcoin felt like… It didn’t necessarily feel natural, but it felt like a really cool cultural experience and something that our customers would appreciate. And it turns out we were right about that. We tried to maintain that simple design ethos around buying and selling. We took a strong point of view that we would focus on buying and selling first. We also made sure that, as I alluded to early, that we weren’t just putting something out there and hoping for the best. That we were trying to help educate people.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Our team created this amazing, almost like a children’s book that kind of walks through what Bitcoin is. It’s called “My First Bitcoin”. Where it came from, what it’s being used for, a little bit in terms of where it might go. We also took on some principles to buy Bitcoin within Cash you have to buy them with money you have. We’re not going to allow a purchase through a credit card, so how do we enable more financial health around it. We have a lot of disclosures around just the potential risks involved. We really focused on our role as educators as well. And I think we have a pretty compelling experience that people who would not necessarily be able to get to Bitcoin in the past can now get to it with just one tap. They can plug right into that 24/7 network and see it living and breathing. We do intend to continue to expand it and do so in a way that feels simple, that feels approachable and ultimately what cash comes down to is just accessible. How do we increase the amount of people that can participate in the economy more promptly.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Cash has gone a really far way in that. We see people who have never had a bank account start with Cash and use it to obviously store their money, get the cash card, personalize it and then spend it wherever they are. And certainly, people can buy Bitcoin and then sell the Bitcoin and that goes in the Square account which they can… Their cash account which they can then use to spend via the Visa card. So I think it’s a pretty compelling experience but there’s a lot more we can do to get at some of the ideas that Elizabeth was talking about in terms of making it more transactional, making it more everyday. Going back to that idea of making it simple enough that I could justify using it to buy a cup of coffee in the morning.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Fantastic, and I love that the app has been quite successful from my understanding. It’s hit number one in the app store, it’s enabling all sorts of ways that really, you’re connecting Bitcoin with the existing financial rails. So that’s also a great theme. And in some sense, it’s almost challenging traditional retail banking.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, it’s definitely a consideration when you’re thinking about purchase bidding and the financial system and specifically going to the bank. I think generally, at Square we’ve generally just increased the aperture of who can participate. We still use a lot of the financial system and we have no intention to replace parts of it, but it does really speak to enabling more and more people to participate in a very simple and healthy way. That’s really our guiding light. How can we make something that feels very simple, straightforward, feels fast and also cool.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: And I think that’s the other awesome thing that we’re really proud of with the Cash App, is it’s become this cultural thing as well. It has a lot of influence in terms of just where it’s seen. We see a lot of musicians take to it and mention it in their songs and it feels that it has become somewhat of a cultural aspect and maybe helping to drive some culture as well. As we think about things like Cash App Friday, which is a trend on Instagram and Twitter that people are giving other people money, just because it’s Friday and just because they can. I think it’s cool, as Elizabeth talked about earlier, when you can work on technologies that people are making movements out of and we’re seeing some elements of that within the Cash App.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: And Jack, people on the Lightning Labs team, they absolutely love the boost that they get. And they also… I think the community in Bitcoin generally also really loves to be able to customize the card. I think that’s something that’s so simple and yet, people just go crazy over it, in both cases.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, the majority of the financial industry doesn’t really enable much personalization. It doesn’t enable a lot of… It doesn’t reflect a lot of humanity, so the team’s done an amazing job in terms of making sure that as we build something, it is reflective of humanity, it allows for a lot of customization, personalization. All that drives towards building a sense of ownership. It’s not just this one company that is building this app and service but it’s the individuals that really feel like they own part of it and own some of the direction of it which is real cool.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Fascinating. And so there have been a few ideas thrown around in terms of possible new features, one of which was this idea of enabling people to auto-buy Bitcoin with the savings that they get from the Cash App. Do you have any thoughts on that, Jack?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, we’ve definitely heard that ask and I think there’s something there. We haven’t explored it too much just yet but we do hear the call and we think it would be pretty compelling. A lot of, from my point of view, anything that we can do to help Bitcoin to be more seen as the currency use-case and a transactional use-case, that’s where we should be prioritizing right now and exploring and experimenting. So right now we’re thinking more on that dimension and how we might further that than what we currently have today. Because we have a good step today in the buy and sell paired with a card because it gives people a little bit of pause, “I’m not just spending from my Bitcoin account but I’m actually deliberately converting it to US dollar and in doing so I realize that this US dollar now is the amount I have. Rather than spend Bitcoin off the card and kind of see the fluctuation day by day”. So it’s just one of those psychological things that I think are important in the moment but as we get some better answers that becomes less and less of a need.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Fascinating. And also, what about ideas such as Lightning within the Cash App? Do you have any ideas there?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, we’ve been exploring with Elizabeth and the Lightning team, more around Lightning broadly. We have this massive seller network of small and medium and large businesses and back to the original hack week idea, we would love to make it as fast and efficient and transactional as possible and that includes looking at our seller base and our register. It’s not an if, it’s more of a when and how do we make sure that we’re getting the speed that we need and the efficiency.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: A lot of what we worked on, on the seller side, is making transactions as fast as possible. In the United States, not too long ago but three years ago, we started seeing more NFC adoption, more of the contactless payment adoption. This is something that we’d been trying to drive as quickly as possible because the US was also pushed into chip cards which can be rather slow.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Contactless is really really fast, but given that there’s not a lot of adoption on the consumer side yet, we wanted to make sure that if we had to deal with chip cards, we’re going to make it as fast as possible. We started with being able to read these chip cards in 12 seconds, we whittled it down to eight seconds, five seconds and I think we’re below three seconds right now on the chip card. So I think it’s one of the fastest chip cards readers out there and the reason we’re so obsessed with this is because that speed really, really matters. When you’re at a coffee store that’s high volume, if you’re waiting around for 12 seconds to complete a transaction that really impacts your queue and your ability to make more sales. And it might even cause you to lose sales because people just get frustrated with the line times and go somewhere else or forget… Or just get frustrated and decided they don’t need a coffee right now. From a seller perspective, from a merchant perspective, the speed is critical and that’s something that we really need to get right and obsess over.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: And similarly with Lightning I would say, people love to post videos of when they’ve bought something with Lightning. I think just the visual where you see somebody hit send and then your eye can’t really track between the send and the receive has been really exciting to see. The goal really being to enable this instant, near instant, definitely competing with the chip card and being faster than that transaction time. I think in the Bitcoin world people were used to, okay you had on average 10 minute conformation times or blocks, and so to just visually see that happen I think has been really exciting for the community and key to why people are using Lightning.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Excellent, excellent point there by the both of you. Another topic I was interested to discuss is just around this idea of enabling financial empowerment and enabling financial self-sovereignty. And one theme or one saying within Bitcoin, I believe popularized by Andreas, is this idea of “not your keys, not your coins”. So I suppose what I’ve driving towards there is, would there by any potential of an individual managing their own keys? Although obviously I understand there’s an element of customer education involved. But is that something that might be on the track?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, the think we love about the Bitcoin community is the openness and the amount of control it gives one. Anything that we can do to increase that, we’re definitely going to look at it, it’s just a question of, one: making sure that we continue to ensure privacy and security; and also ease of use. The more controls we put in front of someone, the more complicated it could become. So if we can derive an experience that keeps us simple then absolutely.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Yeah that’s a great plan. We have to appreciate the need for good design and good customer experience.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Yeah, so in terms of Lightning the non-custodial nature has been something that we as a community really care about as well. And especially getting Lightning running and mobile. Today there are quite a few mobile wallets out there. In some cases you can only send and not receive and that’s because we don’t yet have Watchtowers deployed on the network. So if somebody were to go offline for an extended period of time, there could be a risk of the funds being compromised. Of course we very much value security.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: We at Lightning Labs have been working on Neutrino, which is light client technology where we can’t expect somebody to download the 200 gigabytes of the Bitcoin blockchain on a phone. So they instead can download 10 or 20 megs, which is the normal size of data for an app an then be able to hold their own keys and have their own custody. So that’s something that I think in the Lightning community and for our team is a major priority.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: At the same time, there really is always going to be this trade off between usability and security. A simple username and password with a custodial service is often going to be easier to use than, okay, backup these 24 words. Make sure you have them in a safe place and the nature of it. Our goal, and I know it’s going to take some time to get there, is to make the non-custodial aspect of empowering people to hold their own funds, as easy as possible, but we know that it’s not going to happen overnight in that it’s going to be super easy. And if anything, I think, Square being a US dollar to Bitcoin gateway also play into that very well because people are able to hold dollars there. They’re able to convert out to Bitcoin and that they want to hold their own keys on Bitcoin or Lightning, they can do so with their own wallets.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Fantastic explanation there as well. All right, I was hoping to just transition now just to a little bit of discussion around Twitter. So there’ve been a couple of ideas there of Bitcoin and Lightning within Twitter. One potential idea people have thrown around is this idea of tipping using Lightning, just when you like somebodies tweet. Do you have any ideas around potential there, Jack?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: I think there’s a lot there. I think it’s really compelling and something that we want to spend a lot more time on. We finally have these technologies, more broadly at the blockchain level, that I think can help us address some of the challenges we’re facing with Twitter including; trust and identity and certainly the providing more economic incentive rather than just what Twitter provides today which is reach. The idea is to have a pretty active conversation within the company and around the company and we want to be smart about it and make sure that, again, we’re building something that feels really simple and accessible and is timed in the right way. But it’s definitely something that I would be excited about and would love to see.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: I would say the Bitcoin and the Lightning community especially… Twitter is the place where we’re all interacting right? And even when Jack tweeted about the Lightning torch, Jack then had a lot of other tweets about Bitcoin and the industry and people just went wild over it. In and of itself it became a meme this past week. I got so many messages, everyone saw it and I think it really is this key medium of communication so the idea of eventually… I also love the fact that Lightning invoice has too many characters so people were saying… Yes, Jack retweeted that as well. There was a secret plan to get Lightning invoices in there. But to me, being able to integrate that would be a dream for us and something that, fingers crossed, we’ll see people make happen.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Excellent and there’s also, just generally there could be this idea of paying for things with Bitcoin. For example, paying for promoted tweets and that could be another revenue source for Twitter.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, what the technology enables and it’s something that we could only dream that scale in the past but now it feels a whole lot more accessible and within reach.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: All right. So let’s talk now a little bit more broadly about Lightning Network. As I view it, I think it enables entire new industries or it can reinvigorate old ones so we can have micropayments for streamers, used in gaming, in online stores. Elizabeth, do you want to comment a little further on that.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Definitely yeah. So one of the reasons why I even wanted to work on Lightning and made this choice that I wanted to start this company around and really build around it was, the way that I saw it right now on the internet you can easily send somebody a photo or a video, via a variety of applications. But there was no easy way on the internet just to send value. And I’d be interested in copyright and opensource technologies and even the element of privacy and why were people be surveilled for ads on the internet? Couldn’t there be a better way? So that’s what got me excited about Lightning back in the day, 2014, 2015. It wasn’t even called Lightning, just payment channels as a technology back then. So it’s really been incredible to see the evolution from idea to a little bit of code to working network with numbers that are going up and up.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: One side point. At the end of last year somebody came along, we’d warned the community only to put small amounts into Lightning, 10s of dollars. And we have a channel limit in place. You can only have a maximum of .167 BTC, about $500, in a channel. But someone came along and decided they were just going to make a lot of channels of the max. So added over a million dollars at the time to Lightning and from our standpoint we were thinking “Well, we warned people not to”, but again it’s Bitcoin, people wouldn’t listen. So we’ve seen this incredible growth as well and attraction which has really been great to see.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Part of that I believe is creating this new economy. For example, there are multiple companies now that are building on lnd that have actually gotten funding. OpenNode is one, they’re doing merchant processing with Bitcoin and Lightning. There’s one called SparkSwap, so there are quite a few. Bitrefill has done amazing work. I believe today, aside from on-chain Bitcoin, Lightning is their number two method of payment and they accept a variety of different cryptocurrencies. And this is all while there isn’t even a good mobile wallet, especially a non-custodial one out there yet. I think the rise in mobile is going to be key for this year and we’ll just see these economies emerge. If anything, it’s going to be things that we just hadn’t even thought of today. That’s why I think there are so many analogies to the internet. Who’d have thought of Wikipedia years prior, decades prior? An encyclopedia that anybody could edit, that sounded insane. I think we’ll see something equivalent and similar with Lightning and just this new economy that emerges that’s this Lightning native economy.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Excellent articulation there Elizabeth. Also, I think another thing that might change in the future with the internet and with Bitcoin and Lightning is we might see slightly less of an advertising model, but more of a pay for service model. Do you have any thoughts on that?\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: One of the things that got me really excited about Lightning as a technology even before it was called Lightning, back in the day, payment channels and Bitcoin was this idea that, why did we need to on the internet necessarily give up privacy in order to use certain services? And why should we be tracked and surveilled? Even in the past there’s been widespread acknowledgement of a lot of the problems with the model internet that we[inaudible 00:42:20] and I was interested in areas along the lines of copyright and privacy and those all played into this interest. And I understood that Bitcoin on chain was not going to be able to handle a billion people’s transactions and building up this layered architecture of which Lightning is a key part. This can really make that possible.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Right now in the Lightning community we’re actually seeing services emerges for example, there’s yalls.org by Alex Bosworth where you can pay to read articles. There was just a Lightning powered SoundCloud. Soundcloud is a great website, I love it, I listen to it all the time. It would be amazing if you could integrate Lightning payments to pay musicians, artists and whatnot. I do see that there is the possibility. You can now send… There’s a great browser plugin called Lightning Joule that integrates them natively into web applications.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Nick Szabo has great writing on micropayments and how the mental overhead of micropayments, if you have to think every time you pay, doesn’t really work. But if you can automate that and you can just make it seamless and that the user can just pay a certain amount every time they listen to a song or read an article, there’s something potentially really powerful there. With the browser plugin and native integration into websites, I think we really are at the start of what could be a means to change the model of monetization of a large part of the web.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Jack, do you have any thoughts on that?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Yeah, I think all these technologies offer new alternatives. I think the model of the internet has evolved based on the technologies that existed and payments has extremely complicated and nuanced and unapproachable methods. Especially more the direct effortless payments that Elizabeth speaks to. As those open up, we can easily imagine entirely new models that we’re alluding to earlier that either are additive to current models or replacements for. I approach this with… As someone building a business, we need to build resilience. I think that in the past it has been a lack of really strong, well adopted and principled technology and a lot changes with blockchain and Bitcoin. It certainly opens up a lot more creativity and takes a bunch of excuses off the table not to start experimenting.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Excellent. Now one other topic I’d like to touch on is just this idea of companies that are building a product on Bitcoin and they’re leveraging its security and network. It’s often mutually beneficial to contribute to Bitcoin through open source development contributions or perhaps educational contributions. Jack, do you see any opportunities there for Square or potentially for Twitter?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Both. I think as I said earlier, the beauty of the Bitcoin community is its openness and we can’t be entities that just take. We have to contribute and push and really let go of this concept of ownership over a particular protocol or a way of doing things. Because contributing to such world will make us better but also everyone to participate more fully. It’s equivalent to everything that we benefit from opensource. At the same time we need to make sure that when we commit to releasing stuff or commit to the community that we can actually back it up over the long term. We’re not just going to put something out there and hope for the best in terms of other people maintaining it, but that we’re good stewards of our work as well. Especially the work that we share more broadly. So that would be the bar that we’d look at in terms of participation there.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: From a principles standpoint, we should be contributing to the openness and expanding the openness of the Bitcoin community and not just seeing it as something that we can take for or take from or even worse a vendor.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Fantastic answers. All right, so we’re getting towards the end of our time. I’d love to get some closing remarks from both of you. Perhaps thought on whether we are seeing an inflection point for Bitcoin and Lightning adoption in the coming years. Let’s go with you Elizabeth.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Sure. Within the Bitcoin community and even broadly within the cryptocurrency world, I think there’s this idea that Bitcoin moves slowly. But in fact Lightning is just moving so quickly I can’t keep up. A month or so ago some community members were tweeting “Lightning is moving too fast, stop guys, I just don’t know what’s happening.” It’s really, having seen something that you’ve been working on for so long finally come to life and come to fruition, has really just been eye-opening for us.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: I think the design philosophy embedded within Bitcoin, it’s not move fast and break things. It’s move cautiously and build a secure base layer and then build the layers on top of that. And Lightning is one of them so we can move quickly on the Lightning layer and ensure the embedded security on the Bitcoin layer. I think that’s really key to the philosophy within the community. And the way that I see it, it’s absolutely the early days. Many people are using Lightning nodes with the command line still and we’re really working on building out the user experience. We want to make sending on Lightning, we want to make it fun, we want to make it a meme. We just need to take the steps to get there. Getting the community involved, having people building on top of this, working with the real users and solving the real problems I think is all what’s going to get us there. But it’s not… It hasn’t happened over night and it’s not going to happen over night. This is the evolution in a way of the early days of the internet and Lightning will take a similar trajectory.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: But I will say if anything, if the next year or two is anything like the past one, there’s a very bright future ahead of us and I can’t wait to see what people build and how this is really going to help improve peoples lives.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Fantastic. And Jack, do you have any thoughts to add there?\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: I agree with Elizabeth. It doesn’t feel like there’s going to be just one inflection point. This is a technology that is amazingly, constantly evolving and doing so in what feels like a rapid pace but it is quite deliberate and I just have so much respect for that. It is something that is foundational, not just to the internet but also to society more broadly and breaks down so many barriers and boundaries around the world. We have to be really deliberate in our thinking.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: The thing that I’m trying to figure out for myself in terms of running a business is, how do we continue to expand that openness? How do we continue to be good citizens within this community and really push the envelope in terms of how we’re being good stewards. But also good implementers and helping this community make it happen without inflecting a bunch of the baggage that comes with a corporation. I think there’s a lot of topics there that are nuanced and complicated but really important for us to figure out because we don’t want the weight of a corporation or just the boundaries of corporations and corporate entities to really inflect any sort of color on this community. We want this community to be first and foremost focused on building something that is foundational for all humanity and to figure out how to be good partners in that and to do so in a way that comes at it with purity and honesty and directness. It’s something that I’m personally trying to figure out and open to ideas around.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: And I will say, we’re super lucky to have both of you in this community and I really believe this is a community. People are so passionate, people are so excited and it has that feeling, I think Jack, I’ve heard you mention this before, of these early internet days. Where there really is that passion and that’s I think part of what’s really going to make this whole thing work.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Excellent, I love the comments there around being foundational to the internet and potentially to society. Jack and Elizabeth, this has been a fantastic discussion that I have thoroughly enjoyed. Thank you both for coming on the show.\"}, {\"type\":\"paragraph\",\"text\":\"Elizabeth Stark: Thanks so much.\"}, {\"type\":\"paragraph\",\"text\":\"Jack Dorsey: Thank you so much.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: I hope you enjoyed that interview with Jack Dorsey and Elizabeth Stark. And if you did, make sure you share it out widely so that other people can also come to understand why Bitcoin may become the native currency of the internet. It’s an exciting time for Bitcoin and the Lightning Network which may become foundational to the internet and society. Make sure you stay well informed by subscribing to my podcast by searching Stephan Livera Podcast on major podcast platforms, Apple iTunes, Google Podcasts, Overcast, Pocketcasts, Spotify, etc. I’ve interviewed many of Bitcoins brightest, so if you haven’t already, I recommended taking a look at my back catalog.\"}, {\"type\":\"paragraph\",\"text\":\"Stephan Livera: Also, follow me on Twitter. My handle is @stephanlivera. And you can find the show notes on my website stephanlivera.com. That’s it from me, thanks for listening and I’ll speak to you soon.\"}",
    "body": "podcast: https://stephanlivera.com/episode/52/\n\nStephan Livera: Welcome to the Stephan Livera podcast, focused on Bitcoin and Austrian economics. Learn the technology and economics of Bitcoin by listening in to interviews with the best and brightest. It’s a very special episode today with Jack Dorsey, CEO of Twitter and Square, and also Elizabeth Stark, CEO of Lightning Labs.\n\nStephan Livera: I’ve been very impressed with Jack’s commentary on Bitcoin as potentially the native currency of the internet, and the way he’s been managing Square and one of Square’s products in particular, the Cash App, which allows for Bitcoin purchases and sales. The Cash App has been quite successful on the App Store charts, hitting number one.\n\nStephan Livera: Elizabeth Stark is the CEO of Lightning Labs, one of the all-star teams building the Lightning Network. Their brilliant team has consistently been making major contributions to the Lightning Network as a protocol, and also developing and shipping incredible products, such as lnd and associated software.\n\nStephan Livera: It’s a must-listen interview, so make sure to share it wide. Here’s the interview.\n\nStephan Livera: It’s my pleasure to welcome you to the show, Jack and Elizabeth.\n\nElizabeth Stark: Hey.\n\nJack Dorsey: Thanks for having us.\n\nStephan Livera: Let’s start with you, Jack. I’ve been really impressed by your commentary and I’d love to hear more about how you came to understand Bitcoin. Can you tell us your journey from first hearing of it to now believing that it could someday be native currency of the internet?\n\nJack Dorsey: I’ve been fascinated by the internet for a long time, probably since I was 11 in Saint Louis, Missouri. And Saint Louis, Missouri had a pretty active hacker culture, and we had the great fortune of having Wash U in the city that was also directly connected to the backbone of the internet pretty early on. A lot of the early BBS’s connected directly to that, so I could access things like IRC and Usenet, and Usenet is where I discovered old cypherpunks and that led me to a lot of reading on cryptography, and it was something I didn’t fully understand but really appreciated and obviously on alt cypherpunks. There was a lot of discussion around digital currency, around cryptocurrency, the role of cryptography.\n\nJack Dorsey: I didn’t get too deep into it in the sense that I implemented anything or played with a lot of the ideas, but it was a fascination. I had heard of Bitcoin when it started and just when the white paper was released. Looked at the white paper, thought it was pretty amazing, simple, beautiful. We were just getting started with Square at that time. And it wasn’t until 2014 that one of our engineers decided that they wanted to enable Square merchants online to accept Bitcoin and we made this very simple feature that allowed anyone on our online store to pay using Bitcoin without the seller having to be aware of it. So anyone can come up and go to a bike store online and pay through Bitcoin. And we could automatically translate it in the back end to US dollar. And it was cool, we wrote a blog post about it.\n\nJack Dorsey: We weren’t connected directly to the blockchain, we used a few APIs. We didn’t see many transactions, we just didn’t see much activity. The people using Bitcoin at the time weren’t buying the things that our merchants were selling per se. And then two years ago we had a hack week for the cash team and I found one of our engineers, Mike Brock, and I suggested that we worked together on it. He did the majority of the work but I suggested that we try something really simple which is, we had this ability to add a cash card, a Visa card, to Apple Pay. And we wanted to, by the end of the week, to be able to store Bitcoin and then actually use my phone at BlueBottle Coffee across the street, buy a cappuccino with Bitcoin and have it automatically translate to US dollar for the seller without them having to consider it.\n\nJack Dorsey: And we almost hit that goal, it didn’t really work until the following Monday. But it felt really good and really cool and that gave us a lot of conviction and also desire to… In this case we were connecting directly to the blockchain, we were learning a ton about how it worked and it just gave us a lot of conviction around, we should do something here. And throughout the year, it kept evolving into a buy and sell platform. Realized our role and responsibility in terms of educating people around it as well, because a lot of people would probably be new to it. And this was during the huge run up as well so we released it at the end of the year. I think it’s one of the simplest ways to fuel Bitcoin and to participate and to get a sense of what it is and what it could become.\n\nJack Dorsey: Ever since then we’ve just been continuing to push and educate ourselves and learn, but also attempting to be leads in the financial technology space. I think we were one of the first public companies to have a Bitcoin offering and one of the first to talk to the SEC about what that meant. We continued to pull the thread and I’m pretty excited to see where it goes, but ultimately we don’t believe it stops at just buying and selling. We do want to help make happen the currency aspect and helping the internet get to a native global currency.\n\nStephan Livera: Fascinating. I was particularly impressed that you were quite early being involved or at least following the material of the Cypherpunks. Is that what also gave you some understanding around Bitcoin’s principles and resilience?\n\nJack Dorsey: I had a lot of the background context in terms of what people wanted to see and some of their principles that people were driving with the ideas around cryptocurrency. But the whitepaper really laid it all out and I think it’s one of the most seminal works on computer science in the past few decades. I think it’s beautifully written. I think it is very principled and has a strong point of view and I love that it was put out there through pseudonymity which just feels very ‘internet’ to me. The whole thing just feels very native to internet ideals and that appealed to me a lot. Maybe this thing that was ideated on the internet and then created on the internet, released to it and continues to be developed throughout it. It’s been amazing, but the resilience comes from the fact that early on it had a fairly negative lens on top of it, just because of how people were using it, but it persisted through that.\n\nJack Dorsey: It also persisted through multiple forks and questions and scalability issues and certainly none of those are complete, but it really speaks to something that inherently has a natural resilience to it. I think the brand strength, the brand of Bitcoin, is just really spectacular and I think it enables some more of that resilience. It is a mainstream well known, quote/unquote, “household” concept. Not everyone really knows what it might be for or may have different perspectives about what it does but it’s known that it’s digital currency, digital money, digital asset. Even when I go back to St. Louis, and this was years ago, the brand recognition is so strong and awareness is so strong that people would ask me about it as soon as I would tell them I was in technology. So I think it has a lot going for it in terms of lasting power and ensuring that it endures.\n\nStephan Livera: An excellent answer Jack. I’m also interested to know why you focused so much particularly on Bitcoin and not necessarily some of the other projects in the space?\n\nJack Dorsey: Most of it is just due to the principles that created it. The community around it, the ideals that it fosters, the brand. But it’s also that there’s an element of practicality to it as well. Focusing on this and helping in whatever way we can with the community and helping to make it happen just can really focus our resources and our attention. I think there’s interesting ideas elsewhere, but I think those ideas can be integrated to Bitcoin if they have the merit that is above some bar. It feels like it’s the one that wants to be the currency the most versus others that are doing more general purpose things or distributed computing and whatnot. I think it’s spawned a lot of really amazing ideas but I’m focused on the currency aspect and focused on the transactional aspect and what that enables.\n\nStephan Livera: That’s excellent. I like the insights that you give there around that Bitcoin wants to be a currency the most around the transactional component as well. I think on that transactional component, let’s bring you in Elizabeth. Obviously, the Lightning Network, it enables so many new possibilities with Bitcoin such as incredibly low fees, extremely fast payments, improved customer experience. It can enable entirely new business models. Why are people so excited about the Lightning Network now?\n\nElizabeth Stark: It’s actually been amazing to see everything pan out. Actually, when I first met Jack it was summer of 2017, and we’d had a mutual friend that connected us. And my co founder Olaoluwa, AKA ‘Roasbeef’, and I went into the Square office and I remember that we were white-boarding and meeting with the team and talking about the cool things that Square was working on and even in 2017 we’d had a release of our lnd software for Testnet, but it wasn’t yet out for real Bitcoin. It was still mostly just something that was being tested and it wasn’t yet out into the world.\n\nElizabeth Stark: What we’ve seen over the past year has been… March 15th of 2018, our company Lightning Labs released the beta version of our lnd software. There are other betas that followed of other limitations and it was really the year where Lightning became real. People started spinning up nodes, they started building on top of it. It was also funny that prior to the beta releases, people were using Lightning even though, at least for our implementation, we said “guys it’s not ready yet” and they said “we don’t care, we’re going to modify the code, recompile it”. It’s Bitcoin, you can’t tell people what to do.\n\nElizabeth Stark: There have been a few factors lately that have really contributed to it. The first is just the evolution of the infrastructure. In March, things were still pretty early. Getting the implementations out in beta meant a lot of us could do testing. We had this super dedicated community. We have this Slack community, lnd developer and tester Slack, where people are testing every day. And they’re so passionate. And for them, it’s a hobby and it’s a way of life. I really think we’re building a movement here. Using the infrastructure billed out such that we’ve been able to find bugs, we’ve been able to add improvements, add more features.\n\nElizabeth Stark: We’ve also seen the developer community grow dramatically, which I think is a big part of this. There were these really cool Lightning hack days and they’re still happening. There was one in New York a few months ago, there’ve been several in Berlin and there are quite a lot of them popping up. There was one in [inaudible]. And so people are coming together, they’re building on top of Lightning. One thing that I think is really key is, lots of people are using it as well and that gets inside everything that happened with the torch. We’re seeing the evolution of developers, the infrastructure. And then third, I think the quote/unquote “Bear market” has… For us I don’t actually think it’s really a Bear market. When we started the company, the price of Bitcoin was $200, so it’s quite a bit higher today.\n\nElizabeth Stark: It’s brought us back to fundamentals as opposed to all the hype and hysteria and frenzy when the price is just skyrocketing. I think the focus on building and building out real infrastructure and solving real problems for real users is very healthy. I think that’s actually helped contribute to the uptake and Lightning hood option and what everyone’s building and just what people are doing with it.\n\nStephan Livera: Excellent. And I think on that theme of solving the real problems for real users, we’ve seen just an amazing array of new concepts and models for business come up. Can you talk to us a little bit about some of the, perhaps some of the new concepts that have come up in terms of businesses or services online that can be paid for with Lightning.\n\nElizabeth Stark: One of our team members, Alex Bosworth, who’s awesome Lightning developer has actually… Has awesome tweets by the way, follow him on Twitter. But he’s been tweeting a lot about the emerging Lightning economy. There’s also Nik Bhatia who’s been doing great work as well in terms of writing about the financial and economic aspects of Lightning and the time value of money and time values of Bitcoin matters on Lightning. We’ve actually seen this new economy develop where there are whole host of sites that only accept Lightning. So Bitcoin via Lightning obviously. And in many cases there were things that we hadn’t even imaging or thought of. For example, recently, somebody made a science fiction novel where you can pay per page. So if you don’t like the book, you can just stop paying. You can keep paying per page.\n\nElizabeth Stark: We saw some cool examples of Lightning on Twitch. People said “Oh, did Twitch integrate Lightning?” Turned out they didn’t need to because much like we were doing on Twitter, you can just add Lightning invoices in Twitch. We also saw people using a Unity plugin in games, where you can open this door and there’s a cool QR code and there’s instant inter-game interaction with Lightning. I think we’re seeing the start of this new economy of these used cases that weren’t previously possible. Today if you want to send five cents on the internet with the existing payment systems, and do so instantly and globally, that’s just not going to work. So I think what Jack was getting to, with the idea of Bitcoin being this digital money, being transactional. The goal with Lightning is really building this layer for programmable money, where anybody can build on top of it around the world.\n\nStephan Livera: Fantastic, I love that idea of being able to pay instantly and globally. Let’s talk now about the Lightning Network Trust Chain, also known as the Lightning Torch. I think that’s a fascinating example, so perhaps Elizabeth, you could just tell us a little bit about what it is and how it got started.\n\nElizabeth Stark: Yeah, one of the cool things about Lightning lately is that people are tweeting about how much fun it is. We’re bringing the fun back to money and also, that it’s kind of making money a meme. This is an example of that. Some members of the community were getting excited about sending funds on Lightning and I know they were using this site called tippin.me and then they were also… I believe a community member going by the name of Hodlonaut, he’s Norwegian. Getting back Jack to the whole internet thing, he has a space cat in an astronaut suit as his Twitter image and has a taco in his twitter name, which I think is exactly the kind of internet thing we need. Started thing whole, just started sending people money with Lightning and then people started sending it along and adding some satoshis and adding some satoshis.\n\nElizabeth Stark: One key point with Lightning as well is that people like to nanominate in satoshis, it makes it a lot more fun. One Sat is four thousandths of a cent or something. So they’re doing so in satoshis and we were watching from my team, this is interesting. Money is going viral and they’re just passing it along like this Olympic torch and then all of a sudden it started being sent to all these different places around the world. At one point we thought somebody had “exit scammed”, quote/unquote. We thought somebody had taken the money and actually it was more like a social experiment to see how people would react and then, because anybody at any point could have just taken the money.\n\nElizabeth Stark: Yeah Jack, I would love to hear. I actually don’t know exactly how you found this whole thing, so I’d love to hear your story from there.\n\nJack Dorsey: Yeah, so I was made aware of it from a member of our CashApp team, his name is Miles. We talk a lot about the space in crypto and he makes me aware of a bunch of the trends I might have missed, and just have conversations about it. He brought this up and forwarded a tweet that was actually passing the torch to me. Someone did mention me as a recipient of the torch. I looked into it and I thought it was just really cool. It was Bitcoin, Twitter, at its best and I wanted to participate. So our Cash team has Lightning nodes running so I worked with Miles and them to request the torch and then also just spread more awareness of this movement on Twitter and ultimately decided to pass it over to Elizabeth.\n\nElizabeth Stark: And that was awesome by the way. People thought “Oh was it preplanned, or something”? I had no idea when I woke up that morning that you were going to do this.\n\nStephan Livera: Yeah, it’s going around to more and more people and in one instance, it’s actually gone… So Samson Moo had the torch and he requested that somebody send a Lightning network invoice via the block stream Satellite message service. Pavol Rusnak, the CTO of Satoshi Labs carried this out. So the Lightning torch has now gone through different countries and the message has literally been transmitted from out of this world.\n\nElizabeth Stark: And also William Shatner tweeting about it as well.\n\nJack Dorsey: Wow, that’s awesome.\n\nStephan Livera: Jack, do you have any ideas on who might be a good person to send the Lightning torch to next, perhaps someone like Elon Musk?\n\nJack Dorsey: That’s what everyone’s been suggesting. I think it’d be… He’s definitely had the, somewhat of a contentious relationship with crypto, specifically Ethereum, at least on Twitter.\n\nElizabeth Stark: I believe Elon once tweeting a Twitter anime, sorry a Bitcoin anime character but…[crosstalk 00:18:57]\n\nStephan Livera: Yeah, it was something like, “Do you want to buy Bitcoin?”\n\nJack Dorsey: Oh that’s cool.\n\nElizabeth Stark: But yeah, broadly speaking, I think what’s been so fascinating about the torch. I mean, Jack getting involved, just it went viral, it blew up. It’s just one of those truly internet things. At first you don’t even fully really understand what’s going on and then you’re “Oh wow, people are just sending each other money instantly on the internet across 37 countries”. One of the really cool facts that some people have posted is, if this had been with the traditional system internationally, it would have taken months and the fees would have probably exceeded the amount sent. This is part of what Bitcoin and Lightning really make possible. To make this global.\n\nElizabeth Stark: It just, it’s one of those internet things where you’re just “Okay, this is awesome, it’s random and we love it”.\n\nStephan Livera: Yeah exactly, and I think the other component is just that normally to send money, you have to go through all these different parties. But in this case it’s literally the Lightning invoice that you would paste. So I think that’s another example of how Lightning Network is uniquely suited to doing this kind of thing.\n\nElizabeth Stark: And for us, I think the torch served as well as a kind of demonstration and even a stress test, if you will, of the network. One of the components of Lightning is that you need receiving capacity to get funds in. So for people to be able to ensure that they could send and receive effectively – and this something that we’re very acutely aware of in terms of the Lightning labs teams working on, Alex Bosworth has been doing great work there as well – it showed that actually, people can send and received and it is going to work. And that is I think really exciting for us to see.\n\nStephan Livera: Excellent. All right, so let’s now turn to a little bit more discussion on Square and the Cash App. So Jack, you gave us a little bit of a breakdown on how the Cash App came to include Bitcoin. I think another theme of the Cash App is just around financial empowerment and it’s very easy onboarding for a Bitcoin user. Can you tell us a little bit more on that?\n\nJack Dorsey: Yeah, we started the Cash App about five years ago, just a little bit over that. It really just came out of a desire to build something fun that we could use. We wanted sending and receiving money to be as simple as communicating that. The way we started it was actually through email. You could create a new email, I might put Elizabeth’s address in the “To” line. I cc cash@square.com and in the subject line I could put “here’s five dollars”. And just by doing that it would send the money across, assuming all the email addresses are linked and whatnot. That was the original idea. We moved to an app not too long after that and that purity has remained. I think you see it in the design of the app, where it just starts right away with a keypad. We’re just trying to simplify and also, to amplify something Elizabeth said, try to make it a little bit more fun. A little bit more approachable and not make money feel like such a burden. But make it feel something that could be exciting and could be something that you want to engage with, rather than dread.\n\nJack Dorsey: Since the launch of the app, we have been looking at just patterns of what people are doing with it and it led us to enabling people to store money with the app as well. Which led us to issuing a card that they could spend that money with and it’s on the Visa network so it’s accepted anywhere Visa’s accepted and online, offline. It works at any ATM so you can actually get physical paper money out as well, right from the Cash App. We put an ABA number on top of it so you can directly deposit your paycheck into it and Bitcoin felt like… It didn’t necessarily feel natural, but it felt like a really cool cultural experience and something that our customers would appreciate. And it turns out we were right about that. We tried to maintain that simple design ethos around buying and selling. We took a strong point of view that we would focus on buying and selling first. We also made sure that, as I alluded to early, that we weren’t just putting something out there and hoping for the best. That we were trying to help educate people.\n\nJack Dorsey: Our team created this amazing, almost like a children’s book that kind of walks through what Bitcoin is. It’s called “My First Bitcoin”. Where it came from, what it’s being used for, a little bit in terms of where it might go. We also took on some principles to buy Bitcoin within Cash you have to buy them with money you have. We’re not going to allow a purchase through a credit card, so how do we enable more financial health around it. We have a lot of disclosures around just the potential risks involved. We really focused on our role as educators as well. And I think we have a pretty compelling experience that people who would not necessarily be able to get to Bitcoin in the past can now get to it with just one tap. They can plug right into that 24/7 network and see it living and breathing. We do intend to continue to expand it and do so in a way that feels simple, that feels approachable and ultimately what cash comes down to is just accessible. How do we increase the amount of people that can participate in the economy more promptly.\n\nJack Dorsey: Cash has gone a really far way in that. We see people who have never had a bank account start with Cash and use it to obviously store their money, get the cash card, personalize it and then spend it wherever they are. And certainly, people can buy Bitcoin and then sell the Bitcoin and that goes in the Square account which they can… Their cash account which they can then use to spend via the Visa card. So I think it’s a pretty compelling experience but there’s a lot more we can do to get at some of the ideas that Elizabeth was talking about in terms of making it more transactional, making it more everyday. Going back to that idea of making it simple enough that I could justify using it to buy a cup of coffee in the morning.\n\nStephan Livera: Fantastic, and I love that the app has been quite successful from my understanding. It’s hit number one in the app store, it’s enabling all sorts of ways that really, you’re connecting Bitcoin with the existing financial rails. So that’s also a great theme. And in some sense, it’s almost challenging traditional retail banking.\n\nJack Dorsey: Yeah, it’s definitely a consideration when you’re thinking about purchase bidding and the financial system and specifically going to the bank. I think generally, at Square we’ve generally just increased the aperture of who can participate. We still use a lot of the financial system and we have no intention to replace parts of it, but it does really speak to enabling more and more people to participate in a very simple and healthy way. That’s really our guiding light. How can we make something that feels very simple, straightforward, feels fast and also cool.\n\nJack Dorsey: And I think that’s the other awesome thing that we’re really proud of with the Cash App, is it’s become this cultural thing as well. It has a lot of influence in terms of just where it’s seen. We see a lot of musicians take to it and mention it in their songs and it feels that it has become somewhat of a cultural aspect and maybe helping to drive some culture as well. As we think about things like Cash App Friday, which is a trend on Instagram and Twitter that people are giving other people money, just because it’s Friday and just because they can. I think it’s cool, as Elizabeth talked about earlier, when you can work on technologies that people are making movements out of and we’re seeing some elements of that within the Cash App.\n\nElizabeth Stark: And Jack, people on the Lightning Labs team, they absolutely love the boost that they get. And they also… I think the community in Bitcoin generally also really loves to be able to customize the card. I think that’s something that’s so simple and yet, people just go crazy over it, in both cases.\n\nJack Dorsey: Yeah, the majority of the financial industry doesn’t really enable much personalization. It doesn’t enable a lot of… It doesn’t reflect a lot of humanity, so the team’s done an amazing job in terms of making sure that as we build something, it is reflective of humanity, it allows for a lot of customization, personalization. All that drives towards building a sense of ownership. It’s not just this one company that is building this app and service but it’s the individuals that really feel like they own part of it and own some of the direction of it which is real cool.\n\nStephan Livera: Fascinating. And so there have been a few ideas thrown around in terms of possible new features, one of which was this idea of enabling people to auto-buy Bitcoin with the savings that they get from the Cash App. Do you have any thoughts on that, Jack?\n\nJack Dorsey: Yeah, we’ve definitely heard that ask and I think there’s something there. We haven’t explored it too much just yet but we do hear the call and we think it would be pretty compelling. A lot of, from my point of view, anything that we can do to help Bitcoin to be more seen as the currency use-case and a transactional use-case, that’s where we should be prioritizing right now and exploring and experimenting. So right now we’re thinking more on that dimension and how we might further that than what we currently have today. Because we have a good step today in the buy and sell paired with a card because it gives people a little bit of pause, “I’m not just spending from my Bitcoin account but I’m actually deliberately converting it to US dollar and in doing so I realize that this US dollar now is the amount I have. Rather than spend Bitcoin off the card and kind of see the fluctuation day by day”. So it’s just one of those psychological things that I think are important in the moment but as we get some better answers that becomes less and less of a need.\n\nStephan Livera: Fascinating. And also, what about ideas such as Lightning within the Cash App? Do you have any ideas there?\n\nJack Dorsey: Yeah, we’ve been exploring with Elizabeth and the Lightning team, more around Lightning broadly. We have this massive seller network of small and medium and large businesses and back to the original hack week idea, we would love to make it as fast and efficient and transactional as possible and that includes looking at our seller base and our register. It’s not an if, it’s more of a when and how do we make sure that we’re getting the speed that we need and the efficiency.\n\nJack Dorsey: A lot of what we worked on, on the seller side, is making transactions as fast as possible. In the United States, not too long ago but three years ago, we started seeing more NFC adoption, more of the contactless payment adoption. This is something that we’d been trying to drive as quickly as possible because the US was also pushed into chip cards which can be rather slow.\n\nJack Dorsey: Contactless is really really fast, but given that there’s not a lot of adoption on the consumer side yet, we wanted to make sure that if we had to deal with chip cards, we’re going to make it as fast as possible. We started with being able to read these chip cards in 12 seconds, we whittled it down to eight seconds, five seconds and I think we’re below three seconds right now on the chip card. So I think it’s one of the fastest chip cards readers out there and the reason we’re so obsessed with this is because that speed really, really matters. When you’re at a coffee store that’s high volume, if you’re waiting around for 12 seconds to complete a transaction that really impacts your queue and your ability to make more sales. And it might even cause you to lose sales because people just get frustrated with the line times and go somewhere else or forget… Or just get frustrated and decided they don’t need a coffee right now. From a seller perspective, from a merchant perspective, the speed is critical and that’s something that we really need to get right and obsess over.\n\nElizabeth Stark: And similarly with Lightning I would say, people love to post videos of when they’ve bought something with Lightning. I think just the visual where you see somebody hit send and then your eye can’t really track between the send and the receive has been really exciting to see. The goal really being to enable this instant, near instant, definitely competing with the chip card and being faster than that transaction time. I think in the Bitcoin world people were used to, okay you had on average 10 minute conformation times or blocks, and so to just visually see that happen I think has been really exciting for the community and key to why people are using Lightning.\n\nStephan Livera: Excellent, excellent point there by the both of you. Another topic I was interested to discuss is just around this idea of enabling financial empowerment and enabling financial self-sovereignty. And one theme or one saying within Bitcoin, I believe popularized by Andreas, is this idea of “not your keys, not your coins”. So I suppose what I’ve driving towards there is, would there by any potential of an individual managing their own keys? Although obviously I understand there’s an element of customer education involved. But is that something that might be on the track?\n\nJack Dorsey: Yeah, the think we love about the Bitcoin community is the openness and the amount of control it gives one. Anything that we can do to increase that, we’re definitely going to look at it, it’s just a question of, one: making sure that we continue to ensure privacy and security; and also ease of use. The more controls we put in front of someone, the more complicated it could become. So if we can derive an experience that keeps us simple then absolutely.\n\nStephan Livera: Yeah that’s a great plan. We have to appreciate the need for good design and good customer experience.\n\nElizabeth Stark: Yeah, so in terms of Lightning the non-custodial nature has been something that we as a community really care about as well. And especially getting Lightning running and mobile. Today there are quite a few mobile wallets out there. In some cases you can only send and not receive and that’s because we don’t yet have Watchtowers deployed on the network. So if somebody were to go offline for an extended period of time, there could be a risk of the funds being compromised. Of course we very much value security.\n\nElizabeth Stark: We at Lightning Labs have been working on Neutrino, which is light client technology where we can’t expect somebody to download the 200 gigabytes of the Bitcoin blockchain on a phone. So they instead can download 10 or 20 megs, which is the normal size of data for an app an then be able to hold their own keys and have their own custody. So that’s something that I think in the Lightning community and for our team is a major priority.\n\nElizabeth Stark: At the same time, there really is always going to be this trade off between usability and security. A simple username and password with a custodial service is often going to be easier to use than, okay, backup these 24 words. Make sure you have them in a safe place and the nature of it. Our goal, and I know it’s going to take some time to get there, is to make the non-custodial aspect of empowering people to hold their own funds, as easy as possible, but we know that it’s not going to happen overnight in that it’s going to be super easy. And if anything, I think, Square being a US dollar to Bitcoin gateway also play into that very well because people are able to hold dollars there. They’re able to convert out to Bitcoin and that they want to hold their own keys on Bitcoin or Lightning, they can do so with their own wallets.\n\nStephan Livera: Fantastic explanation there as well. All right, I was hoping to just transition now just to a little bit of discussion around Twitter. So there’ve been a couple of ideas there of Bitcoin and Lightning within Twitter. One potential idea people have thrown around is this idea of tipping using Lightning, just when you like somebodies tweet. Do you have any ideas around potential there, Jack?\n\nJack Dorsey: I think there’s a lot there. I think it’s really compelling and something that we want to spend a lot more time on. We finally have these technologies, more broadly at the blockchain level, that I think can help us address some of the challenges we’re facing with Twitter including; trust and identity and certainly the providing more economic incentive rather than just what Twitter provides today which is reach. The idea is to have a pretty active conversation within the company and around the company and we want to be smart about it and make sure that, again, we’re building something that feels really simple and accessible and is timed in the right way. But it’s definitely something that I would be excited about and would love to see.\n\nElizabeth Stark: I would say the Bitcoin and the Lightning community especially… Twitter is the place where we’re all interacting right? And even when Jack tweeted about the Lightning torch, Jack then had a lot of other tweets about Bitcoin and the industry and people just went wild over it. In and of itself it became a meme this past week. I got so many messages, everyone saw it and I think it really is this key medium of communication so the idea of eventually… I also love the fact that Lightning invoice has too many characters so people were saying… Yes, Jack retweeted that as well. There was a secret plan to get Lightning invoices in there. But to me, being able to integrate that would be a dream for us and something that, fingers crossed, we’ll see people make happen.\n\nStephan Livera: Excellent and there’s also, just generally there could be this idea of paying for things with Bitcoin. For example, paying for promoted tweets and that could be another revenue source for Twitter.\n\nJack Dorsey: Yeah, what the technology enables and it’s something that we could only dream that scale in the past but now it feels a whole lot more accessible and within reach.\n\nStephan Livera: All right. So let’s talk now a little bit more broadly about Lightning Network. As I view it, I think it enables entire new industries or it can reinvigorate old ones so we can have micropayments for streamers, used in gaming, in online stores. Elizabeth, do you want to comment a little further on that.\n\nElizabeth Stark: Definitely yeah. So one of the reasons why I even wanted to work on Lightning and made this choice that I wanted to start this company around and really build around it was, the way that I saw it right now on the internet you can easily send somebody a photo or a video, via a variety of applications. But there was no easy way on the internet just to send value. And I’d be interested in copyright and opensource technologies and even the element of privacy and why were people be surveilled for ads on the internet? Couldn’t there be a better way? So that’s what got me excited about Lightning back in the day, 2014, 2015. It wasn’t even called Lightning, just payment channels as a technology back then. So it’s really been incredible to see the evolution from idea to a little bit of code to working network with numbers that are going up and up.\n\nElizabeth Stark: One side point. At the end of last year somebody came along, we’d warned the community only to put small amounts into Lightning, 10s of dollars. And we have a channel limit in place. You can only have a maximum of .167 BTC, about $500, in a channel. But someone came along and decided they were just going to make a lot of channels of the max. So added over a million dollars at the time to Lightning and from our standpoint we were thinking “Well, we warned people not to”, but again it’s Bitcoin, people wouldn’t listen. So we’ve seen this incredible growth as well and attraction which has really been great to see.\n\nElizabeth Stark: Part of that I believe is creating this new economy. For example, there are multiple companies now that are building on lnd that have actually gotten funding. OpenNode is one, they’re doing merchant processing with Bitcoin and Lightning. There’s one called SparkSwap, so there are quite a few. Bitrefill has done amazing work. I believe today, aside from on-chain Bitcoin, Lightning is their number two method of payment and they accept a variety of different cryptocurrencies. And this is all while there isn’t even a good mobile wallet, especially a non-custodial one out there yet. I think the rise in mobile is going to be key for this year and we’ll just see these economies emerge. If anything, it’s going to be things that we just hadn’t even thought of today. That’s why I think there are so many analogies to the internet. Who’d have thought of Wikipedia years prior, decades prior? An encyclopedia that anybody could edit, that sounded insane. I think we’ll see something equivalent and similar with Lightning and just this new economy that emerges that’s this Lightning native economy.\n\nStephan Livera: Excellent articulation there Elizabeth. Also, I think another thing that might change in the future with the internet and with Bitcoin and Lightning is we might see slightly less of an advertising model, but more of a pay for service model. Do you have any thoughts on that?\n\nElizabeth Stark: One of the things that got me really excited about Lightning as a technology even before it was called Lightning, back in the day, payment channels and Bitcoin was this idea that, why did we need to on the internet necessarily give up privacy in order to use certain services? And why should we be tracked and surveilled? Even in the past there’s been widespread acknowledgement of a lot of the problems with the model internet that we[inaudible 00:42:20] and I was interested in areas along the lines of copyright and privacy and those all played into this interest. And I understood that Bitcoin on chain was not going to be able to handle a billion people’s transactions and building up this layered architecture of which Lightning is a key part. This can really make that possible.\n\nElizabeth Stark: Right now in the Lightning community we’re actually seeing services emerges for example, there’s yalls.org by Alex Bosworth where you can pay to read articles. There was just a Lightning powered SoundCloud. Soundcloud is a great website, I love it, I listen to it all the time. It would be amazing if you could integrate Lightning payments to pay musicians, artists and whatnot. I do see that there is the possibility. You can now send… There’s a great browser plugin called Lightning Joule that integrates them natively into web applications.\n\nElizabeth Stark: Nick Szabo has great writing on micropayments and how the mental overhead of micropayments, if you have to think every time you pay, doesn’t really work. But if you can automate that and you can just make it seamless and that the user can just pay a certain amount every time they listen to a song or read an article, there’s something potentially really powerful there. With the browser plugin and native integration into websites, I think we really are at the start of what could be a means to change the model of monetization of a large part of the web.\n\nStephan Livera: Jack, do you have any thoughts on that?\n\nJack Dorsey: Yeah, I think all these technologies offer new alternatives. I think the model of the internet has evolved based on the technologies that existed and payments has extremely complicated and nuanced and unapproachable methods. Especially more the direct effortless payments that Elizabeth speaks to. As those open up, we can easily imagine entirely new models that we’re alluding to earlier that either are additive to current models or replacements for. I approach this with… As someone building a business, we need to build resilience. I think that in the past it has been a lack of really strong, well adopted and principled technology and a lot changes with blockchain and Bitcoin. It certainly opens up a lot more creativity and takes a bunch of excuses off the table not to start experimenting.\n\nStephan Livera: Excellent. Now one other topic I’d like to touch on is just this idea of companies that are building a product on Bitcoin and they’re leveraging its security and network. It’s often mutually beneficial to contribute to Bitcoin through open source development contributions or perhaps educational contributions. Jack, do you see any opportunities there for Square or potentially for Twitter?\n\nJack Dorsey: Both. I think as I said earlier, the beauty of the Bitcoin community is its openness and we can’t be entities that just take. We have to contribute and push and really let go of this concept of ownership over a particular protocol or a way of doing things. Because contributing to such world will make us better but also everyone to participate more fully. It’s equivalent to everything that we benefit from opensource. At the same time we need to make sure that when we commit to releasing stuff or commit to the community that we can actually back it up over the long term. We’re not just going to put something out there and hope for the best in terms of other people maintaining it, but that we’re good stewards of our work as well. Especially the work that we share more broadly. So that would be the bar that we’d look at in terms of participation there.\n\nJack Dorsey: From a principles standpoint, we should be contributing to the openness and expanding the openness of the Bitcoin community and not just seeing it as something that we can take for or take from or even worse a vendor.\n\nStephan Livera: Fantastic answers. All right, so we’re getting towards the end of our time. I’d love to get some closing remarks from both of you. Perhaps thought on whether we are seeing an inflection point for Bitcoin and Lightning adoption in the coming years. Let’s go with you Elizabeth.\n\nElizabeth Stark: Sure. Within the Bitcoin community and even broadly within the cryptocurrency world, I think there’s this idea that Bitcoin moves slowly. But in fact Lightning is just moving so quickly I can’t keep up. A month or so ago some community members were tweeting “Lightning is moving too fast, stop guys, I just don’t know what’s happening.” It’s really, having seen something that you’ve been working on for so long finally come to life and come to fruition, has really just been eye-opening for us.\n\nElizabeth Stark: I think the design philosophy embedded within Bitcoin, it’s not move fast and break things. It’s move cautiously and build a secure base layer and then build the layers on top of that. And Lightning is one of them so we can move quickly on the Lightning layer and ensure the embedded security on the Bitcoin layer. I think that’s really key to the philosophy within the community. And the way that I see it, it’s absolutely the early days. Many people are using Lightning nodes with the command line still and we’re really working on building out the user experience. We want to make sending on Lightning, we want to make it fun, we want to make it a meme. We just need to take the steps to get there. Getting the community involved, having people building on top of this, working with the real users and solving the real problems I think is all what’s going to get us there. But it’s not… It hasn’t happened over night and it’s not going to happen over night. This is the evolution in a way of the early days of the internet and Lightning will take a similar trajectory.\n\nElizabeth Stark: But I will say if anything, if the next year or two is anything like the past one, there’s a very bright future ahead of us and I can’t wait to see what people build and how this is really going to help improve peoples lives.\n\nStephan Livera: Fantastic. And Jack, do you have any thoughts to add there?\n\nJack Dorsey: I agree with Elizabeth. It doesn’t feel like there’s going to be just one inflection point. This is a technology that is amazingly, constantly evolving and doing so in what feels like a rapid pace but it is quite deliberate and I just have so much respect for that. It is something that is foundational, not just to the internet but also to society more broadly and breaks down so many barriers and boundaries around the world. We have to be really deliberate in our thinking.\n\nJack Dorsey: The thing that I’m trying to figure out for myself in terms of running a business is, how do we continue to expand that openness? How do we continue to be good citizens within this community and really push the envelope in terms of how we’re being good stewards. But also good implementers and helping this community make it happen without inflecting a bunch of the baggage that comes with a corporation. I think there’s a lot of topics there that are nuanced and complicated but really important for us to figure out because we don’t want the weight of a corporation or just the boundaries of corporations and corporate entities to really inflect any sort of color on this community. We want this community to be first and foremost focused on building something that is foundational for all humanity and to figure out how to be good partners in that and to do so in a way that comes at it with purity and honesty and directness. It’s something that I’m personally trying to figure out and open to ideas around.\n\nElizabeth Stark: And I will say, we’re super lucky to have both of you in this community and I really believe this is a community. People are so passionate, people are so excited and it has that feeling, I think Jack, I’ve heard you mention this before, of these early internet days. Where there really is that passion and that’s I think part of what’s really going to make this whole thing work.\n\nStephan Livera: Excellent, I love the comments there around being foundational to the internet and potentially to society. Jack and Elizabeth, this has been a fantastic discussion that I have thoroughly enjoyed. Thank you both for coming on the show.\n\nElizabeth Stark: Thanks so much.\n\nJack Dorsey: Thank you so much.\n\nStephan Livera: I hope you enjoyed that interview with Jack Dorsey and Elizabeth Stark. And if you did, make sure you share it out widely so that other people can also come to understand why Bitcoin may become the native currency of the internet. It’s an exciting time for Bitcoin and the Lightning Network which may become foundational to the internet and society. Make sure you stay well informed by subscribing to my podcast by searching Stephan Livera Podcast on major podcast platforms, Apple iTunes, Google Podcasts, Overcast, Pocketcasts, Spotify, etc. I’ve interviewed many of Bitcoins brightest, so if you haven’t already, I recommended taking a look at my back catalog.\n\nStephan Livera: Also, follow me on Twitter. My handle is @stephanlivera. And you can find the show notes on my website stephanlivera.com. That’s it from me, thanks for listening and I’ll speak to you soon.\n\n",
    "body_type": "markdown",
    "created_at": "2019-02-11T00:00:00.000Z",
    "domain": "https://btctranscripts.com/",
    "url": "https://btctranscripts.com/stephan-livera-podcast/2019-02-11-jack-dorsey-elizabeth-stark",
    "categories": [
        "podcast"
    ],
    "media": "https://stephanlivera.com/download-episode/975/52.mp3",
    "authors": [
        "Jack Dorsey",
        "Elizabeth Stark"
    ],
    "indexed_at": "2024-03-21T16:33:37.139Z",
    "transcript_by": "Stephan Livera",
    "summary": "In a recent enlightening episode of the Stephan Livera podcast, industry luminaries Jack Dorsey and Elizabeth Stark engaged in a comprehensive discussion on Bitcoin, its implications for Austrian economics, and the transformative potential of technological advancements like the Lightning Network. Their dialogue illuminated the intricate relationship between digital currency development and the broader financial ecosystem, offering insights into how these innovations could reshape internet transactions.\n\nJack Dorsey's narrative began with his early fascination with the internet and cryptography, rooted in the hacker culture of Saint Louis, Missouri. This curiosity laid the foundation for his profound appreciation for Bitcoin and its principles. Dorsey recounted the pivotal moment in 2014 when his company, Square, first experimented with Bitcoin transactions, signifying the beginning of a deeper exploration into digital currency. His journey from initial intrigue to significant engagement underscores Square's strategic focus on Bitcoin due to its potential to facilitate seamless transactions and align with the company's mission of economic empowerment.\n\nElizabeth Stark offered her perspective on the impact of the Lightning Network on enhancing Bitcoin's scalability and utility. She detailed the origins and developmental journey of Lightning Labs, emphasizing the community's commitment to advancing this technology. The Lightning Network promises low fees and rapid transactions, laying the groundwork for innovative business models and a flourishing ecosystem centered on efficiency and inclusivity. Stark's remarks highlighted the network's role in fostering a new paradigm for financial interactions online.\n\nAs the conversation unfolded, it became evident that Bitcoin's integration with the Lightning Network signals a shift towards more inclusive, efficient, and flexible economic possibilities. Innovations such as microtransactions facilitated by the Lightning Network exemplify the breaking down of traditional payment barriers, offering a glimpse into a future where digital currencies are integral to everyday transactions. The discussion of the Lightning Network Trust Chain, or 'Lightning Torch,' further illustrated the playful yet significant capacity of these technologies to make financial exchanges viral, borderless, and instantaneous.\n\nThe dialogue also touched upon the societal and cultural dimensions of financial technology, as evidenced by phenomena like Cash App Friday. This movement showcases the communal spirit enabled by modern financial applications, highlighting a shift towards personalized, user-driven services. Jack Dorsey's vision for integrating cryptocurrency transactions into daily financial activities through innovations like the Cash App reflects a broader ambition to enhance the utility and accessibility of digital currencies. Additionally, discussions around security and control over digital assets underscored the ongoing efforts to empower users with full command over their funds while maintaining ease of use.\n\nIn concluding their engaging conversation, Elizabeth Stark and Jack Dorsey expressed optimism about the future of Bitcoin and the Lightning Network. They drew parallels between the early days of the internet and the current evolution of the Lightning infrastructure, suggesting a promising trajectory for widespread adoption and utility. Their dialogue emphasized the importance of a symbiotic relationship between companies and the open-source community, advocating for a collaborative approach that respects the principles of the Bitcoin ecosystem.\n\nThis podcast episode not only shed light on the current state of Bitcoin and the Lightning Network but also sparked enthusiasm for the potential of these technologies to revolutionize privacy, monetization, and societal structures. Through their insightful discussion, Stark and Dorsey painted a hopeful picture of a future where digital currencies and decentralized technologies redefine our digital and economic landscapes."
}